{
  "name": "Fospha",
  "avatar": "https://photos.angel.co/startups/i/1082592-11804187c6e73a048e784f925346d28f-medium_jpg.jpg?buster=1524219201",
  "slogan": "Transforming marketing performance",
  "description": "Fospha is an analytics company looking at user journeys through online and offline systems. Our work is relevant to many industry sectors and combines computer science, software engineering, mathematics, data science and user interface design. \n\nThe largest current demand we have is to help companies discover, report on and improve the economics of acquiring new customers and to attribute customer acquisition costs to the value those customers generate over their lifetime.  This involves data integration to follow user activities over time and across different systems, correlation and analysis to link together the actions of individual users across all the devices they might be using, segmentation of users against the routes they arrive on, their behaviour and their outcomes, and predictive modelling to identify probable outcomes and trigger automatic interventions to improve those outcomes.",
  "links": [
    {
      "type": "website",
      "url": "http://www.fospha.com/"
    },
    {
      "type": "blog",
      "url": ""
    },
    {
      "type": "twitter",
      "url": "https://twitter.com/wearefospha"
    },
    {
      "type": "facebook",
      "url": "https://en-gb.facebook.com/Fospha/"
    },
    {
      "type": "linkedIn",
      "url": "https://www.linkedin.com/company/fospha/"
    },
    {
      "type": "productHunt",
      "url": ""
    }
  ],
  "locations": [
    "London"
  ],
  "marketTags": [
    "Big Data Analytics",
    "Sales and Marketing",
    "Digital Marketing"
  ],
  "employees": "SIZE_11_50",
  "funding": {
    "totalRaised": 0,
    "rounds": []
  },
  "team": [
    {
      "title": null,
      "role": "Founder",
      "url": "https://angel.co/u/charles-mindenhall",
      "name": "Charles Mindenhall",
      "avatar": "https://graph.facebook.com/624308622/picture?type=large",
      "bioHtml": ""
    },
    {
      "title": "Sales and Marketing Executive",
      "role": "Employee",
      "url": "https://angel.co/u/finnian-bradfield",
      "name": "Finnian Bradfield",
      "avatar": "https://angel.co/images/shared/nopic.png",
      "bioHtml": "I am a business executive with strong communications skills currently looking for an operations role in the FinTech sector."
    },
    {
      "title": null,
      "role": "Employee",
      "url": "https://angel.co/u/jack-rogers-9",
      "name": "Jack Rogers",
      "avatar": "https://angel.co/images/shared/nopic.png",
      "bioHtml": ""
    },
    {
      "title": "Customer Success Executive",
      "role": "Employee",
      "url": "https://angel.co/u/julian-maillet",
      "name": "Julian G. Maillet",
      "avatar": "https://photos.angel.co/users/5938191-medium_jpg?1489081271",
      "bioHtml": "Currently helping organisations to understand and optimise their customer acquisition costs."
    }
  ],
  "perks": [],
  "refs": {
    "angelListId": "1082592",
    "angelListUrl": "https://angel.co/company/fospha-1"
  },
  "jobs": [
    {
      "role": "Sales",
      "title": "Customer Success Executive",
      "description": "*How we help our customers*\n\nFospha are a fast growing, friendly team trusted to deliver real impact to businesses wanting to harness their data and optimise their marketing. We use the power of AI to drive multi-touch attribution modelling to provide marketers with an understanding of the end-to-end customer journey, in order to optimise their cost of customer acquisition and lifetime value.\n\nWe are a well-funded early stage company backed by the UK’s leading venture builder (Blenheim Chalcot). As part of our unique work culture, being part of a group of well-funded, supported and profit making companies we can offer accelerated career progression, networking and L&D opportunities.\n\nReporting the Head of CS, your role will be to help support our clients. This role has a clear and direct impact in driving our customer satisfaction and revenue growth.\n\n*The Role*\n\nWe believe our customer success team are great at what they do because they are adaptable and want to deliver the best possible experience for our clients. In this role, we are offering the opportunity to rapidly progress in to either a customer success strategy role or a client onboarding specialist. Both very challenging roles and sought after skill sets in the industry. \n\n*Role and key responsibilities:*\n\n* Operate as the lead point of contact for any and all matters specific to Fospha clients\n* Build and maintain strong, long-lasting customer relationships, communicating clearly the progress of monthly/ quarterly initiatives to internal and external stakeholders\n* Develop a trusted adviser relationship with key customer stakeholders and executive sponsors\n* Over time, become a go-to expert in marketing and Fospha products and provide on-going client training on these\n* Ensure the timely and successful delivery of our solutions according to customer needs and objectives\n* Ability to understand clients’ business goals, to anticipate future needs and help determine the ideal solution\n* Forecast and track key account metrics, identify and help realise upsell opportunities: grow opportunities within customer base and collaborate with our sales team to ensure growth attainment, and realise upsell opportunities.\n* Continually strive to provide the best customer service possible and exceed expectations\n* Understanding and translating marketing output into technical requirements\n\n*Professional Requirements:*\n\nIdeally worked in either a marketing focused company/ role or have spent time working for a media agency\nWorking knowledge of MS Excel (formulas, pivot tables, macros…) and MS PPT\nPull reports, data analysis (identifying where clients can save spend and showing where they can re-invest it)\nShare and present back to the client any findings – steer them towards things that can benefit them\nExperience in customer-facing roles\nDemonstrated interest or experience in Search or Social marketing (internships and contract work count!), marketing experience (google analytics), understanding of performance marketing\nKnow when to escalate projects to resolve more complex findings or highlighting where to go back and align a new strategy to be able to complete the task\nEffective communication skills – ability to liaise between clients and internal engineers regarding requirements\nTraits\n\nWe’re keen to grow and add to our culture, the traits of our team are:\n\nCurious\nGreat at building relationships\nProblem solving\nLooking for challenges\nHaving the ability to work with more ambiguous requirements when needed\nComfortable with handling data\nInterested in digital marketing\nCareer Development\n\nWe actively want to grow and support our CS environment constantly, we welcome our team’s feedback. You can expect to up-skill and take on management responsibilities over time should you choose to:\n\n* Ongoing coaching in CS development best practice to serve you here and beyond\n* Opportunities to partake in structured training and leadership development programmes, from our being a part of Blenheim Chalcot\n* Extensive opportunities for progression for those who seek it, be it going on to lead and build this new team or getting promotion to a revenue-quota-carrying role\n* Enrollment in the Fospha Learning & Development Programme (including structured training modules in writing and communications) following successful probation period.\n\n*Benefits*\n\nCompetitive salary, fully supported work from home policy, pension scheme, work perks scheme, health scheme. We’re constantly growing our benefits package and do much more than just hang around at pubs after work!\n\n*Additional Perks*\n\nModern campus office at iHub – Imperial College West London, fully stocked onsite Benugo cafe, local discounts at restaurants and gyms, yoga class, pop up services such as office massage, nail salon, hair cuts and more being added all the time, full calendar of social events, lunch and learn Thursdays, Catered lunch Wednesdays, Fospha social and charity squad events.\n\n*Why Us?*\n\nMany problems are difficult to solve, especially at scale. They take the right team and environment. We are a mix of individuals from data scientists and computer engineers to designers, marketers and entrepreneurs. We have very different personalities. We are united by a set of values, by a passion for solving big problems.",
      "descriptionHtml": "<p><em>How we help our customers</em></p>\n\n<p>Fospha are a fast growing, friendly team trusted to deliver real impact to businesses wanting to harness their data and optimise their marketing. We use the power of AI to drive multi-touch attribution modelling to provide marketers with an understanding of the end-to-end customer journey, in order to optimise their cost of customer acquisition and lifetime value.</p>\n\n<p>We are a well-funded early stage company backed by the UK’s leading venture builder (Blenheim Chalcot). As part of our unique work culture, being part of a group of well-funded, supported and profit making companies we can offer accelerated career progression, networking and L&amp;D opportunities.</p>\n\n<p>Reporting the Head of CS, your role will be to help support our clients. This role has a clear and direct impact in driving our customer satisfaction and revenue growth.</p>\n\n<p><em>The Role</em></p>\n\n<p>We believe our customer success team are great at what they do because they are adaptable and want to deliver the best possible experience for our clients. In this role, we are offering the opportunity to rapidly progress in to either a customer success strategy role or a client onboarding specialist. Both very challenging roles and sought after skill sets in the industry. </p>\n\n<p><em>Role and key responsibilities:</em></p>\n\n<ul>\n<li>Operate as the lead point of contact for any and all matters specific to Fospha clients</li>\n<li>Build and maintain strong, long-lasting customer relationships, communicating clearly the progress of monthly/ quarterly initiatives to internal and external stakeholders</li>\n<li>Develop a trusted adviser relationship with key customer stakeholders and executive sponsors</li>\n<li>Over time, become a go-to expert in marketing and Fospha products and provide on-going client training on these</li>\n<li>Ensure the timely and successful delivery of our solutions according to customer needs and objectives</li>\n<li>Ability to understand clients’ business goals, to anticipate future needs and help determine the ideal solution</li>\n<li>Forecast and track key account metrics, identify and help realise upsell opportunities: grow opportunities within customer base and collaborate with our sales team to ensure growth attainment, and realise upsell opportunities.</li>\n<li>Continually strive to provide the best customer service possible and exceed expectations</li>\n<li>Understanding and translating marketing output into technical requirements</li>\n</ul>\n\n<p><em>Professional Requirements:</em></p>\n\n<p>Ideally worked in either a marketing focused company/ role or have spent time working for a media agency<br>\nWorking knowledge of MS Excel (formulas, pivot tables, macros…) and MS PPT<br>\nPull reports, data analysis (identifying where clients can save spend and showing where they can re-invest it)<br>\nShare and present back to the client any findings – steer them towards things that can benefit them<br>\nExperience in customer-facing roles<br>\nDemonstrated interest or experience in Search or Social marketing (internships and contract work count!), marketing experience (google analytics), understanding of performance marketing<br>\nKnow when to escalate projects to resolve more complex findings or highlighting where to go back and align a new strategy to be able to complete the task<br>\nEffective communication skills – ability to liaise between clients and internal engineers regarding requirements<br>\nTraits</p>\n\n<p>We’re keen to grow and add to our culture, the traits of our team are:</p>\n\n<p>Curious<br>\nGreat at building relationships<br>\nProblem solving<br>\nLooking for challenges<br>\nHaving the ability to work with more ambiguous requirements when needed<br>\nComfortable with handling data<br>\nInterested in digital marketing<br>\nCareer Development</p>\n\n<p>We actively want to grow and support our CS environment constantly, we welcome our team’s feedback. You can expect to up-skill and take on management responsibilities over time should you choose to:</p>\n\n<ul>\n<li>Ongoing coaching in CS development best practice to serve you here and beyond</li>\n<li>Opportunities to partake in structured training and leadership development programmes, from our being a part of Blenheim Chalcot</li>\n<li>Extensive opportunities for progression for those who seek it, be it going on to lead and build this new team or getting promotion to a revenue-quota-carrying role</li>\n<li>Enrollment in the Fospha Learning &amp; Development Programme (including structured training modules in writing and communications) following successful probation period.</li>\n</ul>\n\n<p><em>Benefits</em></p>\n\n<p>Competitive salary, fully supported work from home policy, pension scheme, work perks scheme, health scheme. We’re constantly growing our benefits package and do much more than just hang around at pubs after work!</p>\n\n<p><em>Additional Perks</em></p>\n\n<p>Modern campus office at iHub – Imperial College West London, fully stocked onsite Benugo cafe, local discounts at restaurants and gyms, yoga class, pop up services such as office massage, nail salon, hair cuts and more being added all the time, full calendar of social events, lunch and learn Thursdays, Catered lunch Wednesdays, Fospha social and charity squad events.</p>\n\n<p><em>Why Us?</em></p>\n\n<p>Many problems are difficult to solve, especially at scale. They take the right team and environment. We are a mix of individuals from data scientists and computer engineers to designers, marketers and entrepreneurs. We have very different personalities. We are united by a set of values, by a passion for solving big problems.</p>\n",
      "position": "full-time",
      "experience": 1,
      "visaSponsorship": false,
      "locations": [
        "London"
      ],
      "remote": false,
      "remoteLocations": [],
      "skills": [
        "Marketing",
        "Data Analysis",
        "SQL",
        "Communication Skills"
      ],
      "payment": {
        "salary": "£25k – £28k"
      },
      "recruiter": {
        "title": null,
        "role": "Employee",
        "url": "https://angel.co/u/sajid-rasul-1",
        "name": "Sajid Rasul",
        "avatar": "https://angel.co/images/shared/nopic.png"
      },
      "refs": {
        "angelListId": "473066",
        "angelListUrl": "https://angel.co/company/fospha-1/jobs/473066-"
      }
    },
    {
      "role": "Other",
      "title": "Senior Data Scientist",
      "description": "Fospha is a big data London software start-up, solving pan-industry-vertical business pains. Fospha’s verticals include: Finance, Government, Insurance, Media, Online, Tech, and E-coms.\n\nFospha specialises in collecting, integrating, storing, activating, and operationalising business data. As part of the Data science team you will be involved in research and development of innovative data led solutions to business problems. \n\nThe data science team,\n•\tBuilds machine learning solutions for some of the largest internet era companies\n•\tBuilds IP for fledgling software companies where data is at the core of their product offering\n•\tBuilds rapid prototypes as proof of concept and proof of value add for Fospha clients\n•\tInterfaces with Fospha software development teams to build repeatable and scalable software solutions\n•\tTranslates business problems into analytically tractable research problems, and develops the requirements and mathematical tools necessary to see solutions.\n•\tInterfaces with key business stakeholders to bring data solutions into the heart of businesses, disrupting the status quo and driving growth.\n•\tIntegrates disparate data sets and performs deep analytics to unlock actionable insights and growth opportunities for Fospha clients.\n•\tConsults on data science strategies and growth opportunities at c-suite level, both internally and externally.\n\nAs a Data Scientist, you will work on a variety of exciting projects in a fast-growing organization with a lot of opportunities to tackle complex problems that will require you to mathematically, statistically and practically formulate them and stretch your understanding of business and research.\nAt the Fospha data science team you will be part of a team of mathematicians, physics, statisticians, and engineers. We work on problems together and see them through from concept to operational workhorses; our solutions grow with us and we grow with our solutions.\n\nDo you ask questions like, ‘are the stumpy trees really good enough?’, ‘How can I stop my ReLUs from dying?’, ‘Is convergence actually trivial in this example?’, ‘How much value can I get my client?’, ‘Can I ensure that if this isn’t going to work that it will fail fast?’, ‘Is this actually NP-hard?’, ‘Do I need another 1billion rows of data?’, ‘The RNNs are discriminative enough, but what have we learned?’.\nIf so, we have a home for you in the Data Team.\n\nRole\n•\tWork closely with product, consulting and software engineering teams to identify and solve key product and client problems.\n•\tUse statistical and data expertise to answer both product and client needs.\n•\tPrototype and build high quality data products, interfacing with all internal teams that are required.\n•\tCommunicate technical concepts and analysis to a wide audience; including data scientists, product analysts, consultants, and C-level members of the organisation.\n•\tTranslate business problems into analytically tractable problems and solutions.\n•\tAbility to conduct deep mathematical based research to solve relevant problems.\n•\tBe client and data obsessed. Build great solutions to client problems and present insight that empowers them.\n\nTechnical skills:\n•\tPython (advanced).\n•\tR (advanced).\n•\tSQL (advanced).\n•\tC++ (working knowledge beneficial).\n•\tComfort in building solutions in both Windows and Linux environments.\n•\tImplementing data science solutions into production.\n\nRequirements:\n•\tBackground in mathematics & statistics (quantitative background, MSc. or Ph.D. mathematics, applied mathematics, statistics, computer science, machine learning or equivalent quantitative field)\no\tExperience adapting techniques from research papers to specific problems.\no\tAdvanced knowledge of machine learning: both supervised and unsupervised learning.\no\tExperimental design and robust statistical significance testing.\no\tA/B and multivariate testing, predictive analytics, and Bayesian inference.\no\tKnowledge and understanding of optimisation: stochastic gradient descent and its extensions.\n•\tProblem solving\no\tExtensive experience with quantitative methods to solving analytic problems.\no\tAble to translate business problems to analytic problems.\no\tDesign, implement, evaluate, and monitor quantitative solutions.\no\tPresent results of analyses to business units; explain technical and statistical concepts to non-technical associates and clients.\n•\tData story telling.\no\tPassion for empirical research.\no\tComfort analysing and manipulating large data sets from multiple sources.\no\tTranslating statistical analysis from numbers to communicable insight.\no\tStrong skills concerning visual communication of information.\nAbout You\n\nMany problems are difficult to solve, especially at scale. They take the right team and environment. We are a mix of individuals from data scientists and computer engineers to designers, marketers and entrepreneurs. We have very different personalities. We are united by a set of values, by a passion for solving big problems.",
      "descriptionHtml": "<p>Fospha is a big data London software start-up, solving pan-industry-vertical business pains. Fospha’s verticals include: Finance, Government, Insurance, Media, Online, Tech, and E-coms.</p>\n\n<p>Fospha specialises in collecting, integrating, storing, activating, and operationalising business data. As part of the Data science team you will be involved in research and development of innovative data led solutions to business problems. </p>\n\n<p>The data science team,<br>\n• Builds machine learning solutions for some of the largest internet era companies<br>\n• Builds IP for fledgling software companies where data is at the core of their product offering<br>\n• Builds rapid prototypes as proof of concept and proof of value add for Fospha clients<br>\n• Interfaces with Fospha software development teams to build repeatable and scalable software solutions<br>\n• Translates business problems into analytically tractable research problems, and develops the requirements and mathematical tools necessary to see solutions.<br>\n• Interfaces with key business stakeholders to bring data solutions into the heart of businesses, disrupting the status quo and driving growth.<br>\n• Integrates disparate data sets and performs deep analytics to unlock actionable insights and growth opportunities for Fospha clients.<br>\n• Consults on data science strategies and growth opportunities at c-suite level, both internally and externally.</p>\n\n<p>As a Data Scientist, you will work on a variety of exciting projects in a fast-growing organization with a lot of opportunities to tackle complex problems that will require you to mathematically, statistically and practically formulate them and stretch your understanding of business and research.<br>\nAt the Fospha data science team you will be part of a team of mathematicians, physics, statisticians, and engineers. We work on problems together and see them through from concept to operational workhorses; our solutions grow with us and we grow with our solutions.</p>\n\n<p>Do you ask questions like, ‘are the stumpy trees really good enough?’, ‘How can I stop my ReLUs from dying?’, ‘Is convergence actually trivial in this example?’, ‘How much value can I get my client?’, ‘Can I ensure that if this isn’t going to work that it will fail fast?’, ‘Is this actually NP-hard?’, ‘Do I need another 1billion rows of data?’, ‘The RNNs are discriminative enough, but what have we learned?’.<br>\nIf so, we have a home for you in the Data Team.</p>\n\n<p>Role<br>\n• Work closely with product, consulting and software engineering teams to identify and solve key product and client problems.<br>\n• Use statistical and data expertise to answer both product and client needs.<br>\n• Prototype and build high quality data products, interfacing with all internal teams that are required.<br>\n• Communicate technical concepts and analysis to a wide audience; including data scientists, product analysts, consultants, and C-level members of the organisation.<br>\n• Translate business problems into analytically tractable problems and solutions.<br>\n• Ability to conduct deep mathematical based research to solve relevant problems.<br>\n• Be client and data obsessed. Build great solutions to client problems and present insight that empowers them.</p>\n\n<p>Technical skills:<br>\n• Python (advanced).<br>\n• R (advanced).<br>\n• SQL (advanced).<br>\n• C++ (working knowledge beneficial).<br>\n• Comfort in building solutions in both Windows and Linux environments.<br>\n• Implementing data science solutions into production.</p>\n\n<p>Requirements:<br>\n• Background in mathematics &amp; statistics (quantitative background, MSc. or Ph.D. mathematics, applied mathematics, statistics, computer science, machine learning or equivalent quantitative field)<br>\no   Experience adapting techniques from research papers to specific problems.<br>\no   Advanced knowledge of machine learning: both supervised and unsupervised learning.<br>\no   Experimental design and robust statistical significance testing.<br>\no   A/B and multivariate testing, predictive analytics, and Bayesian inference.<br>\no   Knowledge and understanding of optimisation: stochastic gradient descent and its extensions.<br>\n• Problem solving<br>\no   Extensive experience with quantitative methods to solving analytic problems.<br>\no   Able to translate business problems to analytic problems.<br>\no   Design, implement, evaluate, and monitor quantitative solutions.<br>\no   Present results of analyses to business units; explain technical and statistical concepts to non-technical associates and clients.<br>\n• Data story telling.<br>\no   Passion for empirical research.<br>\no   Comfort analysing and manipulating large data sets from multiple sources.<br>\no   Translating statistical analysis from numbers to communicable insight.<br>\no   Strong skills concerning visual communication of information.<br>\nAbout You</p>\n\n<p>Many problems are difficult to solve, especially at scale. They take the right team and environment. We are a mix of individuals from data scientists and computer engineers to designers, marketers and entrepreneurs. We have very different personalities. We are united by a set of values, by a passion for solving big problems.</p>\n",
      "position": "full-time",
      "experience": null,
      "visaSponsorship": false,
      "locations": [
        "London",
        "United Kingdom"
      ],
      "remote": false,
      "remoteLocations": [],
      "skills": [
        "Python",
        "Data Analysis",
        "SQL",
        "Statistics",
        "Mathematics",
        "R",
        "Quantitative Analysis"
      ],
      "payment": {
        "salary": "£40k – £70k"
      },
      "recruiter": {
        "title": null,
        "role": "Employee",
        "url": "https://angel.co/u/sajid-rasul-1",
        "name": "Sajid Rasul",
        "avatar": "https://angel.co/images/shared/nopic.png"
      },
      "refs": {
        "angelListId": "151431",
        "angelListUrl": "https://angel.co/company/fospha-1/jobs/151431-"
      }
    }
  ]
}