{
  "name": "Healum",
  "avatar": "https://photos.angel.co/startups/i/2128348-131dbbca4f34cb88adcf5578629ef881-medium_jpg.jpg?buster=1490460325",
  "slogan": "Digital solutions to tackle chronic disease",
  "description": "Healum provides health professionals with cloud based software and an accompanying mobile app that enables them to deliver personalized diabetes prevention and weight management interventions to a larger patient population at a lower cost. \nThere is not a great way for health professionals to motivate and monitor diabetic and obese patients when they are outside of the clinical environment.\nHealum has co-designed its product with doctors and patients to solve that problem, using wearable technology, health analytics, machine learning, personalised health plans and gamified group incentives.\nBariatric surgeons, providers of medical weight loss and diabetes management services, insurers, dieticians, pharma companies and public health commissioners all use the product to improve their patients experience and their health outcomes, to increase their capacity as a provider, to reduce their costs and to monitor patient outcomes. This enables them to tap into value-based remuneration.\n\n\n",
  "links": [
    {
      "type": "website",
      "url": "http://www.healum.com"
    },
    {
      "type": "blog",
      "url": ""
    },
    {
      "type": "twitter",
      "url": ""
    },
    {
      "type": "facebook",
      "url": ""
    },
    {
      "type": "linkedIn",
      "url": ""
    },
    {
      "type": "productHunt",
      "url": null
    }
  ],
  "locations": [
    "London",
    "Greater London"
  ],
  "marketTags": [
    "Personal Health",
    "Mobile Health",
    "Behavioural Science"
  ],
  "employees": "SIZE_1_10",
  "funding": {
    "totalRaised": 0,
    "rounds": []
  },
  "team": [
    {
      "title": "",
      "role": "Founder",
      "url": "https://angel.co/u/aannuujj",
      "name": "Anuj S",
      "avatar": "https://photos.angel.co/users/3569940-medium_jpg?1490459494",
      "bioHtml": "Founder <a href=\"https://angel.co/company/healum\" class=\"at_link\"><span class=\"at_symbol\">@</span><span class=\"at_name\">Healum</span></a>"
    },
    {
      "title": null,
      "role": "Founder",
      "url": "https://angel.co/u/jonathan-abraham-1",
      "name": "Jonathan Abraham",
      "avatar": "https://photos.angel.co/users/3569633-medium_jpg?1473104353",
      "bioHtml": "Founder Healum"
    },
    {
      "title": "Marketing manager",
      "role": "Employee",
      "url": "https://angel.co/u/nirmit-upadhyay",
      "name": "Nirmit Upadhyay",
      "avatar": "https://photos.angel.co/users/5204749-medium_jpg?1518112103",
      "bioHtml": "Business consultant for global startups"
    }
  ],
  "perks": [],
  "refs": {
    "angelListId": "2128348",
    "angelListUrl": "https://angel.co/company/healum"
  },
  "jobs": [
    {
      "role": "Sales",
      "title": "Project Manager/ Account Manager to transform healthcare and improve health outcomes",
      "description": "*We are Healum* - a well funded digital health company on a mission to improve and save 100 million lives across the globe. We believe that everyone should have access to better personalised preventative healthcare and that digital solutions can empower healthcare professionals to deliver that for their patients.  We build digital products to enable patients to monitor and understand their health, and software that empowers health professionals to achieve better outcomes with their patients. Our single aim is to maximise people’s engagement with their health by delighting them with products that make them feel confident, supported and motivated.\n\nWe are looking for a project manager / account manager to help us transform healthcare and to improve health outcomes by managing the delivery and growth of a set of customer contracts. Our healthcare professional customers and their patients play the most important role in building our products. Are you someone who believes in working collaboratively to build an effective relationship involving our healthcare professional customers and their patients at every step? Do you embrace change and innovation? Do you have a successful track record in managing the delivery of a completely new product in conditions of extreme uncertainty and chaos?  Can you talk solutions with customers, talk deliverables with engineers, envision success with designers and produce evidence with researchers and analysts, and all whilst delivering within budget and on time?Are you excited about applying your organisational and relationship management skills to maximise the potential of a project beyond what it was originally envisaged to be? Do you value customer feedback above all else and understand how to use that to improve product and service delivery? The most important characteristic is that you can wear many hats across the project lifecycle and aren't afraid to get your hands dirty and have a passion of support customers throughout their journey. You will work closely with the founders to deliver new projects that genuinely enrich people’s lives.\n\n*You have*\n* Excellent organisational skills\n* Vision - and lots of it. You can see what healthcare could look like in 50 years time and what we could contribute to that.\n* Passion to build and manage long-term customer relationships.\n* An ability to thrive under intense pressure and to create opportunities out of situations of chaos\n* An ability to balance organisational rigour with creative opportunism\n* Crazy attention to detail - sleepless nights because your gantt chart doesn't account for the missing days\n* Solid experience in communication - both internal and project comms and wider media communications\n\n*You also have*\n* Previous startup experience - you thrive in conditions of uncertainty and pressure\n* Previous experience in healthcare, health IT or delivering health and wellbeing services in the third sector. \n* Experience in engaging with users in supporting them on their health journeys\n* High value for openness, humility, flexibility, collaboration, diversity and empathy\n* High value for diversity of thought and experience, and can effectively communicate and challenge ideas.\n* Experience in one or more project management methodologies including but not limited to Agile, Prince2, lean project management.Q1\n\n*As one of our first team members, a typical day might include some of the following:*\n* Manage subcontractors and partner stakeholders to successfully deliver on the project.\n* Work with the founders to evolve Healum’s proposition and its product roadmap through user research, key user insights from the project and research\n* Work with our patient and clinical customers on the user profiles and UX journeys, to identify and uncover user pain points and needs in order for the project to be successful\n* Devise a research plan with a 3rd party research team\n* Meet with lawyers to ensure all regulatory and legal paperwork is in order for the delivery of the project\n* Identify risks and design mitigation strategies using a risk register\n* Brief us on communications opportunities from the projects you are managing.\n* Troubleshoot problems you are encountering.\n\n*To land this EPIC gig, you need...*\nExperience working in delivering healthcare services and digital services\nProject management experience\nExperience working with research\nContacts with some of the clinical and commissioning stakeholders that we want to reach\n\nPlease be based in London or willing to travel to London and absolutely NO recruitment agencies as we work with our PSL only.\n\nClosing date for applications 14th July 2019",
      "descriptionHtml": "<p><em>We are Healum</em> - a well funded digital health company on a mission to improve and save 100 million lives across the globe. We believe that everyone should have access to better personalised preventative healthcare and that digital solutions can empower healthcare professionals to deliver that for their patients.  We build digital products to enable patients to monitor and understand their health, and software that empowers health professionals to achieve better outcomes with their patients. Our single aim is to maximise people’s engagement with their health by delighting them with products that make them feel confident, supported and motivated.</p>\n\n<p>We are looking for a project manager / account manager to help us transform healthcare and to improve health outcomes by managing the delivery and growth of a set of customer contracts. Our healthcare professional customers and their patients play the most important role in building our products. Are you someone who believes in working collaboratively to build an effective relationship involving our healthcare professional customers and their patients at every step? Do you embrace change and innovation? Do you have a successful track record in managing the delivery of a completely new product in conditions of extreme uncertainty and chaos?  Can you talk solutions with customers, talk deliverables with engineers, envision success with designers and produce evidence with researchers and analysts, and all whilst delivering within budget and on time?Are you excited about applying your organisational and relationship management skills to maximise the potential of a project beyond what it was originally envisaged to be? Do you value customer feedback above all else and understand how to use that to improve product and service delivery? The most important characteristic is that you can wear many hats across the project lifecycle and aren&#39;t afraid to get your hands dirty and have a passion of support customers throughout their journey. You will work closely with the founders to deliver new projects that genuinely enrich people’s lives.</p>\n\n<p><em>You have</em></p>\n\n<ul>\n<li>Excellent organisational skills</li>\n<li>Vision - and lots of it. You can see what healthcare could look like in 50 years time and what we could contribute to that.</li>\n<li>Passion to build and manage long-term customer relationships.</li>\n<li>An ability to thrive under intense pressure and to create opportunities out of situations of chaos</li>\n<li>An ability to balance organisational rigour with creative opportunism</li>\n<li>Crazy attention to detail - sleepless nights because your gantt chart doesn&#39;t account for the missing days</li>\n<li>Solid experience in communication - both internal and project comms and wider media communications</li>\n</ul>\n\n<p><em>You also have</em></p>\n\n<ul>\n<li>Previous startup experience - you thrive in conditions of uncertainty and pressure</li>\n<li>Previous experience in healthcare, health IT or delivering health and wellbeing services in the third sector. </li>\n<li>Experience in engaging with users in supporting them on their health journeys</li>\n<li>High value for openness, humility, flexibility, collaboration, diversity and empathy</li>\n<li>High value for diversity of thought and experience, and can effectively communicate and challenge ideas.</li>\n<li>Experience in one or more project management methodologies including but not limited to Agile, Prince2, lean project management.Q1</li>\n</ul>\n\n<p><em>As one of our first team members, a typical day might include some of the following:</em></p>\n\n<ul>\n<li>Manage subcontractors and partner stakeholders to successfully deliver on the project.</li>\n<li>Work with the founders to evolve Healum’s proposition and its product roadmap through user research, key user insights from the project and research</li>\n<li>Work with our patient and clinical customers on the user profiles and UX journeys, to identify and uncover user pain points and needs in order for the project to be successful</li>\n<li>Devise a research plan with a 3rd party research team</li>\n<li>Meet with lawyers to ensure all regulatory and legal paperwork is in order for the delivery of the project</li>\n<li>Identify risks and design mitigation strategies using a risk register</li>\n<li>Brief us on communications opportunities from the projects you are managing.</li>\n<li>Troubleshoot problems you are encountering.</li>\n</ul>\n\n<p><em>To land this EPIC gig, you need...</em><br>\nExperience working in delivering healthcare services and digital services<br>\nProject management experience<br>\nExperience working with research<br>\nContacts with some of the clinical and commissioning stakeholders that we want to reach</p>\n\n<p>Please be based in London or willing to travel to London and absolutely NO recruitment agencies as we work with our PSL only.</p>\n\n<p>Closing date for applications 14th July 2019</p>\n",
      "position": "full-time",
      "experience": null,
      "visaSponsorship": false,
      "locations": [
        "London",
        "Greater London",
        "London"
      ],
      "remote": false,
      "remoteLocations": [],
      "skills": [
        "Social Media",
        "Agile Project Management",
        "Customer Relationship Management",
        "Project Management",
        "Communication Skills",
        "Acct Mgmt",
        "Documentation",
        "Prince2",
        "Project Delivery",
        "Account Management"
      ],
      "payment": {
        "salary": "£25k – £35k",
        "equity": "0.0% – 0.1%"
      },
      "recruiter": {
        "title": null,
        "role": "Founder",
        "url": "https://angel.co/u/jonathan-abraham-1",
        "name": "Jonathan Abraham",
        "avatar": "https://photos.angel.co/users/3569633-medium_jpg?1473104353"
      },
      "refs": {
        "angelListId": "234551",
        "angelListUrl": "https://angel.co/company/healum/jobs/234551-"
      }
    },
    {
      "role": "Software Engineer",
      "title": "Golang (Go) Backend Engineer to transform healthcare and improve health outcomes",
      "description": "We are Healum - a well funded digital health company on a mission to improve and save 100 million lives across the globe. We believe that everyone should have access to better personalised preventative healthcare and healthcare professionals should be empowered to deliver this experience to their patients. Digital solutions can make this a reality. We build digital products to enable patients to monitor and understand their health, and software that empowers health professionals to achieve better outcomes with their patients. Our single aim is to maximise people’s engagement with their health by delighting them with products that make them feel confident, supported and motivated.\n\nWe are looking for a Golang Software Engineer based in India for a full-time remove position, to help further build Healum's distributed services platform to enhance our value proposition to our users. Are you excited about building petabyte-scale, business-critical, distributed software that helps people to transform their health outcomes? Do you find a peculiar satisfaction in bringing efficiency through intelligent algorithms? Do you enjoy looking at real-time data and incorporating that in to how you build software? The most important characteristic is that you can wear many hats and you’ll love getting your hands dirty with planning, scaling, security and testing. You’ll have a passion for playing a lead role in envisioning our platform services and preparing Healum for scale and high availability. You will work closely with the founders to build high quality and scalable systems that are integrated with our products that establish Healum as a leader in providing useful and intelligent solutions for clinicians and their patients.\n\nYou have\n- 5+ years experience in software development\n- Extensive knowledge of Golang and at least one other formal software languages (think compiled software languages C/C+, Java, Scala, Erlang, Clojure). *****This is really important*****. In your application note - please mention ONE feature about Golang that you like in order to qualify your application for consideration. \n- Experience in building distributed scalable and fault tolerant systems using micro-services, CEP, MQs.\n- Strong experience in working with data and multiple datastores both SQL / Non- SQL like relational data stores, document data stores, caches and graph Databases\n- Experience using go-micro or some other microservices framework and other tools like glide, godep, gorilla mux, revel,\n- Affinity for smart hacking over process and the ability to take complex technical requirements and breaking them down into smaller execution units.\n- Ruthless capabilities of documenting major technical details otuside of the code and minor ones inside the code.\n- cognitive abilities to choose smart practices over best practices with a keen eye over security and scalability.\n- experience in continuously shipping and testing through deployment pipelines using CI/CD tools in an agile development environment.\n- experience in performance tuning your code and scalability thinking while writing it.\n\nYou also have\n- Deep understanding of distributed systems and service mesh concepts\n- Familiarity in Linux systems (like Centos) and some experience in scripting, automation and tooling.\n- Experience working with virtualisation systems (like Docker, Vagrant etc.) VMs and hypervisors (like vsphere, xenserver etc.)\n- Experience working with orchestration tools (like Kubernetes, Mesos, Docker Swarm etc.) and container registeries (GCE, Docker hub etc.)\n- Crazy attention to detail - sleepless nights because you found a bug that you couldn't resolve at 5:44 pm.\n- Familiarity with agile development practices (a/b testing,unit testing,continuous deployment,continuous integration,scrums) and worked in a production environment.\n- Excellent written and verbal communication skills to communicate technical concepts to a wide variety of audience.\n- Ability to be empathetic and form strong working relations with your team members, customers and partners.\n\nAs one of our first team members, a typical day might include some of the following: \n- Write, test, debug and ship code and gather feedback on scale, performance, security to incorporate back into the platform.\n- Work with the founders to identify complex technical problems and solve them. \n- Work with the product design and client experience development team to support them with scalable services\n- Feed into the overall mission and vision of the Healum's platform over the periof of coming months and years. \n- Inspire us with latest technical trends and framworks especially in programming languages, data stores, security and create some of your own. \n- Work with the infrastructure team to squeeze every ounce of efficiency from our existing systems.\n\nTo land this EPIC gig, you need... \nQuality experience in building large scale distributed systems, a formal degree in computer science, physics or mathematics. Background and expertise in software development, micro services, API integrations, data analytics, security and huge scale thinking!\n\nWould you like to make a lasting impact in people’s lives and change them for better? Then get in touch. \nAbsolutely NO recruitment agencies or outsourcing companies as we work with our PSL only.",
      "descriptionHtml": "<p>We are Healum - a well funded digital health company on a mission to improve and save 100 million lives across the globe. We believe that everyone should have access to better personalised preventative healthcare and healthcare professionals should be empowered to deliver this experience to their patients. Digital solutions can make this a reality. We build digital products to enable patients to monitor and understand their health, and software that empowers health professionals to achieve better outcomes with their patients. Our single aim is to maximise people’s engagement with their health by delighting them with products that make them feel confident, supported and motivated.</p>\n\n<p>We are looking for a Golang Software Engineer based in India for a full-time remove position, to help further build Healum&#39;s distributed services platform to enhance our value proposition to our users. Are you excited about building petabyte-scale, business-critical, distributed software that helps people to transform their health outcomes? Do you find a peculiar satisfaction in bringing efficiency through intelligent algorithms? Do you enjoy looking at real-time data and incorporating that in to how you build software? The most important characteristic is that you can wear many hats and you’ll love getting your hands dirty with planning, scaling, security and testing. You’ll have a passion for playing a lead role in envisioning our platform services and preparing Healum for scale and high availability. You will work closely with the founders to build high quality and scalable systems that are integrated with our products that establish Healum as a leader in providing useful and intelligent solutions for clinicians and their patients.</p>\n\n<p>You have</p>\n\n<ul>\n<li>5+ years experience in software development</li>\n<li>Extensive knowledge of Golang and at least one other formal software languages (think compiled software languages C/C+, Java, Scala, Erlang, Clojure). **<strong><em>This is really important</em></strong>**. In your application note - please mention ONE feature about Golang that you like in order to qualify your application for consideration. </li>\n<li>Experience in building distributed scalable and fault tolerant systems using micro-services, CEP, MQs.</li>\n<li>Strong experience in working with data and multiple datastores both SQL / Non- SQL like relational data stores, document data stores, caches and graph Databases</li>\n<li>Experience using go-micro or some other microservices framework and other tools like glide, godep, gorilla mux, revel,</li>\n<li>Affinity for smart hacking over process and the ability to take complex technical requirements and breaking them down into smaller execution units.</li>\n<li>Ruthless capabilities of documenting major technical details otuside of the code and minor ones inside the code.</li>\n<li>cognitive abilities to choose smart practices over best practices with a keen eye over security and scalability.</li>\n<li>experience in continuously shipping and testing through deployment pipelines using CI/CD tools in an agile development environment.</li>\n<li>experience in performance tuning your code and scalability thinking while writing it.</li>\n</ul>\n\n<p>You also have</p>\n\n<ul>\n<li>Deep understanding of distributed systems and service mesh concepts</li>\n<li>Familiarity in Linux systems (like Centos) and some experience in scripting, automation and tooling.</li>\n<li>Experience working with virtualisation systems (like Docker, Vagrant etc.) VMs and hypervisors (like vsphere, xenserver etc.)</li>\n<li>Experience working with orchestration tools (like Kubernetes, Mesos, Docker Swarm etc.) and container registeries (GCE, Docker hub etc.)</li>\n<li>Crazy attention to detail - sleepless nights because you found a bug that you couldn&#39;t resolve at 5:44 pm.</li>\n<li>Familiarity with agile development practices (a/b testing,unit testing,continuous deployment,continuous integration,scrums) and worked in a production environment.</li>\n<li>Excellent written and verbal communication skills to communicate technical concepts to a wide variety of audience.</li>\n<li>Ability to be empathetic and form strong working relations with your team members, customers and partners.</li>\n</ul>\n\n<p>As one of our first team members, a typical day might include some of the following: </p>\n\n<ul>\n<li>Write, test, debug and ship code and gather feedback on scale, performance, security to incorporate back into the platform.</li>\n<li>Work with the founders to identify complex technical problems and solve them. </li>\n<li>Work with the product design and client experience development team to support them with scalable services</li>\n<li>Feed into the overall mission and vision of the Healum&#39;s platform over the periof of coming months and years. </li>\n<li>Inspire us with latest technical trends and framworks especially in programming languages, data stores, security and create some of your own. </li>\n<li>Work with the infrastructure team to squeeze every ounce of efficiency from our existing systems.</li>\n</ul>\n\n<p>To land this EPIC gig, you need... <br>\nQuality experience in building large scale distributed systems, a formal degree in computer science, physics or mathematics. Background and expertise in software development, micro services, API integrations, data analytics, security and huge scale thinking!</p>\n\n<p>Would you like to make a lasting impact in people’s lives and change them for better? Then get in touch. <br>\nAbsolutely NO recruitment agencies or outsourcing companies as we work with our PSL only.</p>\n",
      "position": "full-time",
      "experience": 5,
      "visaSponsorship": false,
      "locations": [
        "India",
        "India"
      ],
      "remote": true,
      "remoteLocations": [],
      "skills": [
        "Data Analysis",
        "noSQL",
        "Cloud Computing",
        "Big Data",
        "MySQL",
        "Software Architecture",
        "Scalable Systems",
        "Distributed Systems",
        "Git",
        "Redis",
        "Algorithms",
        "Neo4J",
        "Security",
        "Performance Tuning",
        "Algorithms & Data Structures",
        "Docker",
        "Google Cloud Platform",
        "Go (Golang)",
        "Apache Spark",
        "Microservices",
        "Arango DB",
        "Apache Cassandra",
        "Kubernetes",
        "Go",
        "Micro Services",
        "Microservices Architecture"
      ],
      "payment": {
        "salary": "₹8L – ₹14L",
        "equity": "0.0% – 0.2%"
      },
      "recruiter": {
        "title": "",
        "role": "Founder",
        "url": "https://angel.co/u/aannuujj",
        "name": "Anuj S",
        "avatar": "https://photos.angel.co/users/3569940-medium_jpg?1490459494"
      },
      "refs": {
        "angelListId": "258567",
        "angelListUrl": "https://angel.co/company/healum/jobs/258567-"
      }
    },
    {
      "role": "Software Engineer",
      "title": "Cloud Infrastructure / Systems Engineer to transform healthcare and improve health outcomes",
      "description": "We are Healum - a well funded digital health company on a mission to improve and save 100 million lives across the globe. We believe that everyone should have access to better personalised preventative healthcare and healthcare professionals should be empowered to deliver this experience to their patients. Digital solutions can make this a reality. We build digital products to enable patients to monitor and understand their health, and software that empowers health professionals to achieve better outcomes with their patients. Our single aim is to maximise people’s engagement with their health by delighting them with products that make them feel confident, supported and motivated.\n\nWe are looking for a Cloud Infrastructure / Systems Engineer based in London to help maintain Healum platform and products reliably in order to provide uninterrupted to our services. Are you excited about building petabyte-scale, business-critical systems? Do you find satisfaction in automating tasks that help you and others? Do you enjoy identifying performance bottlenecks in a complex data intensive environment? The most important characteristic is that you can wear many hats and you’ll love getting your hands dirty with capacity planning, scaling, security and testing. You’ll have a passion for playing a lead role in envisioning our cloud infrastructure and strategy. You will work closely with the founders to build high quality and scalable systems that are integrated with our products that establish Healum as a leader in providing useful and intelligent solutions for clinicians and their patients.\n\nYou have\n- Background and expertise in Linux system administration (like Centos), site reliability engineering, capacity planning, network design, security, firewalls.\n- Strong experience in scripting, automation, internal tooling and configuration management system (like Puppet, Chef, Ansible etc.)\n- Good experience deploying, maintaining, managing and scaling datastores - both SQL based (like MariaDB, MySQL etc.), non-SQL based (like Elastic, Cassandra, Neo4j etc.), KV caches (like Redis, Memcached etc.), data processsing (like Spark, Storm etc.) and messaging systems like (RabbitMQ, Kafka, NATS etc.) \n- Practical understanding of development and deployment pipelines using CI/CD tools in an agile development environment (like Jenkins, Bamboo etc.)\n- Experience working with virtualisation systems (like Docker, Vagrant etc.) VMs and hypervisors (like vsphere, xenserver etc.), distributed systems and microservices on cloud platforms (like AWS, GCE etc.)\n- Experience working with orchestration tools (like Kubernetes, Mesos, Docker Swarm etc.) and container registeries (GCE, Docker hub etc.)\n- Experience using and setting up platform monitoring solutions (like nagios, munin etc.), application monitoring solutions (like New Relic, AppDynamics etc. ) and reporting solutions (like graphite, kibana etc.) to support and monitor business-critical production platform and applications.  \n- Design an on-call rota for supporting 24/7 production operations and assign appropriate roles and responsibilities with appropirate escalation strategies.\n- Crazy attention to detail - sleepless nights because a socket on one of the network interfaces was ingesting more data than expected.\n- Experience in at least two languages such as Python,Bash,Perl or the likes.\n\nYou also have\n- Ruthless capabilities of documenting every single detail about infrastructure,configuration, best practices, security policies etc. \n- Familiarity with firewalls, vpn setups, tunnels, network protocols, penetration testing, MFA would be advantageous.\n- Familiarity with agile development practices (a/b testing,unit testing,continuous deployment,continuous integration,scrums) and worked in a production environment.\n- Excellent written and verbal communication skills to communicate technical concepts to a wide variety of audience. \n- Ability to be emphathetic and form strong working relations with your team members, customers and partners.\n\nAs one of our first team members, a typical day might include some of the following:\n- Work with the founders to improve reliability and capacity of Healum’s products and platform on a daily basis in a cost-effective manner\n- Work with the software development team to enable seamless deployments of products and services into production, staging and testing environments\n- Work with our customers to identify and uncover simple mechanisms to integrate with their services; delivering innovative product propositions as a result.\n- Work with the delivery team to support our customers and users across multiple products; as part of our agile product & technology roadmap.\n- Inspire us with latest cloud infrastructure trends especially in digital health, cloud infrastructure, security and create some of your own.\n- Work with the business team to cost out future infrastructure needs and squeezing every ounce of efficiency from existing systems. \n\nTo land this EPIC gig, you need...\nQuality experience in large scale infrastructre management, a degree in physics, statistics or computer science. Background and expertise in Linux system administration, site reliability engineering, capacity planning, network design, security, firewalls and huge scale thinking!\n\nWould you like to make a lasting impact in people’s lives and change them for better? Then get in touch.\nAbsolutely NO recruitment agencies or outsourcing companies as we work with our PSL only.",
      "descriptionHtml": "<p>We are Healum - a well funded digital health company on a mission to improve and save 100 million lives across the globe. We believe that everyone should have access to better personalised preventative healthcare and healthcare professionals should be empowered to deliver this experience to their patients. Digital solutions can make this a reality. We build digital products to enable patients to monitor and understand their health, and software that empowers health professionals to achieve better outcomes with their patients. Our single aim is to maximise people’s engagement with their health by delighting them with products that make them feel confident, supported and motivated.</p>\n\n<p>We are looking for a Cloud Infrastructure / Systems Engineer based in London to help maintain Healum platform and products reliably in order to provide uninterrupted to our services. Are you excited about building petabyte-scale, business-critical systems? Do you find satisfaction in automating tasks that help you and others? Do you enjoy identifying performance bottlenecks in a complex data intensive environment? The most important characteristic is that you can wear many hats and you’ll love getting your hands dirty with capacity planning, scaling, security and testing. You’ll have a passion for playing a lead role in envisioning our cloud infrastructure and strategy. You will work closely with the founders to build high quality and scalable systems that are integrated with our products that establish Healum as a leader in providing useful and intelligent solutions for clinicians and their patients.</p>\n\n<p>You have</p>\n\n<ul>\n<li>Background and expertise in Linux system administration (like Centos), site reliability engineering, capacity planning, network design, security, firewalls.</li>\n<li>Strong experience in scripting, automation, internal tooling and configuration management system (like Puppet, Chef, Ansible etc.)</li>\n<li>Good experience deploying, maintaining, managing and scaling datastores - both SQL based (like MariaDB, MySQL etc.), non-SQL based (like Elastic, Cassandra, Neo4j etc.), KV caches (like Redis, Memcached etc.), data processsing (like Spark, Storm etc.) and messaging systems like (RabbitMQ, Kafka, NATS etc.) </li>\n<li>Practical understanding of development and deployment pipelines using CI/CD tools in an agile development environment (like Jenkins, Bamboo etc.)</li>\n<li>Experience working with virtualisation systems (like Docker, Vagrant etc.) VMs and hypervisors (like vsphere, xenserver etc.), distributed systems and microservices on cloud platforms (like AWS, GCE etc.)</li>\n<li>Experience working with orchestration tools (like Kubernetes, Mesos, Docker Swarm etc.) and container registeries (GCE, Docker hub etc.)</li>\n<li>Experience using and setting up platform monitoring solutions (like nagios, munin etc.), application monitoring solutions (like New Relic, AppDynamics etc. ) and reporting solutions (like graphite, kibana etc.) to support and monitor business-critical production platform and applications.<br></li>\n<li>Design an on-call rota for supporting 24/7 production operations and assign appropriate roles and responsibilities with appropirate escalation strategies.</li>\n<li>Crazy attention to detail - sleepless nights because a socket on one of the network interfaces was ingesting more data than expected.</li>\n<li>Experience in at least two languages such as Python,Bash,Perl or the likes.</li>\n</ul>\n\n<p>You also have</p>\n\n<ul>\n<li>Ruthless capabilities of documenting every single detail about infrastructure,configuration, best practices, security policies etc. </li>\n<li>Familiarity with firewalls, vpn setups, tunnels, network protocols, penetration testing, MFA would be advantageous.</li>\n<li>Familiarity with agile development practices (a/b testing,unit testing,continuous deployment,continuous integration,scrums) and worked in a production environment.</li>\n<li>Excellent written and verbal communication skills to communicate technical concepts to a wide variety of audience. </li>\n<li>Ability to be emphathetic and form strong working relations with your team members, customers and partners.</li>\n</ul>\n\n<p>As one of our first team members, a typical day might include some of the following:</p>\n\n<ul>\n<li>Work with the founders to improve reliability and capacity of Healum’s products and platform on a daily basis in a cost-effective manner</li>\n<li>Work with the software development team to enable seamless deployments of products and services into production, staging and testing environments</li>\n<li>Work with our customers to identify and uncover simple mechanisms to integrate with their services; delivering innovative product propositions as a result.</li>\n<li>Work with the delivery team to support our customers and users across multiple products; as part of our agile product &amp; technology roadmap.</li>\n<li>Inspire us with latest cloud infrastructure trends especially in digital health, cloud infrastructure, security and create some of your own.</li>\n<li>Work with the business team to cost out future infrastructure needs and squeezing every ounce of efficiency from existing systems. </li>\n</ul>\n\n<p>To land this EPIC gig, you need...<br>\nQuality experience in large scale infrastructre management, a degree in physics, statistics or computer science. Background and expertise in Linux system administration, site reliability engineering, capacity planning, network design, security, firewalls and huge scale thinking!</p>\n\n<p>Would you like to make a lasting impact in people’s lives and change them for better? Then get in touch.<br>\nAbsolutely NO recruitment agencies or outsourcing companies as we work with our PSL only.</p>\n",
      "position": "full-time",
      "experience": 5,
      "visaSponsorship": false,
      "locations": [
        "London",
        "Greater London",
        "London"
      ],
      "remote": false,
      "remoteLocations": [],
      "skills": [
        "Python",
        "noSQL",
        "Cloud Computing",
        "Big Data",
        "MySQL",
        "Distributed Systems",
        "Penetration Testing",
        "Centos",
        "Linux System Administration",
        "Puppet",
        "Bash",
        "DevOps",
        "Continuous Integration",
        "Firewall",
        "VPN",
        "Continuous Deployment",
        "SSL",
        "Nagios",
        "HAProxy",
        "Release Management",
        "AWS/EC2/ELB/S3/DynamoDB",
        "Shell Scripting",
        "Docker",
        "Google Cloud Platform",
        "Intrusion Detection Systems",
        "Google Compute Engine",
        "Build and Release Management",
        "Microservices",
        "Core Os",
        "Continous Delivery",
        "Kubernetes",
        "Application Performance Monitoring(Apm)",
        "Keepalived"
      ],
      "payment": {
        "salary": "£40k – £50k",
        "equity": "0.0% – 0.2%"
      },
      "recruiter": {
        "title": "",
        "role": "Founder",
        "url": "https://angel.co/u/aannuujj",
        "name": "Anuj S",
        "avatar": "https://photos.angel.co/users/3569940-medium_jpg?1490459494"
      },
      "refs": {
        "angelListId": "258568",
        "angelListUrl": "https://angel.co/company/healum/jobs/258568-"
      }
    },
    {
      "role": "Marketing",
      "title": "Marketing and Communications Manager",
      "description": "*We are Healum* - a well funded digital health company on a mission to improve and save 100 million lives across the globe. We believe that everyone should have access to personalised and preventative healthcare, and that digital solutions can empower healthcare professionals to deliver that for their patients.  We build digital products to enable patients to monitor and understand their health, and software that empowers health professionals to achieve better outcomes with their patients. Our primary aim is to maximise people’s engagement with their health by delighting them with products that make them feel confident, supported and motivated.\n\nWe are looking for a marketing manager to help us transform healthcare and improve health outcomes by marketing our products to healthcare professional customers and the people and patients that they are trying to help. The healthcare professionals that use our products and the community of people that they support, play the most important role in building our value proposition and our products. Are you passionate about building supportive communities around a purpose? Do you enjoy listening deeply to the challenges that people across the community have in order to spot disruptive market opportunities? Do you use actionable insights each day to address the needs and pain points of people? Are you hungry for innovation and do you embrace change?  Do you love creating messaging, telling stories and delivering campaigns across paid, owned and earned communications channels to drive sales and engagement? Are you obsessed with the effective implementation and measurement of all communications and content in order to reduce cost per acquisition and maximise the return from expenditure on marketing? The most important characteristics are that you can wear many hats across the marketing and communications spectrum and that you aren't afraid to get your hands dirty. You will work closely with the founders to deliver new value propositions that genuinely enrich people’s lives by having strategic input into the direction of the company. \n\n*You have*\n* An ability to balance organisational rigour with creative opportunism.\n* Experience in executing both always-on and campaign-led content marketing in order to drive inbound leads.\n* Vision - and lots of it. You can see what healthcare could look like in 50 years time and what Healum could contribute to that.\n* An ability to thrive under intense pressure and to create opportunities out of situations of chaos.\n* An intuitive understanding of how to match what customers want with the right value proposition for the right price,  \n* Creativity and curiosity supported by analytical thinking and problem solving skills. \n\n\n*You also have*\n* Previous startup experience - you thrive in conditions of uncertainty and pressure.\n* Previous experience in healthcare, health IT or delivering health and wellbeing services in the third sector. \n* Experience in both implementing and conceiving marketing plans.\n* Experience working with teams of commercial people, researchers, designers and developers.\n*  A high value for openness, humility, flexibility, collaboration, diversity and empathy.\n*  A high value for diversity of thought and experience.\n\nAs one of our first team members, a typical day might include some of the following:\n* Manage the delivery of communications through our social media channels and analyse sentiment and feedback on our proposition.\n* Create a marketing and communications plan to support the business development efforts for our propositions.\n* Communicate key customer insights and needs to the founders, product developers. and business development team as part of the overall company strategy. \n* Tell our story through the creation of videos, animations and articles in partnership with videographers and PR agencies.\n* Work with internal and external research team to identify how our evidence should be communicated.\n* Agree copy, content and design changes to be made on our website in order to improve SEO and inbound efforts.\n* Manage search marketing.\n* Input into the pricing and positioning of our product against competitors.\n* Analyse and communicate the effectiveness of our marketing and advertising investments.\n* Work with customers and the people that they are helping, to develop case studies.\n\n*To land this EPIC gig, you need...*\n-2+ years experience working in a marketing team or agency.\n-Experience in implementing online and offline marketing and communications campaigns across paid, owned and earned media channels. \n-Strong communication, sales, presentation, management, and leadership skills; goal-oriented, flexible, and creative under pressure; knowledge of current marketing trends and multimedia platforms; and strong budget management skills.\n-University Degree: 2:1 and above.\n-Some experience working in software, technology and/or healthcare.",
      "descriptionHtml": "<p><em>We are Healum</em> - a well funded digital health company on a mission to improve and save 100 million lives across the globe. We believe that everyone should have access to personalised and preventative healthcare, and that digital solutions can empower healthcare professionals to deliver that for their patients.  We build digital products to enable patients to monitor and understand their health, and software that empowers health professionals to achieve better outcomes with their patients. Our primary aim is to maximise people’s engagement with their health by delighting them with products that make them feel confident, supported and motivated.</p>\n\n<p>We are looking for a marketing manager to help us transform healthcare and improve health outcomes by marketing our products to healthcare professional customers and the people and patients that they are trying to help. The healthcare professionals that use our products and the community of people that they support, play the most important role in building our value proposition and our products. Are you passionate about building supportive communities around a purpose? Do you enjoy listening deeply to the challenges that people across the community have in order to spot disruptive market opportunities? Do you use actionable insights each day to address the needs and pain points of people? Are you hungry for innovation and do you embrace change?  Do you love creating messaging, telling stories and delivering campaigns across paid, owned and earned communications channels to drive sales and engagement? Are you obsessed with the effective implementation and measurement of all communications and content in order to reduce cost per acquisition and maximise the return from expenditure on marketing? The most important characteristics are that you can wear many hats across the marketing and communications spectrum and that you aren&#39;t afraid to get your hands dirty. You will work closely with the founders to deliver new value propositions that genuinely enrich people’s lives by having strategic input into the direction of the company. </p>\n\n<p><em>You have</em></p>\n\n<ul>\n<li>An ability to balance organisational rigour with creative opportunism.</li>\n<li>Experience in executing both always-on and campaign-led content marketing in order to drive inbound leads.</li>\n<li>Vision - and lots of it. You can see what healthcare could look like in 50 years time and what Healum could contribute to that.</li>\n<li>An ability to thrive under intense pressure and to create opportunities out of situations of chaos.</li>\n<li>An intuitive understanding of how to match what customers want with the right value proposition for the right price,<br></li>\n<li>Creativity and curiosity supported by analytical thinking and problem solving skills. </li>\n</ul>\n\n<p><em>You also have</em></p>\n\n<ul>\n<li>Previous startup experience - you thrive in conditions of uncertainty and pressure.</li>\n<li>Previous experience in healthcare, health IT or delivering health and wellbeing services in the third sector. </li>\n<li>Experience in both implementing and conceiving marketing plans.</li>\n<li>Experience working with teams of commercial people, researchers, designers and developers.</li>\n<li> A high value for openness, humility, flexibility, collaboration, diversity and empathy.</li>\n<li> A high value for diversity of thought and experience.</li>\n</ul>\n\n<p>As one of our first team members, a typical day might include some of the following:</p>\n\n<ul>\n<li>Manage the delivery of communications through our social media channels and analyse sentiment and feedback on our proposition.</li>\n<li>Create a marketing and communications plan to support the business development efforts for our propositions.</li>\n<li>Communicate key customer insights and needs to the founders, product developers. and business development team as part of the overall company strategy. </li>\n<li>Tell our story through the creation of videos, animations and articles in partnership with videographers and PR agencies.</li>\n<li>Work with internal and external research team to identify how our evidence should be communicated.</li>\n<li>Agree copy, content and design changes to be made on our website in order to improve SEO and inbound efforts.</li>\n<li>Manage search marketing.</li>\n<li>Input into the pricing and positioning of our product against competitors.</li>\n<li>Analyse and communicate the effectiveness of our marketing and advertising investments.</li>\n<li>Work with customers and the people that they are helping, to develop case studies.</li>\n</ul>\n\n<p><em>To land this EPIC gig, you need...</em><br>\n-2+ years experience working in a marketing team or agency.<br>\n-Experience in implementing online and offline marketing and communications campaigns across paid, owned and earned media channels. <br>\n-Strong communication, sales, presentation, management, and leadership skills; goal-oriented, flexible, and creative under pressure; knowledge of current marketing trends and multimedia platforms; and strong budget management skills.<br>\n-University Degree: 2:1 and above.<br>\n-Some experience working in software, technology and/or healthcare.</p>\n",
      "position": "full-time",
      "experience": 2,
      "visaSponsorship": false,
      "locations": [
        "London",
        "Greater London",
        "London"
      ],
      "remote": false,
      "remoteLocations": [],
      "skills": [
        "PR",
        "Social Media Marketing",
        "Marketing Research",
        "Digital Health",
        "Earned, Owned And Paid Media "
      ],
      "payment": {
        "salary": "£30k – £35k",
        "equity": "0.1% – 0.2%"
      },
      "recruiter": {
        "title": null,
        "role": "Founder",
        "url": "https://angel.co/u/jonathan-abraham-1",
        "name": "Jonathan Abraham",
        "avatar": "https://photos.angel.co/users/3569633-medium_jpg?1473104353"
      },
      "refs": {
        "angelListId": "329456",
        "angelListUrl": "https://angel.co/company/healum/jobs/329456-"
      }
    },
    {
      "role": "Other",
      "title": "Intern",
      "description": null,
      "descriptionHtml": "",
      "position": "internship",
      "experience": 1,
      "visaSponsorship": false,
      "locations": [
        "London"
      ],
      "remote": false,
      "remoteLocations": [],
      "skills": [],
      "payment": {
        "salary": "No salary"
      },
      "recruiter": {
        "title": null,
        "role": "Founder",
        "url": "https://angel.co/u/jonathan-abraham-1",
        "name": "Jonathan Abraham",
        "avatar": "https://photos.angel.co/users/3569633-medium_jpg?1473104353"
      },
      "refs": {
        "angelListId": "360793",
        "angelListUrl": "https://angel.co/company/healum/jobs/360793-"
      }
    },
    {
      "role": "Software Engineer",
      "title": "Golang (Go) Backend Engineer to transform healthcare and improve health outcomes",
      "description": "We are Healum - a well funded digital health company on a mission to improve and save 100 million lives across the globe. We believe that everyone should have access to better personalised preventative healthcare and healthcare professionals should be empowered to deliver this experience to their patients. Digital solutions can make this a reality. We build digital products to enable patients to monitor and understand their health, and software that empowers health professionals to achieve better outcomes with their patients. Our single aim is to maximise people’s engagement with their health by delighting them with products that make them feel confident, supported and motivated.\n\nWe are looking for a Golang Software Engineer based in London, UK for a full-time position, to help further build Healum's distributed services platform to enhance our value proposition to our users. Are you excited about building petabyte-scale, business-critical, distributed software that helps people to transform their health outcomes? Do you find a peculiar satisfaction in bringing efficiency through intelligent algorithms? Do you enjoy looking at real-time data and incorporating that in to how you build software? The most important characteristic is that you can wear many hats and you’ll love getting your hands dirty with planning, scaling, security and testing. You’ll have a passion for playing a lead role in envisioning our platform services and preparing Healum for scale and high availability. You will work closely with the founders to build high quality and scalable systems that are integrated with our products that establish Healum as a leader in providing useful and intelligent solutions for clinicians and their patients.\n\nYou have\n- 5+ years experience in software development\n- Extensive knowledge of Golang and at least one other formal software languages (think compiled software languages C/C+, Java, Scala, Erlang, Clojure). *****This is really important*****. In your application note - please mention ONE feature about Golang that you like in order to qualify your application for consideration. \n- Experience in building distributed scalable and fault tolerant systems using micro-services, CEP, MQs.\n- Strong experience in working with data and multiple datastores both SQL / Non- SQL like relational data stores, document data stores, caches and graph Databases\n- Experience using go-micro or some other microservices framework and other tools like glide, godep, gorilla mux, revel,\n- Affinity for smart hacking over process and the ability to take complex technical requirements and breaking them down into smaller execution units.\n- Ruthless capabilities of documenting major technical details outside of the code and minor ones inside the code.\n- cognitive abilities to choose smart practices over best practices with a keen eye over security and scalability.\n- experience in continuously shipping and testing through deployment pipelines using CI/CD tools in an agile development environment.\n- experience in performance tuning your code and scalability thinking while writing it.\n\nYou also have\n- Deep understanding of distributed systems and service mesh concepts\n- Familiarity in Linux systems (like Centos) and some experience in scripting, automation and tooling.\n- Experience working with virtualisation systems (like Docker, Vagrant etc.) VMs and hypervisors (like vsphere, xenserver etc.)\n- Experience working with orchestration tools (like Kubernetes, Mesos, Docker Swarm etc.) and container registeries (GCE, Docker hub etc.)\n- Crazy attention to detail - sleepless nights because you found a bug that you couldn't resolve at 5:44 pm.\n- Familiarity with agile development practices (a/b testing,unit testing,continuous deployment,continuous integration,scrums) and worked in a production environment.\n- Excellent written and verbal communication skills to communicate technical concepts to a wide variety of audience.\n- Ability to be empathetic and form strong working relations with your team members, customers and partners.\n\nAs one of our first team members, a typical day might include some of the following: \n- Write, test, debug and ship code and gather feedback on scale, performance, security to incorporate back into the platform.\n- Work with the founders to identify complex technical problems and solve them. \n- Work with the product design and client experience development team to support them with scalable services\n- Feed into the overall mission and vision of the Healum's platform over the period of coming months and years. \n- Inspire us with latest technical trends and frameworks especially in programming languages, data stores, security and create some of your own. \n- Work with the infrastructure team to squeeze every ounce of efficiency from our existing systems.\n\nTo land this EPIC gig, you need... \nQuality experience in building large scale distributed systems, a formal degree in computer science, physics or mathematics. Background and expertise in software development, micro services, API integrations, data analytics, security and huge scale thinking!\n\nWould you like to make a lasting impact in people’s lives and change them for better? Then get in touch. \nAbsolutely NO recruitment agencies or outsourcing companies as we work with our PSL only.",
      "descriptionHtml": "<p>We are Healum - a well funded digital health company on a mission to improve and save 100 million lives across the globe. We believe that everyone should have access to better personalised preventative healthcare and healthcare professionals should be empowered to deliver this experience to their patients. Digital solutions can make this a reality. We build digital products to enable patients to monitor and understand their health, and software that empowers health professionals to achieve better outcomes with their patients. Our single aim is to maximise people’s engagement with their health by delighting them with products that make them feel confident, supported and motivated.</p>\n\n<p>We are looking for a Golang Software Engineer based in London, UK for a full-time position, to help further build Healum&#39;s distributed services platform to enhance our value proposition to our users. Are you excited about building petabyte-scale, business-critical, distributed software that helps people to transform their health outcomes? Do you find a peculiar satisfaction in bringing efficiency through intelligent algorithms? Do you enjoy looking at real-time data and incorporating that in to how you build software? The most important characteristic is that you can wear many hats and you’ll love getting your hands dirty with planning, scaling, security and testing. You’ll have a passion for playing a lead role in envisioning our platform services and preparing Healum for scale and high availability. You will work closely with the founders to build high quality and scalable systems that are integrated with our products that establish Healum as a leader in providing useful and intelligent solutions for clinicians and their patients.</p>\n\n<p>You have</p>\n\n<ul>\n<li>5+ years experience in software development</li>\n<li>Extensive knowledge of Golang and at least one other formal software languages (think compiled software languages C/C+, Java, Scala, Erlang, Clojure). **<strong><em>This is really important</em></strong>**. In your application note - please mention ONE feature about Golang that you like in order to qualify your application for consideration. </li>\n<li>Experience in building distributed scalable and fault tolerant systems using micro-services, CEP, MQs.</li>\n<li>Strong experience in working with data and multiple datastores both SQL / Non- SQL like relational data stores, document data stores, caches and graph Databases</li>\n<li>Experience using go-micro or some other microservices framework and other tools like glide, godep, gorilla mux, revel,</li>\n<li>Affinity for smart hacking over process and the ability to take complex technical requirements and breaking them down into smaller execution units.</li>\n<li>Ruthless capabilities of documenting major technical details outside of the code and minor ones inside the code.</li>\n<li>cognitive abilities to choose smart practices over best practices with a keen eye over security and scalability.</li>\n<li>experience in continuously shipping and testing through deployment pipelines using CI/CD tools in an agile development environment.</li>\n<li>experience in performance tuning your code and scalability thinking while writing it.</li>\n</ul>\n\n<p>You also have</p>\n\n<ul>\n<li>Deep understanding of distributed systems and service mesh concepts</li>\n<li>Familiarity in Linux systems (like Centos) and some experience in scripting, automation and tooling.</li>\n<li>Experience working with virtualisation systems (like Docker, Vagrant etc.) VMs and hypervisors (like vsphere, xenserver etc.)</li>\n<li>Experience working with orchestration tools (like Kubernetes, Mesos, Docker Swarm etc.) and container registeries (GCE, Docker hub etc.)</li>\n<li>Crazy attention to detail - sleepless nights because you found a bug that you couldn&#39;t resolve at 5:44 pm.</li>\n<li>Familiarity with agile development practices (a/b testing,unit testing,continuous deployment,continuous integration,scrums) and worked in a production environment.</li>\n<li>Excellent written and verbal communication skills to communicate technical concepts to a wide variety of audience.</li>\n<li>Ability to be empathetic and form strong working relations with your team members, customers and partners.</li>\n</ul>\n\n<p>As one of our first team members, a typical day might include some of the following: </p>\n\n<ul>\n<li>Write, test, debug and ship code and gather feedback on scale, performance, security to incorporate back into the platform.</li>\n<li>Work with the founders to identify complex technical problems and solve them. </li>\n<li>Work with the product design and client experience development team to support them with scalable services</li>\n<li>Feed into the overall mission and vision of the Healum&#39;s platform over the period of coming months and years. </li>\n<li>Inspire us with latest technical trends and frameworks especially in programming languages, data stores, security and create some of your own. </li>\n<li>Work with the infrastructure team to squeeze every ounce of efficiency from our existing systems.</li>\n</ul>\n\n<p>To land this EPIC gig, you need... <br>\nQuality experience in building large scale distributed systems, a formal degree in computer science, physics or mathematics. Background and expertise in software development, micro services, API integrations, data analytics, security and huge scale thinking!</p>\n\n<p>Would you like to make a lasting impact in people’s lives and change them for better? Then get in touch. <br>\nAbsolutely NO recruitment agencies or outsourcing companies as we work with our PSL only.</p>\n",
      "position": "full-time",
      "experience": 5,
      "visaSponsorship": false,
      "locations": [
        "London",
        "Greater London",
        "London"
      ],
      "remote": false,
      "remoteLocations": [],
      "skills": [
        "Go (Golang)",
        "Microservices",
        "Go"
      ],
      "payment": {
        "salary": "£45k – £65k"
      },
      "recruiter": {
        "title": "",
        "role": "Founder",
        "url": "https://angel.co/u/aannuujj",
        "name": "Anuj S",
        "avatar": "https://photos.angel.co/users/3569940-medium_jpg?1490459494"
      },
      "refs": {
        "angelListId": "544846",
        "angelListUrl": "https://angel.co/company/healum/jobs/544846-"
      }
    },
    {
      "role": "Sales",
      "title": "Sales Account Manager",
      "description": "We are looking for a sales account manager  to help us transform healthcare and to improve health outcomes by finding and managing new healthcare provider customers to use our software.\n\nRequirements for the job:\n-Excellent organisational skills\n-Previous startup experience - you thrive in conditions of uncertainty and pressure\n-Previous experience in selling or marketing health IT, healthcare or software\n-Experience in one or more project management methodologies \n-Vision - and lots of it. You can see what healthcare could look like in 50 years time and what we could contribute to that.\n-Passion to build and manage long-term customer relationships.\n-An ability to thrive under intense pressure and to create opportunities out of situations of chaos\n-An ability to balance organisational rigour with creative opportunism\n-Crazy attention to detail - sleepless nights because your gantt chart doesn't account for the missing days\n\nMain duties and responsibilities:\n-identify client’s needs and match with our product and price offering\n-prospect and close business from new customers\n-coordinate and supervise the delivery of customer delivery of the software and IT development tasks, milestones and workpackages \n-Use customer success stories to find and sell to other customers\n-Work with our patient and clinical customers to refine our value proposition\n-Manage the delivery of project reports and budgets to clients\n-Work with founders on sales strategies and tactics to win and retain business\n\nPlease be based in London or willing to travel to London and absolutely NO recruitment agencies as we work with our PSL only.\n\nClosing date for applications \n25th August 2019",
      "descriptionHtml": "<p>We are looking for a sales account manager  to help us transform healthcare and to improve health outcomes by finding and managing new healthcare provider customers to use our software.</p>\n\n<p>Requirements for the job:<br>\n-Excellent organisational skills<br>\n-Previous startup experience - you thrive in conditions of uncertainty and pressure<br>\n-Previous experience in selling or marketing health IT, healthcare or software<br>\n-Experience in one or more project management methodologies <br>\n-Vision - and lots of it. You can see what healthcare could look like in 50 years time and what we could contribute to that.<br>\n-Passion to build and manage long-term customer relationships.<br>\n-An ability to thrive under intense pressure and to create opportunities out of situations of chaos<br>\n-An ability to balance organisational rigour with creative opportunism<br>\n-Crazy attention to detail - sleepless nights because your gantt chart doesn&#39;t account for the missing days</p>\n\n<p>Main duties and responsibilities:<br>\n-identify client’s needs and match with our product and price offering<br>\n-prospect and close business from new customers<br>\n-coordinate and supervise the delivery of customer delivery of the software and IT development tasks, milestones and workpackages <br>\n-Use customer success stories to find and sell to other customers<br>\n-Work with our patient and clinical customers to refine our value proposition<br>\n-Manage the delivery of project reports and budgets to clients<br>\n-Work with founders on sales strategies and tactics to win and retain business</p>\n\n<p>Please be based in London or willing to travel to London and absolutely NO recruitment agencies as we work with our PSL only.</p>\n\n<p>Closing date for applications <br>\n25th August 2019</p>\n",
      "position": "full-time",
      "experience": 1,
      "visaSponsorship": false,
      "locations": [
        "London",
        "Greater London"
      ],
      "remote": false,
      "remoteLocations": [],
      "skills": [
        "Sales",
        "Sales and Marketing",
        "Digital Health",
        "Marketing Management",
        "Account Management"
      ],
      "payment": {
        "salary": "£26k – £35k"
      },
      "recruiter": {
        "title": null,
        "role": "Founder",
        "url": "https://angel.co/u/jonathan-abraham-1",
        "name": "Jonathan Abraham",
        "avatar": "https://photos.angel.co/users/3569633-medium_jpg?1473104353"
      },
      "refs": {
        "angelListId": "595618",
        "angelListUrl": "https://angel.co/company/healum/jobs/595618-"
      }
    }
  ]
}