{
  "name": "Skive it®",
  "avatar": "https://photos.angel.co/startups/i/125565-9551d33e9a3e2544e16db145359aea76-medium_jpg.jpg?buster=1579725908",
  "slogan": "Autonomous AI chip that will enable machines to feel ",
  "description": "Skive it®, Inc. is an Autonomous AI chip company that is building a specialized, ultra- secure hardware chip that will be the heart of the robot as opposed to the ‘brain'. Imagine a level 5 autonomous taxi in Manhattan or London reinvented with Robometrics® or your new SUV that is not just an automobile but your companion for life, learning and evolving. A robot companion that can feel for an elderly or an autonomous aircraft that can feel. \n\nOur revolutionary fully autonomous Deep Learning technology will enable machines to feel through Robometrics® kernel on single silicon wafer, a living chip. Founders have 30+ years technology experience in distributed systems and AI/Deep Learning with professional experience from Oracle, MIT Media Labs, IBM Research and Intel Research. \n\nMost recently, we have been working on building an autonomous aircraft that can feel. We are building the next generation of jets that are truly living machines.  \n\nhttps://skive.it ",
  "links": [
    {
      "type": "website",
      "url": "https://skive.it"
    },
    {
      "type": "blog",
      "url": ""
    },
    {
      "type": "twitter",
      "url": "https://twitter.com/skiveit"
    },
    {
      "type": "facebook",
      "url": "https://www.facebook.com/skiveitinc"
    },
    {
      "type": "linkedIn",
      "url": "https://www.linkedin.com/company/skive-it-inc-?trk=top_nav_home"
    },
    {
      "type": "productHunt",
      "url": ""
    }
  ],
  "locations": [
    "San Francisco",
    "London",
    "Beijing"
  ],
  "marketTags": [
    "Deep Learning",
    "Artificial Intelligence",
    "Robotics",
    "Aerospace",
    "Semiconductors"
  ],
  "employees": "SIZE_1_10",
  "funding": {
    "totalRaised": 600000,
    "rounds": [
      {
        "type": "Seed",
        "closedAt": 1472688000,
        "valuation": 0
      }
    ]
  },
  "team": [
    {
      "title": null,
      "role": "Founder",
      "url": "https://angel.co/u/arvinda-mohan",
      "name": "arvindamohan",
      "avatar": "https://photos.angel.co/users/270608-medium_jpg?1463305858",
      "bioHtml": "Founder Skive it • Studied at <a href=\"https://angel.co/indian-institute-of-technology-kanpur\" class=\"at_link\"><span class=\"at_symbol\">@</span><span class=\"at_name\">Indian Institute of Technology - Kanpur</span></a>"
    },
    {
      "title": null,
      "role": "Founder",
      "url": "https://angel.co/u/alexander-rasin",
      "name": "Alexander Rasin",
      "avatar": "https://angel.co/images/shared/nopic.png",
      "bioHtml": "Founder Skive it • Studied at <a href=\"https://angel.co/brown-university\" class=\"at_link\"><span class=\"at_symbol\">@</span><span class=\"at_name\">Brown University</span></a>"
    },
    {
      "title": null,
      "role": "Founder",
      "url": "https://angel.co/u/aditya-mohan",
      "name": "Aditya Mohan",
      "avatar": "https://photos.angel.co/users/178357-medium_jpg?1573113168",
      "bioHtml": "Product Executive, #Scientist, #PM , Advisor, Expertise in #AI , #DeepLearning &amp; #Cloud; Worked@ Oracle, IBM, Intel, HP, MIT Media Labs; Studied at Brown+IIT+YC"
    },
    {
      "title": "Korea lead",
      "role": "Employee",
      "url": "https://angel.co/u/yong-suk-choi",
      "name": "Yong Suk Choi",
      "avatar": "https://photos.angel.co/users/5164870-medium_jpg?1479790666",
      "bioHtml": "Over seven years of Digital, Social and Analytics\nexperience managing various global clients within Korea and in South East Asia Region. "
    },
    {
      "title": "Marketing Intern",
      "role": "Employee",
      "url": "https://angel.co/u/jeong-min-megan-shin",
      "name": "Jeong Min (Megan) Shin",
      "avatar": "https://photos.angel.co/users/2299999-medium_jpg?1464808715",
      "bioHtml": "Recent graduate of Brandeis University, seeking employment in the marketing industry"
    }
  ],
  "perks": [],
  "refs": {
    "angelListId": "125565",
    "angelListUrl": "https://angel.co/company/skive-it"
  },
  "jobs": [
    {
      "role": "Other Engineering",
      "title": "ASIC Designer/ Intern",
      "description": "U: The crazy enough to think differently; the round pegs in the square holes... the ones who see things differently. Who consider themselves as being super cool and don't mind been seen as the crazy ones? If yes, we want you!\n\nUS: \nSkive it® is a fun, upcoming hot San Francisco, California based startup with additional registered office in UK, founded by two Brown University computer science grads. We are building a specialized evolving chip that will be the heart of the robot as opposed to the brain with the goal to build robots that can feel. We believe the aging world will not need super human(oid)s but robots that are more human and Skive it’s autonomous Deep Learning technology will be the center piece of this. We call this technology Robometrics®. It will form the morality layer for any robotics system that interacts with humans  on top of their AI enabled brain to bring humanity back into AI.\n \nOur team includes experienced executives with computer science Ph.D. and masters from Brown University with professional experience from Oracle, IBM, Intel, MIT Media Labs and HP. We have a culture that believe in working hard but intelligently.",
      "descriptionHtml": "<p>U: The crazy enough to think differently; the round pegs in the square holes... the ones who see things differently. Who consider themselves as being super cool and don&#39;t mind been seen as the crazy ones? If yes, we want you!</p>\n\n<p>US: <br>\nSkive it® is a fun, upcoming hot San Francisco, California based startup with additional registered office in UK, founded by two Brown University computer science grads. We are building a specialized evolving chip that will be the heart of the robot as opposed to the brain with the goal to build robots that can feel. We believe the aging world will not need super human(oid)s but robots that are more human and Skive it’s autonomous Deep Learning technology will be the center piece of this. We call this technology Robometrics®. It will form the morality layer for any robotics system that interacts with humans  on top of their AI enabled brain to bring humanity back into AI.</p>\n\n<p>Our team includes experienced executives with computer science Ph.D. and masters from Brown University with professional experience from Oracle, IBM, Intel, MIT Media Labs and HP. We have a culture that believe in working hard but intelligently.</p>\n",
      "position": "internship",
      "experience": 1,
      "visaSponsorship": false,
      "locations": [
        "San Francisco",
        "London"
      ],
      "remote": true,
      "remoteLocations": [],
      "skills": [],
      "payment": {
        "salary": "No salary"
      },
      "recruiter": {
        "title": null,
        "role": "Investor",
        "url": "https://angel.co/u/aditya-mohan",
        "name": "Aditya Mohan",
        "avatar": "https://photos.angel.co/users/178357-medium_jpg?1573113168"
      },
      "refs": {
        "angelListId": "463943",
        "angelListUrl": "https://angel.co/company/skive-it/jobs/463943-"
      }
    },
    {
      "role": "Sales",
      "title": "Business Development Associate (London)",
      "description": "It takes two to tango. Skive it® is getting humanity back into AI, making machines more humans and hoping to make humans less like machines.  We can’t do it alone and are partnering with government, technology, aerospace, venture capital, finance, healthcare and automotive industry leaders world wide. Skive it® is a technology innovator by heart and will prefer candidates with engineering background but it is not an absolute must as we are seeking to build a world class cross-functional team ranging from designers, creative writers, executives, engineers, sales, marketing and product staff. For example, someone with experience in healthcare, fashion or retail is highly encouraged to apply if they can show passion and/or know-how in Skive it® technology areas. \n  \nThe ideal candidate will have market development and business development experience in technology, be a self-starter, and be willing operate both tactically and strategically. As key team member in this fast growing, exciting space of AI you will have the opportunity to help lead the early market development efforts for new product and services, establish wins with customers, create new eco-system partnerships, and then as the business starts to formulate, help drive the growth and shape the future of a product and service category that will have a significant impact on our customers’ business. \n\nThe candidate will assume some/all the responsibilities below based on experience, potential and company strategic direction.  \n .\n* Manage ongoing day-to-day partnerships. Develop positive working relationships with partners to build business\n* Develop and communicate parameters and scope of partnership (opportunities, goals, ideas, asset needs, resource needs, deadlines)\n* Develop Skive it® assets and liaise with partner to progress relationship (decks, images, stats, MNDAs)\n* Lead and manage partner calls; write clear, organized recaps of meetings, next steps\n* Distribute/share documents with the executional team and senior management; work with team leads to ensure alignment, accuracy and clarityInitiate projects and designate resource needs across the team; implement and manage ongoing partnership needs\n* Maintain healthy dialogue with the partners and positive relationships; building confidence among partners, gaining their trust in your abilities\n* Develop and implement innovative and new approaches (ie improve efficiencies, new ways to execute a program etc). \n* Proactively ensure timelines and needs are communicated with creative, project managers /engineering, marketing and customer service where relevant\n* Ensure briefs to teams are efficient and concise, to drive the best quality outcome for the work\n* Provide feedback, data, reports to partners where reporting is required. Monthly reporting on KPI’s within channel partners\n* Analyze metrics to ensure goals are met; with insight into what worked / what didn’t work \n\nIn addition, you will also work with the Skive it® executive team on: \n\nStrategy \n* Work with Skive it® CEO on setting up new channel partners, pitching company services and case studies to them and overseeing on-boarding processes.\n* Identifying and reaching out to new potential channel partners, thinking creatively on potential partners.\n* Stay current with latest developments in startup and corporate ecosystems and competitor activities\n\nSales \n* Developing opportunities and qualifying these into sales\n* Working closely with Skive it® CEO on converting partnerships into sales\n* Working to sales and revenue targets as set by the Skive it® CEO\n* Coordinate with partners to create and execute business plans to meet sales goals e.g. running a specific campaign  \n* Analyze market trends and accordingly develop sales plans to increase brand awareness\n\nMarketing \n* Attending industry events and driving partnerships with them to create speaking opportunities for yourself and their wider team\n* Organizing and supporting events with partners to drive lead generation\n\nOperations \n* Maintaining relationships with channel partners\n* Implementing channel marketing plans\n* Deliver customer presentations and attend sales meetings and partner conferences\n* Assist in partner marketing activities such as trade shows, campaigns investor evenings and other promotional activities\n\nMinimum Qualifications \n* Action oriented. Ability to multitask and juggle multiple partners and projects, will follow up on deadlines, flagging questions + issues, and ensuring deadlines are met.\n* Strong verbal and written communications skills in English including strong presentation skills and the ability to articulate complex concepts to cross functional audiences.\n* Extremely strong attention to detail. (written and verbal)\n* Have excellent interpersonal skills and an ability to build strong relationships with partners.\n* Be driven, highly motivated and passionate about sales.\n* Understand lifecycles of a technology start-up.\n* 1+ years of product management, business development, product marketing and/or program management experience. \n* Bachelors degree. \n\nPreferred Qualifications  \n* MBA or Graduate degree\n* Have a black book of contacts within the government, technology, aerospace, venture capital and/or healthcare industry   \n* B2B experience in government, technology, aerospace, venture capital, finance, healthcare and/or automotive industry\n\nBenefits \n* An early spot at a fast-growing company that is changing the future of AI and autonomous machines. \n* Opportunity to work in a product focused environment to create the worlds first machines that can feel. \n* A huge level up in your experience. We’ll make sure you see a lot of growth in your skill set that helps you to accelerates your career.  \n* Being part of a small startup team, an opportunity to work across multiple parts of the value chain in an industry starting with Aerospace, autonomous cars and healthcare. \n* Opportunity to work with and connect with Skive it® founders, executive team and advisory board that are industry visionaries and though leaders. \n* Compensation, benefits, equity, and salary that are above industry average once the current funding round close. Compensation mentioned on this post are future estimates.\n* Currently, 100% remote work that will ensure that you can maintain work-life balance even when working long hours (Yes, we do believe in ‘996’ work culture)\n* Participate in annual team retreat. Once a year the entire Skive it® team gets together at an inspiring location to meet, work and play hard.\n*  Unlimited Vacation. \n\nWe are focused on building a diverse and inclusive workforce. If you’re excited about this role, but do not meet 100% of the qualifications listed above, we encourage you to apply.\n\nWe thank all applicants for their interest. \n\nCulture\nSkive it® is getting humanity back into AI, making machines more humans and hoping to make humans less like machines. We like people who are crazy enough to think differently; the round pegs in the square holes... the ones who see things differently. Who consider themselves as being super cool and don't mind been seen as the crazy ones. A passion to create innovative products is an absolute must. \n\n\"The only way to do great work is to love what you do\" — Steve Jobs \n\nWork culture include: \n* It is OK to be 25% wrong and take risk. Learn by failing 1 out of 4 times [only]. \n* Aim for perfection - All or Nothing\n* Chase 10X and not 10%\n* Just do it - As one of our founder who worked at MIT Media Labs says “Deploy!”. Write instead of just talk, build, prototype and deploy instead of just write. \n* Win as a team \n* Extreme ownership \n\nSkive it® expects employees to be honest, trustworthy, and operate with integrity. Discrimination and all unlawful harassment (including sexual harassment) in employment is not tolerated. We encourage success based on our individual merits and abilities, and all decisions regarding recruitment, hiring, promotion, compensation, employee development decisions such as training, and all other terms and conditions of employment, will be made without regard to race, nationality, national origin, citizenship status, employment status, ethnicity, ethnic origin, color, creed, religion, belief, age, marital status, pregnancy, gender, gender identity, sexual preference, lifestyle, social class, military status, disability, physical features, or any other protected status. We oppose all forms of unlawful or unfair discrimination. Skive it® is an equal opportunity employer.",
      "descriptionHtml": "<p>It takes two to tango. Skive it® is getting humanity back into AI, making machines more humans and hoping to make humans less like machines.  We can’t do it alone and are partnering with government, technology, aerospace, venture capital, finance, healthcare and automotive industry leaders world wide. Skive it® is a technology innovator by heart and will prefer candidates with engineering background but it is not an absolute must as we are seeking to build a world class cross-functional team ranging from designers, creative writers, executives, engineers, sales, marketing and product staff. For example, someone with experience in healthcare, fashion or retail is highly encouraged to apply if they can show passion and/or know-how in Skive it® technology areas. </p>\n\n<p>The ideal candidate will have market development and business development experience in technology, be a self-starter, and be willing operate both tactically and strategically. As key team member in this fast growing, exciting space of AI you will have the opportunity to help lead the early market development efforts for new product and services, establish wins with customers, create new eco-system partnerships, and then as the business starts to formulate, help drive the growth and shape the future of a product and service category that will have a significant impact on our customers’ business. </p>\n\n<p>The candidate will assume some/all the responsibilities below based on experience, potential and company strategic direction.<br><br>\n .</p>\n\n<ul>\n<li>Manage ongoing day-to-day partnerships. Develop positive working relationships with partners to build business</li>\n<li>Develop and communicate parameters and scope of partnership (opportunities, goals, ideas, asset needs, resource needs, deadlines)</li>\n<li>Develop Skive it® assets and liaise with partner to progress relationship (decks, images, stats, MNDAs)</li>\n<li>Lead and manage partner calls; write clear, organized recaps of meetings, next steps</li>\n<li>Distribute/share documents with the executional team and senior management; work with team leads to ensure alignment, accuracy and clarityInitiate projects and designate resource needs across the team; implement and manage ongoing partnership needs</li>\n<li>Maintain healthy dialogue with the partners and positive relationships; building confidence among partners, gaining their trust in your abilities</li>\n<li>Develop and implement innovative and new approaches (ie improve efficiencies, new ways to execute a program etc). </li>\n<li>Proactively ensure timelines and needs are communicated with creative, project managers /engineering, marketing and customer service where relevant</li>\n<li>Ensure briefs to teams are efficient and concise, to drive the best quality outcome for the work</li>\n<li>Provide feedback, data, reports to partners where reporting is required. Monthly reporting on KPI’s within channel partners</li>\n<li>Analyze metrics to ensure goals are met; with insight into what worked / what didn’t work </li>\n</ul>\n\n<p>In addition, you will also work with the Skive it® executive team on: </p>\n\n<p>Strategy </p>\n\n<ul>\n<li>Work with Skive it® CEO on setting up new channel partners, pitching company services and case studies to them and overseeing on-boarding processes.</li>\n<li>Identifying and reaching out to new potential channel partners, thinking creatively on potential partners.</li>\n<li>Stay current with latest developments in startup and corporate ecosystems and competitor activities</li>\n</ul>\n\n<p>Sales </p>\n\n<ul>\n<li>Developing opportunities and qualifying these into sales</li>\n<li>Working closely with Skive it® CEO on converting partnerships into sales</li>\n<li>Working to sales and revenue targets as set by the Skive it® CEO</li>\n<li>Coordinate with partners to create and execute business plans to meet sales goals e.g. running a specific campaign<br></li>\n<li>Analyze market trends and accordingly develop sales plans to increase brand awareness</li>\n</ul>\n\n<p>Marketing </p>\n\n<ul>\n<li>Attending industry events and driving partnerships with them to create speaking opportunities for yourself and their wider team</li>\n<li>Organizing and supporting events with partners to drive lead generation</li>\n</ul>\n\n<p>Operations </p>\n\n<ul>\n<li>Maintaining relationships with channel partners</li>\n<li>Implementing channel marketing plans</li>\n<li>Deliver customer presentations and attend sales meetings and partner conferences</li>\n<li>Assist in partner marketing activities such as trade shows, campaigns investor evenings and other promotional activities</li>\n</ul>\n\n<p>Minimum Qualifications </p>\n\n<ul>\n<li>Action oriented. Ability to multitask and juggle multiple partners and projects, will follow up on deadlines, flagging questions + issues, and ensuring deadlines are met.</li>\n<li>Strong verbal and written communications skills in English including strong presentation skills and the ability to articulate complex concepts to cross functional audiences.</li>\n<li>Extremely strong attention to detail. (written and verbal)</li>\n<li>Have excellent interpersonal skills and an ability to build strong relationships with partners.</li>\n<li>Be driven, highly motivated and passionate about sales.</li>\n<li>Understand lifecycles of a technology start-up.</li>\n<li>1+ years of product management, business development, product marketing and/or program management experience. </li>\n<li>Bachelors degree. </li>\n</ul>\n\n<p>Preferred Qualifications  </p>\n\n<ul>\n<li>MBA or Graduate degree</li>\n<li>Have a black book of contacts within the government, technology, aerospace, venture capital and/or healthcare industry<br></li>\n<li>B2B experience in government, technology, aerospace, venture capital, finance, healthcare and/or automotive industry</li>\n</ul>\n\n<p>Benefits </p>\n\n<ul>\n<li>An early spot at a fast-growing company that is changing the future of AI and autonomous machines. </li>\n<li>Opportunity to work in a product focused environment to create the worlds first machines that can feel. </li>\n<li>A huge level up in your experience. We’ll make sure you see a lot of growth in your skill set that helps you to accelerates your career.<br></li>\n<li>Being part of a small startup team, an opportunity to work across multiple parts of the value chain in an industry starting with Aerospace, autonomous cars and healthcare. </li>\n<li>Opportunity to work with and connect with Skive it® founders, executive team and advisory board that are industry visionaries and though leaders. </li>\n<li>Compensation, benefits, equity, and salary that are above industry average once the current funding round close. Compensation mentioned on this post are future estimates.</li>\n<li>Currently, 100% remote work that will ensure that you can maintain work-life balance even when working long hours (Yes, we do believe in ‘996’ work culture)</li>\n<li>Participate in annual team retreat. Once a year the entire Skive it® team gets together at an inspiring location to meet, work and play hard.</li>\n<li> Unlimited Vacation. </li>\n</ul>\n\n<p>We are focused on building a diverse and inclusive workforce. If you’re excited about this role, but do not meet 100% of the qualifications listed above, we encourage you to apply.</p>\n\n<p>We thank all applicants for their interest. </p>\n\n<p>Culture<br>\nSkive it® is getting humanity back into AI, making machines more humans and hoping to make humans less like machines. We like people who are crazy enough to think differently; the round pegs in the square holes... the ones who see things differently. Who consider themselves as being super cool and don&#39;t mind been seen as the crazy ones. A passion to create innovative products is an absolute must. </p>\n\n<p>&quot;The only way to do great work is to love what you do&quot; — Steve Jobs </p>\n\n<p>Work culture include: </p>\n\n<ul>\n<li>It is OK to be 25% wrong and take risk. Learn by failing 1 out of 4 times [only]. </li>\n<li>Aim for perfection - All or Nothing</li>\n<li>Chase 10X and not 10%</li>\n<li>Just do it - As one of our founder who worked at MIT Media Labs says “Deploy!”. Write instead of just talk, build, prototype and deploy instead of just write. </li>\n<li>Win as a team </li>\n<li>Extreme ownership </li>\n</ul>\n\n<p>Skive it® expects employees to be honest, trustworthy, and operate with integrity. Discrimination and all unlawful harassment (including sexual harassment) in employment is not tolerated. We encourage success based on our individual merits and abilities, and all decisions regarding recruitment, hiring, promotion, compensation, employee development decisions such as training, and all other terms and conditions of employment, will be made without regard to race, nationality, national origin, citizenship status, employment status, ethnicity, ethnic origin, color, creed, religion, belief, age, marital status, pregnancy, gender, gender identity, sexual preference, lifestyle, social class, military status, disability, physical features, or any other protected status. We oppose all forms of unlawful or unfair discrimination. Skive it® is an equal opportunity employer.</p>\n",
      "position": "full-time",
      "experience": 1,
      "visaSponsorship": false,
      "locations": [
        "London"
      ],
      "remote": false,
      "remoteLocations": [],
      "skills": [
        "Business Development",
        "Operations",
        "Business Strategy",
        "Sales",
        "Engineering"
      ],
      "payment": {
        "salary": "$100k – $160k"
      },
      "recruiter": {
        "title": null,
        "role": "Investor",
        "url": "https://angel.co/u/aditya-mohan",
        "name": "Aditya Mohan",
        "avatar": "https://photos.angel.co/users/178357-medium_jpg?1573113168"
      },
      "refs": {
        "angelListId": "702399",
        "angelListUrl": "https://angel.co/company/skive-it/jobs/702399-"
      }
    },
    {
      "role": "Sales",
      "title": "Business Development Associate (San Francisco)",
      "description": "It takes two to tango. Skive it® is getting humanity back into AI, making machines more humans and hoping to make humans less like machines.  We can’t do it alone and are partnering with government, technology, aerospace, venture capital, finance, healthcare and automotive industry leaders world wide. Skive it® is a technology innovator by heart and will prefer candidates with engineering background but it is not an absolute must as we are seeking to build a world class cross-functional team ranging from designers, creative writers, executives, engineers, sales, marketing and product staff. For example, someone with experience in healthcare, fashion or retail is highly encouraged to apply if they can show passion and/or know-how in Skive it® technology areas. \n  \nThe ideal candidate will have market development and business development experience in technology, be a self-starter, and be willing operate both tactically and strategically. As key team member in this fast growing, exciting space of AI you will have the opportunity to help lead the early market development efforts for new product and services, establish wins with customers, create new eco-system partnerships, and then as the business starts to formulate, help drive the growth and shape the future of a product and service category that will have a significant impact on our customers’ business. \n\nThe candidate will assume some/all the responsibilities below based on experience, potential and company strategic direction.  \n .\n* Manage ongoing day-to-day partnerships. Develop positive working relationships with partners to build business\n* Develop and communicate parameters and scope of partnership (opportunities, goals, ideas, asset needs, resource needs, deadlines)\n* Develop Skive it® assets and liaise with partner to progress relationship (decks, images, stats, MNDAs)\n* Lead and manage partner calls; write clear, organized recaps of meetings, next steps\n* Distribute/share documents with the executional team and senior management; work with team leads to ensure alignment, accuracy and clarityInitiate projects and designate resource needs across the team; implement and manage ongoing partnership needs\n* Maintain healthy dialogue with the partners and positive relationships; building confidence among partners, gaining their trust in your abilities\n* Develop and implement innovative and new approaches (ie improve efficiencies, new ways to execute a program etc). \n* Proactively ensure timelines and needs are communicated with creative, project managers /engineering, marketing and customer service where relevant\n* Ensure briefs to teams are efficient and concise, to drive the best quality outcome for the work\n* Provide feedback, data, reports to partners where reporting is required. Monthly reporting on KPI’s within channel partners\n* Analyze metrics to ensure goals are met; with insight into what worked / what didn’t work \n\nIn addition, you will also work with the Skive it® executive team on: \n\nStrategy \n* Work with Skive it® CEO on setting up new channel partners, pitching company services and case studies to them and overseeing on-boarding processes.\n* Identifying and reaching out to new potential channel partners, thinking creatively on potential partners.\n* Stay current with latest developments in startup and corporate ecosystems and competitor activities\n\nSales \n* Developing opportunities and qualifying these into sales\n* Working closely with Skive it® CEO on converting partnerships into sales\n* Working to sales and revenue targets as set by the Skive it® CEO\n* Coordinate with partners to create and execute business plans to meet sales goals e.g. running a specific campaign  \n* Analyze market trends and accordingly develop sales plans to increase brand awareness\n\nMarketing \n* Attending industry events and driving partnerships with them to create speaking opportunities for yourself and their wider team\n* Organizing and supporting events with partners to drive lead generation\n\nOperations \n* Maintaining relationships with channel partners\n* Implementing channel marketing plans\n* Deliver customer presentations and attend sales meetings and partner conferences\n* Assist in partner marketing activities such as trade shows, campaigns investor evenings and other promotional activities\n\nMinimum Qualifications \n* Action oriented. Ability to multitask and juggle multiple partners and projects, will follow up on deadlines, flagging questions + issues, and ensuring deadlines are met.\n* Strong verbal and written communications skills in English including strong presentation skills and the ability to articulate complex concepts to cross functional audiences.\n* Extremely strong attention to detail. (written and verbal)\n* Have excellent interpersonal skills and an ability to build strong relationships with partners.\n* Be driven, highly motivated and passionate about sales.\n* Understand lifecycles of a technology start-up.\n* 1+ years of product management, business development, product marketing and/or program management experience. \n* Bachelors degree. \n\nPreferred Qualifications  \n* MBA or Graduate degree\n* Have a black book of contacts within the government, technology, aerospace, venture capital and/or healthcare industry   \n* B2B experience in government, technology, aerospace, venture capital, finance, healthcare and/or automotive industry\n\nBenefits \n* An early spot at a fast-growing company that is changing the future of AI and autonomous machines. \n* Opportunity to work in a product focused environment to create the worlds first machines that can feel. \n* A huge level up in your experience. We’ll make sure you see a lot of growth in your skill set that helps you to accelerates your career.  \n* Being part of a small startup team, an opportunity to work across multiple parts of the value chain in an industry starting with Aerospace, autonomous cars and healthcare. \n* Opportunity to work with and connect with Skive it® founders, executive team and advisory board that are industry visionaries and though leaders. \n* Compensation, benefits, equity, and salary that are above industry average once the current funding round close. Compensation mentioned on this post are future estimates.\n* Currently, 100% remote work that will ensure that you can maintain work-life balance even when working long hours (Yes, we do believe in ‘996’ work culture)\n* Participate in annual team retreat. Once a year the entire Skive it® team gets together at an inspiring location to meet, work and play hard.\n*  Unlimited Vacation. \n\nWe are focused on building a diverse and inclusive workforce. If you’re excited about this role, but do not meet 100% of the qualifications listed above, we encourage you to apply.\n\nWe thank all applicants for their interest. \n\nCulture\nSkive it® is getting humanity back into AI, making machines more humans and hoping to make humans less like machines. We like people who are crazy enough to think differently; the round pegs in the square holes... the ones who see things differently. Who consider themselves as being super cool and don't mind been seen as the crazy ones. A passion to create innovative products is an absolute must. \n\n\"The only way to do great work is to love what you do\" — Steve Jobs \n\nWork culture include: \n* It is OK to be 25% wrong and take risk. Learn by failing 1 out of 4 times [only]. \n* Aim for perfection - All or Nothing\n* Chase 10X and not 10%\n* Just do it - As one of our founder who worked at MIT Media Labs says “Deploy!”. Write instead of just talk, build, prototype and deploy instead of just write. \n* Win as a team \n* Extreme ownership \n\nSkive it® expects employees to be honest, trustworthy, and operate with integrity. Discrimination and all unlawful harassment (including sexual harassment) in employment is not tolerated. We encourage success based on our individual merits and abilities, and all decisions regarding recruitment, hiring, promotion, compensation, employee development decisions such as training, and all other terms and conditions of employment, will be made without regard to race, nationality, national origin, citizenship status, employment status, ethnicity, ethnic origin, color, creed, religion, belief, age, marital status, pregnancy, gender, gender identity, sexual preference, lifestyle, social class, military status, disability, physical features, or any other protected status. We oppose all forms of unlawful or unfair discrimination. Skive it® is an equal opportunity employer.",
      "descriptionHtml": "<p>It takes two to tango. Skive it® is getting humanity back into AI, making machines more humans and hoping to make humans less like machines.  We can’t do it alone and are partnering with government, technology, aerospace, venture capital, finance, healthcare and automotive industry leaders world wide. Skive it® is a technology innovator by heart and will prefer candidates with engineering background but it is not an absolute must as we are seeking to build a world class cross-functional team ranging from designers, creative writers, executives, engineers, sales, marketing and product staff. For example, someone with experience in healthcare, fashion or retail is highly encouraged to apply if they can show passion and/or know-how in Skive it® technology areas. </p>\n\n<p>The ideal candidate will have market development and business development experience in technology, be a self-starter, and be willing operate both tactically and strategically. As key team member in this fast growing, exciting space of AI you will have the opportunity to help lead the early market development efforts for new product and services, establish wins with customers, create new eco-system partnerships, and then as the business starts to formulate, help drive the growth and shape the future of a product and service category that will have a significant impact on our customers’ business. </p>\n\n<p>The candidate will assume some/all the responsibilities below based on experience, potential and company strategic direction.<br><br>\n .</p>\n\n<ul>\n<li>Manage ongoing day-to-day partnerships. Develop positive working relationships with partners to build business</li>\n<li>Develop and communicate parameters and scope of partnership (opportunities, goals, ideas, asset needs, resource needs, deadlines)</li>\n<li>Develop Skive it® assets and liaise with partner to progress relationship (decks, images, stats, MNDAs)</li>\n<li>Lead and manage partner calls; write clear, organized recaps of meetings, next steps</li>\n<li>Distribute/share documents with the executional team and senior management; work with team leads to ensure alignment, accuracy and clarityInitiate projects and designate resource needs across the team; implement and manage ongoing partnership needs</li>\n<li>Maintain healthy dialogue with the partners and positive relationships; building confidence among partners, gaining their trust in your abilities</li>\n<li>Develop and implement innovative and new approaches (ie improve efficiencies, new ways to execute a program etc). </li>\n<li>Proactively ensure timelines and needs are communicated with creative, project managers /engineering, marketing and customer service where relevant</li>\n<li>Ensure briefs to teams are efficient and concise, to drive the best quality outcome for the work</li>\n<li>Provide feedback, data, reports to partners where reporting is required. Monthly reporting on KPI’s within channel partners</li>\n<li>Analyze metrics to ensure goals are met; with insight into what worked / what didn’t work </li>\n</ul>\n\n<p>In addition, you will also work with the Skive it® executive team on: </p>\n\n<p>Strategy </p>\n\n<ul>\n<li>Work with Skive it® CEO on setting up new channel partners, pitching company services and case studies to them and overseeing on-boarding processes.</li>\n<li>Identifying and reaching out to new potential channel partners, thinking creatively on potential partners.</li>\n<li>Stay current with latest developments in startup and corporate ecosystems and competitor activities</li>\n</ul>\n\n<p>Sales </p>\n\n<ul>\n<li>Developing opportunities and qualifying these into sales</li>\n<li>Working closely with Skive it® CEO on converting partnerships into sales</li>\n<li>Working to sales and revenue targets as set by the Skive it® CEO</li>\n<li>Coordinate with partners to create and execute business plans to meet sales goals e.g. running a specific campaign<br></li>\n<li>Analyze market trends and accordingly develop sales plans to increase brand awareness</li>\n</ul>\n\n<p>Marketing </p>\n\n<ul>\n<li>Attending industry events and driving partnerships with them to create speaking opportunities for yourself and their wider team</li>\n<li>Organizing and supporting events with partners to drive lead generation</li>\n</ul>\n\n<p>Operations </p>\n\n<ul>\n<li>Maintaining relationships with channel partners</li>\n<li>Implementing channel marketing plans</li>\n<li>Deliver customer presentations and attend sales meetings and partner conferences</li>\n<li>Assist in partner marketing activities such as trade shows, campaigns investor evenings and other promotional activities</li>\n</ul>\n\n<p>Minimum Qualifications </p>\n\n<ul>\n<li>Action oriented. Ability to multitask and juggle multiple partners and projects, will follow up on deadlines, flagging questions + issues, and ensuring deadlines are met.</li>\n<li>Strong verbal and written communications skills in English including strong presentation skills and the ability to articulate complex concepts to cross functional audiences.</li>\n<li>Extremely strong attention to detail. (written and verbal)</li>\n<li>Have excellent interpersonal skills and an ability to build strong relationships with partners.</li>\n<li>Be driven, highly motivated and passionate about sales.</li>\n<li>Understand lifecycles of a technology start-up.</li>\n<li>1+ years of product management, business development, product marketing and/or program management experience. </li>\n<li>Bachelors degree. </li>\n</ul>\n\n<p>Preferred Qualifications  </p>\n\n<ul>\n<li>MBA or Graduate degree</li>\n<li>Have a black book of contacts within the government, technology, aerospace, venture capital and/or healthcare industry<br></li>\n<li>B2B experience in government, technology, aerospace, venture capital, finance, healthcare and/or automotive industry</li>\n</ul>\n\n<p>Benefits </p>\n\n<ul>\n<li>An early spot at a fast-growing company that is changing the future of AI and autonomous machines. </li>\n<li>Opportunity to work in a product focused environment to create the worlds first machines that can feel. </li>\n<li>A huge level up in your experience. We’ll make sure you see a lot of growth in your skill set that helps you to accelerates your career.<br></li>\n<li>Being part of a small startup team, an opportunity to work across multiple parts of the value chain in an industry starting with Aerospace, autonomous cars and healthcare. </li>\n<li>Opportunity to work with and connect with Skive it® founders, executive team and advisory board that are industry visionaries and though leaders. </li>\n<li>Compensation, benefits, equity, and salary that are above industry average once the current funding round close. Compensation mentioned on this post are future estimates.</li>\n<li>Currently, 100% remote work that will ensure that you can maintain work-life balance even when working long hours (Yes, we do believe in ‘996’ work culture)</li>\n<li>Participate in annual team retreat. Once a year the entire Skive it® team gets together at an inspiring location to meet, work and play hard.</li>\n<li> Unlimited Vacation. </li>\n</ul>\n\n<p>We are focused on building a diverse and inclusive workforce. If you’re excited about this role, but do not meet 100% of the qualifications listed above, we encourage you to apply.</p>\n\n<p>We thank all applicants for their interest. </p>\n\n<p>Culture<br>\nSkive it® is getting humanity back into AI, making machines more humans and hoping to make humans less like machines. We like people who are crazy enough to think differently; the round pegs in the square holes... the ones who see things differently. Who consider themselves as being super cool and don&#39;t mind been seen as the crazy ones. A passion to create innovative products is an absolute must. </p>\n\n<p>&quot;The only way to do great work is to love what you do&quot; — Steve Jobs </p>\n\n<p>Work culture include: </p>\n\n<ul>\n<li>It is OK to be 25% wrong and take risk. Learn by failing 1 out of 4 times [only]. </li>\n<li>Aim for perfection - All or Nothing</li>\n<li>Chase 10X and not 10%</li>\n<li>Just do it - As one of our founder who worked at MIT Media Labs says “Deploy!”. Write instead of just talk, build, prototype and deploy instead of just write. </li>\n<li>Win as a team </li>\n<li>Extreme ownership </li>\n</ul>\n\n<p>Skive it® expects employees to be honest, trustworthy, and operate with integrity. Discrimination and all unlawful harassment (including sexual harassment) in employment is not tolerated. We encourage success based on our individual merits and abilities, and all decisions regarding recruitment, hiring, promotion, compensation, employee development decisions such as training, and all other terms and conditions of employment, will be made without regard to race, nationality, national origin, citizenship status, employment status, ethnicity, ethnic origin, color, creed, religion, belief, age, marital status, pregnancy, gender, gender identity, sexual preference, lifestyle, social class, military status, disability, physical features, or any other protected status. We oppose all forms of unlawful or unfair discrimination. Skive it® is an equal opportunity employer.</p>\n",
      "position": "full-time",
      "experience": 1,
      "visaSponsorship": false,
      "locations": [
        "San Francisco"
      ],
      "remote": true,
      "remoteLocations": [
        "San Francisco Bay Area"
      ],
      "skills": [
        "Business Development",
        "Operations",
        "Business Strategy",
        "Sales",
        "Engineering"
      ],
      "payment": {
        "salary": "$100k – $160k"
      },
      "recruiter": {
        "title": null,
        "role": "Investor",
        "url": "https://angel.co/u/aditya-mohan",
        "name": "Aditya Mohan",
        "avatar": "https://photos.angel.co/users/178357-medium_jpg?1573113168"
      },
      "refs": {
        "angelListId": "702395",
        "angelListUrl": "https://angel.co/company/skive-it/jobs/702395-"
      }
    },
    {
      "role": "Sales",
      "title": "Business Development Intern",
      "description": "U: The crazy enough to think differently; the round pegs in the square holes... the ones who see things differently. Who consider themselves as being super cool and don't mind been seen as the crazy ones? If yes, we want you!\n\nUS: \nSkive it® is a fun, upcoming hot San Francisco, California based startup with additional registered office in UK, founded by two Brown University computer science grads. We are building a specialized evolving chip that will be the heart of the robot as opposed to the brain with the goal to build robots that can feel. We believe the aging world will not need super human(oid)s but robots that are more human and Skive it’s autonomous Deep Learning technology will be the center piece of this. We call this technology Robometrics®. It will form the morality layer for any robotics system that interacts with humans  on top of their AI enabled brain to bring humanity back into AI.\n \nOur team includes experienced executives with computer science Ph.D. and masters from Brown University with professional experience from Oracle, IBM, Intel, MIT Media Labs and HP. We have a culture that believe in working hard but intelligently.",
      "descriptionHtml": "<p>U: The crazy enough to think differently; the round pegs in the square holes... the ones who see things differently. Who consider themselves as being super cool and don&#39;t mind been seen as the crazy ones? If yes, we want you!</p>\n\n<p>US: <br>\nSkive it® is a fun, upcoming hot San Francisco, California based startup with additional registered office in UK, founded by two Brown University computer science grads. We are building a specialized evolving chip that will be the heart of the robot as opposed to the brain with the goal to build robots that can feel. We believe the aging world will not need super human(oid)s but robots that are more human and Skive it’s autonomous Deep Learning technology will be the center piece of this. We call this technology Robometrics®. It will form the morality layer for any robotics system that interacts with humans  on top of their AI enabled brain to bring humanity back into AI.</p>\n\n<p>Our team includes experienced executives with computer science Ph.D. and masters from Brown University with professional experience from Oracle, IBM, Intel, MIT Media Labs and HP. We have a culture that believe in working hard but intelligently.</p>\n",
      "position": "internship",
      "experience": null,
      "visaSponsorship": false,
      "locations": [
        "London"
      ],
      "remote": false,
      "remoteLocations": [],
      "skills": [],
      "payment": {
        "salary": "No salary"
      },
      "recruiter": {
        "title": null,
        "role": "Investor",
        "url": "https://angel.co/u/aditya-mohan",
        "name": "Aditya Mohan",
        "avatar": "https://photos.angel.co/users/178357-medium_jpg?1573113168"
      },
      "refs": {
        "angelListId": "184775",
        "angelListUrl": "https://angel.co/company/skive-it/jobs/184775-"
      }
    },
    {
      "role": "Other",
      "title": "Legal Intern",
      "description": "U: The crazy enough to think differently; the round pegs in the square holes... the ones who see things differently. Who consider themselves as being super cool and don't mind been seen as the crazy ones? If yes, we want you!\n\nUS: \nSkive it® is a fun, upcoming hot San Francisco, California based startup with additional registered office in UK, founded by two Brown University computer science grads. We are building a specialized evolving chip that will be the heart of the robot as opposed to the brain with the goal to build robots that can feel. We believe the aging world will not need super human(oid)s but robots that are more human and Skive it’s autonomous Deep Learning technology will be the center piece of this. We call this technology Robometrics®. It will form the morality layer for any robotics system that interacts with humans  on top of their AI enabled brain to bring humanity back into AI.\n \nOur team includes experienced executives with computer science Ph.D. and masters from Brown University with professional experience from Oracle, IBM, Intel, MIT Media Labs and HP. We have a culture that believe in working hard but intelligently.",
      "descriptionHtml": "<p>U: The crazy enough to think differently; the round pegs in the square holes... the ones who see things differently. Who consider themselves as being super cool and don&#39;t mind been seen as the crazy ones? If yes, we want you!</p>\n\n<p>US: <br>\nSkive it® is a fun, upcoming hot San Francisco, California based startup with additional registered office in UK, founded by two Brown University computer science grads. We are building a specialized evolving chip that will be the heart of the robot as opposed to the brain with the goal to build robots that can feel. We believe the aging world will not need super human(oid)s but robots that are more human and Skive it’s autonomous Deep Learning technology will be the center piece of this. We call this technology Robometrics®. It will form the morality layer for any robotics system that interacts with humans  on top of their AI enabled brain to bring humanity back into AI.</p>\n\n<p>Our team includes experienced executives with computer science Ph.D. and masters from Brown University with professional experience from Oracle, IBM, Intel, MIT Media Labs and HP. We have a culture that believe in working hard but intelligently.</p>\n",
      "position": "internship",
      "experience": 1,
      "visaSponsorship": false,
      "locations": [
        "San Francisco"
      ],
      "remote": false,
      "remoteLocations": [],
      "skills": [
        "Corporate Law",
        "Immigration Law"
      ],
      "payment": {
        "salary": "No salary"
      },
      "recruiter": {
        "title": null,
        "role": "Investor",
        "url": "https://angel.co/u/aditya-mohan",
        "name": "Aditya Mohan",
        "avatar": "https://photos.angel.co/users/178357-medium_jpg?1573113168"
      },
      "refs": {
        "angelListId": "332620",
        "angelListUrl": "https://angel.co/company/skive-it/jobs/332620-"
      }
    },
    {
      "role": "Marketing",
      "title": "Marketing Intern",
      "description": "Skive it® is getting humanity back into AI, making machines more humans and hoping to make humans less like machines.  We are an Autonomous AI chip company enabling machines to feel and looking for marketing super stars who are either recent graduates from universities or are enrolled in a university and looking for par-time position during school year or full-time during summer. \r\n  \r\nThe ideal candidate will have some track record of working on marketing projects and willingness to think out of the box.\r\n\r\nThe candidate will assume some/all the responsibilities below based on experience, potential and company strategic direction.  \r\n \r\n* Direct the creation of digital content. (e.g. website, content, sales funnel, landing page, ads)\r\n* Manage end-to-end digital projects.\r\n* Produce reports for management. (e.g. dashboards)\r\n* Help with hiring other marketing staff in various geographies - US, UK, China, Japan. \r\n* Collaborate with internal teams. \r\n* Collaborate with product marketers, sales professionals, external influencers and industry experts to produce relevant content that establishes Skive it® as a thought leader in AI technology space.\r\n* Partner closely with product management and marketing teams to understand the product strategy and fit, define use cases, understand competitive offerings and articulate value propositions.\r\n* Work directly with counterparts at the partner companies to further drive awareness, pipeline and awareness.\r\n* Manage the creation of a wide variety of high-impact marketing collateral and compelling sales content including web pages, eBooks, presentations, product information, demo videos and more. \r\n\r\nIn addition, you will also work with the Skive it® executive team on: \r\n\r\nStrategy \r\n\r\n* Work with Skive it® CEO on  product road map and company vision. \r\n* Stay current with latest developments in AI/Deep Learning from startups, corporate ecosystems and competitors. \r\n\r\nMinimum Qualifications  \r\n\r\n* Enrolled in bachelors, masters or PhD in ANY field. Recent graduates are welcome to apply. \r\n* Interest in pursuing a career in marketing, business development or advertising. \r\n* Know more than one language. Skive it® is global with staff in China, US, UK and India. \r\n* Be a rockstar in something. \r\n* Team player. \r\n* Extrovert or would-be extrovert.\r\n* Social, who like talking to strangers.  \r\n\r\nPreferred Qualifications   \r\n\r\n* You are a social media influencer with substantial following. For example Instagram influencer. \r\n* Experience from prior internships. For example, corporations or startups in the area of AI. \r\n* Publications/blog/articles in AI or related areas. \r\n* Basic knowledge about AI.\r\n\r\nBenefits \r\n\r\n* An early spot at a fast-growing company that is changing the future of AI and autonomous machines. \r\n* Opportunity to work in a product focused environment to create the worlds first machines that can feel. \r\n* A huge level up in your experience. We’ll make sure you see a lot of growth in your skill set that helps you to accelerates your career.  \r\n* Being part of a small startup team, an opportunity to work across multiple parts of the value chain in an industry starting with Aerospace, autonomous cars and healthcare. \r\n* Opportunity to work with and connect with Skive it® founders, executive team and advisory board that are industry visionaries and though leaders. \r\n* Compensation, benefits, equity, and salary that are above industry average once the current funding round close. Compensation mentioned on this post are future estimates.\r\n* Currently, 100% remote work that will ensure that you can maintain work-life balance even when working long hours (Yes, we do believe in ‘996’ work culture)\r\n* Participate in annual team retreat. Once a year the entire Skive it® team gets together at an inspiring location to meet, work and play hard.\r\n* Unlimited Vacation. \r\n\r\nWe are focused on building a diverse and inclusive workforce. If you’re excited about this role, but do not meet 100% of the qualifications listed above, we encourage you to apply.\r\n\r\nWe thank all applicants for their interest.\r\n\r\nCulture \r\n\r\nSkive it® is getting humanity back into AI, making machines more humans and hoping to make humans less like machines.  We like people who are crazy enough to think differently; the round pegs in the square holes... the ones who see things differently. Who consider themselves as being super cool and don't mind been seen as the crazy ones.  A passion to create innovative products is an absolute must. \r\n\r\n\"The only way to do great work is to love what you do\" — Steve Jobs \r\n\r\nWork culture include: \r\n* It is OK to be 25% wrong and take risk. Learn by failing 1 out of 4 times [only]. \r\n* Aim for perfection - All or Nothing\r\n* Chase 10X and not 10%\r\n* Just do it - As one of our founder who worked at MIT Media Labs says “Deploy!”. Write instead of just talk, build, prototype and deploy instead of just write. \r\n* Win as a team \r\n* Extreme ownership \r\n\r\nSkive it® expects employees to be honest, trustworthy, and operate with integrity. Discrimination and all unlawful harassment (including sexual harassment) in employment is not tolerated. We encourage success based on our individual merits and abilities, and all decisions regarding recruitment, hiring, promotion, compensation, employee development decisions such as training, and all other terms and conditions of employment, will be made without regard to race, nationality, national origin, citizenship status, employment status, ethnicity, ethnic origin, color, creed, religion, belief, age, marital status, pregnancy, gender, gender identity, sexual preference, lifestyle, social class, military status, disability, physical features, or any other protected status. We oppose all forms of unlawful or unfair discrimination. Skive it® is an equal opportunity employer.",
      "descriptionHtml": "<p>Skive it® is getting humanity back into AI, making machines more humans and hoping to make humans less like machines.  We are an Autonomous AI chip company enabling machines to feel and looking for marketing super stars who are either recent graduates from universities or are enrolled in a university and looking for par-time position during school year or full-time during summer. </p>\n\n<p>The ideal candidate will have some track record of working on marketing projects and willingness to think out of the box.</p>\n\n<p>The candidate will assume some/all the responsibilities below based on experience, potential and company strategic direction.  </p>\n\n<ul>\n<li>Direct the creation of digital content. (e.g. website, content, sales funnel, landing page, ads)</li>\n<li>Manage end-to-end digital projects.</li>\n<li>Produce reports for management. (e.g. dashboards)</li>\n<li>Help with hiring other marketing staff in various geographies - US, UK, China, Japan. </li>\n<li>Collaborate with internal teams. </li>\n<li>Collaborate with product marketers, sales professionals, external influencers and industry experts to produce relevant content that establishes Skive it® as a thought leader in AI technology space.</li>\n<li>Partner closely with product management and marketing teams to understand the product strategy and fit, define use cases, understand competitive offerings and articulate value propositions.</li>\n<li>Work directly with counterparts at the partner companies to further drive awareness, pipeline and awareness.</li>\n<li>Manage the creation of a wide variety of high-impact marketing collateral and compelling sales content including web pages, eBooks, presentations, product information, demo videos and more. </li>\n</ul>\n\n<p>In addition, you will also work with the Skive it® executive team on: </p>\n\n<p>Strategy </p>\n\n<ul>\n<li>Work with Skive it® CEO on  product road map and company vision. </li>\n<li>Stay current with latest developments in AI/Deep Learning from startups, corporate ecosystems and competitors. </li>\n</ul>\n\n<p>Minimum Qualifications  </p>\n\n<ul>\n<li>Enrolled in bachelors, masters or PhD in ANY field. Recent graduates are welcome to apply. </li>\n<li>Interest in pursuing a career in marketing, business development or advertising. </li>\n<li>Know more than one language. Skive it® is global with staff in China, US, UK and India. </li>\n<li>Be a rockstar in something. </li>\n<li>Team player. </li>\n<li>Extrovert or would-be extrovert.</li>\n<li>Social, who like talking to strangers.<br></li>\n</ul>\n\n<p>Preferred Qualifications   </p>\n\n<ul>\n<li>You are a social media influencer with substantial following. For example Instagram influencer. </li>\n<li>Experience from prior internships. For example, corporations or startups in the area of AI. </li>\n<li>Publications/blog/articles in AI or related areas. </li>\n<li>Basic knowledge about AI.</li>\n</ul>\n\n<p>Benefits </p>\n\n<ul>\n<li>An early spot at a fast-growing company that is changing the future of AI and autonomous machines. </li>\n<li>Opportunity to work in a product focused environment to create the worlds first machines that can feel. </li>\n<li>A huge level up in your experience. We’ll make sure you see a lot of growth in your skill set that helps you to accelerates your career.<br></li>\n<li>Being part of a small startup team, an opportunity to work across multiple parts of the value chain in an industry starting with Aerospace, autonomous cars and healthcare. </li>\n<li>Opportunity to work with and connect with Skive it® founders, executive team and advisory board that are industry visionaries and though leaders. </li>\n<li>Compensation, benefits, equity, and salary that are above industry average once the current funding round close. Compensation mentioned on this post are future estimates.</li>\n<li>Currently, 100% remote work that will ensure that you can maintain work-life balance even when working long hours (Yes, we do believe in ‘996’ work culture)</li>\n<li>Participate in annual team retreat. Once a year the entire Skive it® team gets together at an inspiring location to meet, work and play hard.</li>\n<li>Unlimited Vacation. </li>\n</ul>\n\n<p>We are focused on building a diverse and inclusive workforce. If you’re excited about this role, but do not meet 100% of the qualifications listed above, we encourage you to apply.</p>\n\n<p>We thank all applicants for their interest.</p>\n\n<p>Culture </p>\n\n<p>Skive it® is getting humanity back into AI, making machines more humans and hoping to make humans less like machines.  We like people who are crazy enough to think differently; the round pegs in the square holes... the ones who see things differently. Who consider themselves as being super cool and don&#39;t mind been seen as the crazy ones.  A passion to create innovative products is an absolute must. </p>\n\n<p>&quot;The only way to do great work is to love what you do&quot; — Steve Jobs </p>\n\n<p>Work culture include: </p>\n\n<ul>\n<li>It is OK to be 25% wrong and take risk. Learn by failing 1 out of 4 times [only]. </li>\n<li>Aim for perfection - All or Nothing</li>\n<li>Chase 10X and not 10%</li>\n<li>Just do it - As one of our founder who worked at MIT Media Labs says “Deploy!”. Write instead of just talk, build, prototype and deploy instead of just write. </li>\n<li>Win as a team </li>\n<li>Extreme ownership </li>\n</ul>\n\n<p>Skive it® expects employees to be honest, trustworthy, and operate with integrity. Discrimination and all unlawful harassment (including sexual harassment) in employment is not tolerated. We encourage success based on our individual merits and abilities, and all decisions regarding recruitment, hiring, promotion, compensation, employee development decisions such as training, and all other terms and conditions of employment, will be made without regard to race, nationality, national origin, citizenship status, employment status, ethnicity, ethnic origin, color, creed, religion, belief, age, marital status, pregnancy, gender, gender identity, sexual preference, lifestyle, social class, military status, disability, physical features, or any other protected status. We oppose all forms of unlawful or unfair discrimination. Skive it® is an equal opportunity employer.</p>\n",
      "position": "internship",
      "experience": 0,
      "visaSponsorship": false,
      "locations": [
        "San Francisco",
        "London",
        "San Francisco Bay Area"
      ],
      "remote": true,
      "remoteLocations": [
        "North America",
        "United Kingdom"
      ],
      "skills": [
        "Product Marketing",
        "Sales",
        "Social Media Marketing",
        "Digital Marketing",
        "Content Creation"
      ],
      "payment": {
        "salary": "$75k – $120k",
        "equity": "0.0% – 0.1%"
      },
      "recruiter": {
        "title": null,
        "role": "Investor",
        "url": "https://angel.co/u/aditya-mohan",
        "name": "Aditya Mohan",
        "avatar": "https://photos.angel.co/users/178357-medium_jpg?1573113168"
      },
      "refs": {
        "angelListId": "811385",
        "angelListUrl": "https://angel.co/company/skive-it/jobs/811385-"
      }
    },
    {
      "role": "Software Engineer",
      "title": "Neuroscience Research Associate",
      "description": "Skive it® is getting humanity back into AI, making machines more humans and hoping to make humans less like machines.  We are an Autonomous AI chip company enabling machines to feel and looking for neuroscience researchers and scientist who can get out of their comfort zone and be willing to work at the intersection of Deep Learning and Neuroscience to help create the world's first machines that can feel. The founders themselves have research background from MIT Media Labs, IBM Research and Intel Research. A passion to create innovative products is an absolute must for the role. \n  \nThe ideal candidate will have some track record of publications in neuroscience and willingness to think out of the box to apply some of the lessons learned, research and algorithms from neuroscience to computer science.   \n\nThe candidate will assume some/all the responsibilities below based on experience, potential and company strategic direction.  \n\n* Neuroscience research in the area of human behavior, cognitive science and brain computation. \n* Work at the intersection of Neuroscience and Deep Learning \n* Collaborate with software and systems teams to apply research findings. \n* Develop deep learning and neuroscience related algorithms  \n* Experiment with new or early stage algorithms\n* Solidify existing algorithms working with real data\n* Maximize the quality of algorithmic results\n* Minimize inefficiencies and latency to maximize performance\n\nIn addition, you will also work with the Skive it® executive team on: \n\nStrategy \n* Work with Skive it® CEO on  product road map and company vision. \n* Stay current with latest developments in neuroscience and Deep Learning from startups, corporate ecosystems and competitors. \n\nMinimum Qualifications  \n* Enrolled in PhD program or have PhD in related field.\n* Research in the area of human behavior, brain science and/or neuroscience. \n* Basic knowledge about Artificial Intelligence preferred.\n* Experience writing specifications and converting them to actionable research deliverables.\n* Action oriented.   \n* Strong verbal and written communications skills in English including strong presentation skills and the ability to articulate complex concepts to cross functional audiences.\n* Extremely strong attention to detail. (written and verbal)\n* Be driven, highly motivated and passionate about neuroscience and related research areas.\n* 1+ years of neuroscience research experience. \n* Bachelors degree. \n\nPreferred Qualifications  \n* Experience from corporate research labs in neuroscience or AI. \n* Peer reviewed publications in neuroscience or related areas. \n\nBenefits \n* An early spot at a fast-growing company that is changing the future of AI and autonomous machines. \n* Opportunity to work in a product focused environment to create the worlds first machines that can feel. \n* A huge level up in your experience. We’ll make sure you see a lot of growth in your skill set that helps you to accelerates your career.  \n* Being part of a small startup team, an opportunity to work across multiple parts of the value chain in an industry starting with Aerospace, autonomous cars and healthcare. \n* Opportunity to work with and connect with Skive it® founders, executive team and advisory board that are industry visionaries and though leaders. \n* Compensation, benefits, equity, and salary that are above industry average once the current funding round close. Compensation mentioned on this post are future estimates.\n* Currently, 100% remote work that will ensure that you can maintain work-life balance even when working long hours (Yes, we do believe in ‘996’ work culture)\n* Participate in annual team retreat. Once a year the entire Skive it® team gets together at an inspiring location to meet, work and play hard.\n* Unlimited Vacation. \n\nWe are focused on building a diverse and inclusive workforce. If you’re excited about this role, but do not meet 100% of the qualifications listed above, we encourage you to apply.\n\nWe thank all applicants for their interest.",
      "descriptionHtml": "<p>Skive it® is getting humanity back into AI, making machines more humans and hoping to make humans less like machines.  We are an Autonomous AI chip company enabling machines to feel and looking for neuroscience researchers and scientist who can get out of their comfort zone and be willing to work at the intersection of Deep Learning and Neuroscience to help create the world&#39;s first machines that can feel. The founders themselves have research background from MIT Media Labs, IBM Research and Intel Research. A passion to create innovative products is an absolute must for the role. </p>\n\n<p>The ideal candidate will have some track record of publications in neuroscience and willingness to think out of the box to apply some of the lessons learned, research and algorithms from neuroscience to computer science.   </p>\n\n<p>The candidate will assume some/all the responsibilities below based on experience, potential and company strategic direction.  </p>\n\n<ul>\n<li>Neuroscience research in the area of human behavior, cognitive science and brain computation. </li>\n<li>Work at the intersection of Neuroscience and Deep Learning </li>\n<li>Collaborate with software and systems teams to apply research findings. </li>\n<li>Develop deep learning and neuroscience related algorithms<br></li>\n<li>Experiment with new or early stage algorithms</li>\n<li>Solidify existing algorithms working with real data</li>\n<li>Maximize the quality of algorithmic results</li>\n<li>Minimize inefficiencies and latency to maximize performance</li>\n</ul>\n\n<p>In addition, you will also work with the Skive it® executive team on: </p>\n\n<p>Strategy </p>\n\n<ul>\n<li>Work with Skive it® CEO on  product road map and company vision. </li>\n<li>Stay current with latest developments in neuroscience and Deep Learning from startups, corporate ecosystems and competitors. </li>\n</ul>\n\n<p>Minimum Qualifications  </p>\n\n<ul>\n<li>Enrolled in PhD program or have PhD in related field.</li>\n<li>Research in the area of human behavior, brain science and/or neuroscience. </li>\n<li>Basic knowledge about Artificial Intelligence preferred.</li>\n<li>Experience writing specifications and converting them to actionable research deliverables.</li>\n<li>Action oriented.<br></li>\n<li>Strong verbal and written communications skills in English including strong presentation skills and the ability to articulate complex concepts to cross functional audiences.</li>\n<li>Extremely strong attention to detail. (written and verbal)</li>\n<li>Be driven, highly motivated and passionate about neuroscience and related research areas.</li>\n<li>1+ years of neuroscience research experience. </li>\n<li>Bachelors degree. </li>\n</ul>\n\n<p>Preferred Qualifications  </p>\n\n<ul>\n<li>Experience from corporate research labs in neuroscience or AI. </li>\n<li>Peer reviewed publications in neuroscience or related areas. </li>\n</ul>\n\n<p>Benefits </p>\n\n<ul>\n<li>An early spot at a fast-growing company that is changing the future of AI and autonomous machines. </li>\n<li>Opportunity to work in a product focused environment to create the worlds first machines that can feel. </li>\n<li>A huge level up in your experience. We’ll make sure you see a lot of growth in your skill set that helps you to accelerates your career.<br></li>\n<li>Being part of a small startup team, an opportunity to work across multiple parts of the value chain in an industry starting with Aerospace, autonomous cars and healthcare. </li>\n<li>Opportunity to work with and connect with Skive it® founders, executive team and advisory board that are industry visionaries and though leaders. </li>\n<li>Compensation, benefits, equity, and salary that are above industry average once the current funding round close. Compensation mentioned on this post are future estimates.</li>\n<li>Currently, 100% remote work that will ensure that you can maintain work-life balance even when working long hours (Yes, we do believe in ‘996’ work culture)</li>\n<li>Participate in annual team retreat. Once a year the entire Skive it® team gets together at an inspiring location to meet, work and play hard.</li>\n<li>Unlimited Vacation. </li>\n</ul>\n\n<p>We are focused on building a diverse and inclusive workforce. If you’re excited about this role, but do not meet 100% of the qualifications listed above, we encourage you to apply.</p>\n\n<p>We thank all applicants for their interest.</p>\n",
      "position": "full-time",
      "experience": 1,
      "visaSponsorship": false,
      "locations": [
        "San Francisco"
      ],
      "remote": true,
      "remoteLocations": [
        "San Francisco Bay Area"
      ],
      "skills": [
        "Research",
        "Neuroscience",
        "Computational Neuroscience",
        "Deep Learning",
        "Aritificial intellegience"
      ],
      "payment": {
        "salary": "$150k – $230k",
        "equity": "0.0% – 0.1%"
      },
      "recruiter": {
        "title": null,
        "role": "Investor",
        "url": "https://angel.co/u/aditya-mohan",
        "name": "Aditya Mohan",
        "avatar": "https://photos.angel.co/users/178357-medium_jpg?1573113168"
      },
      "refs": {
        "angelListId": "704186",
        "angelListUrl": "https://angel.co/company/skive-it/jobs/704186-"
      }
    },
    {
      "role": "Designer",
      "title": "Product Design Intern",
      "description": "It takes two to tango. Skive it® is getting humanity back into AI, making machines more humans and hoping to make humans less like machines.  We are an Autonomous AI chip company enabling machines to feel and looking for interface, interaction and HCI designers super stars. \r\n\r\nSkive it® is a technology innovator by heart and will prefer candidates that have some engineering exposure but it is not an absolute must as we are seeking to build a world class cross-functional team ranging from designers, creative writers, executives, engineers, sales, marketing and product staff. For example, someone with experience in healthcare, fashion or retail is highly encouraged to apply if they can show passion and/or know-how in Skive it® technology areas. \r\n As key team member in the fast growing, exciting space of AI, you will have the opportunity to help participate in the early design efforts for new product and services, work with strategic customers and partners who are themselves considered the top innovators in their respective areas, ranging from aerospace, automotive and healthcare. \r\n\r\nIdeal candidate will be someone who can go beyond simple 2D web or mobile interfaces to think out-of-the-box and work with on UIX design for 3D objects and machines in the intersection of AI and aerospace, autonomous vehicles and robots. We are building machines that feel and our current focus is UIX for such systems. Some background on AI will also be helpful while ability to think out-of-the-box and more important, out of the world of 2D web pages and mobile apps. The ideal candidate will have some track record of working on such design projects and willingness to think different. \r\n\r\nThe candidate will assume some/all the responsibilities below based on experience, potential and company’s strategic direction.  \r\n \r\n* Define creative strategies and design methods for Skive it® current and future products. \r\n* Collaborate closely with the Skive it® leadership team on new ideas with feedback from both internal and external stakeholder. \r\n* Create user flows, architecture diagrams, requirement documents, storyboards, wireframes and other design assets.\r\n* Create digital content related to current/future products and prototypes. For example, videos, images, animations.\r\n* Manage end-to-end product design cycles.\r\n* Help build, guide, and expand Skive it® internal creative team.\r\n* Create, drive and track adoption of design processes to foster innovation and creativity internally. \r\n* Act as creative director for projects, as needed. \r\n* Partner closely with product management and marketing teams to understand the product strategy and fit, define use cases, understand competitive offerings and articulate value propositions.\r\n\r\nMinimum Qualifications \r\n\r\n* Enrolled in bachelors, masters or PhD in design, architecture, HCI or related fields. Recent graduates are welcome to apply. \r\n* Interest in pursuing a career in product design. \r\n* Expertise with design and creativity tools such as Figma, Sketch, Webflow, Adobe Creative Suite, Autodesk Maya and others. \r\n* Academic or professional experience in the areas of user research, critical thinking, HCI, architecture or related fields.\r\n* Able to articulately explain the rationale behind design choices with a balance of passion and objectivity.  \r\n* Strong verbal and written communications skills in English including strong presentation skills and the ability to articulate complex concepts to cross functional audiences.\r\n* Know more than one language. Skive it® is global with staff in China, US, UK and India. \r\n* Team player. \r\n* Action oriented.   \r\n* Extrovert or would-be extrovert. \r\n\r\nPreferred Qualifications   \r\n\r\n* Experience in design from prior internships.  \r\n* Publications/blog/articles in design related field. \r\n* Prior experience building intuitive product interactions and have worked with engineers to implement novel product experiences.\r\n* Extremely strong attention to details - written, verbal and visual. \r\n* Basic knowledge about AI.\r\n\r\nBenefits \r\n\r\n* An early spot at a fast-growing company that is changing the future of AI and autonomous machines. \r\n* Opportunity to work in a product focused environment to create the worlds first machines that can feel. \r\n* A huge level up in your experience. We’ll make sure you see a lot of growth in your skill set that helps you to accelerates your career.  \r\n* Being part of a small startup team, an opportunity to work across multiple parts of the value chain in an industry starting with Aerospace, autonomous cars and healthcare. \r\n* Opportunity to work with and connect with Skive it® founders, executive team and advisory board that are industry visionaries and though leaders. \r\n* Compensation, benefits, equity, and salary that are above industry average once the current funding round close. Compensation mentioned on this post are future estimates.\r\n* Currently, 100% remote work that will ensure that you can maintain work-life balance even when working long hours (Yes, we do believe in ‘996’ work culture)\r\n* Participate in annual team retreat. Once a year the entire Skive it® team gets together at an inspiring location to meet, work and play hard.\r\n* Unlimited Vacation. \r\n\r\nWe are focused on building a diverse and inclusive workforce. If you’re excited about this role, but do not meet 100% of the qualifications listed above, we encourage you to apply.\r\n\r\nWe thank all applicants for their interest. \r\n\r\nCulture \r\n\r\nSkive it® is getting humanity back into AI, making machines more humans and hoping to make humans less like machines.  We like people who are crazy enough to think differently; the round pegs in the square holes... the ones who see things differently. Who consider themselves as being super cool and don't mind been seen as the crazy ones.  A passion to create innovative products is an absolute must. \r\n\r\n\"The only way to do great work is to love what you do\" — Steve Jobs \r\n\r\nWork culture include: \r\n* It is OK to be 25% wrong and take risk. Learn by failing 1 out of 4 times [only]. \r\n* Aim for perfection - All or Nothing\r\n* Chase 10X and not 10%\r\n* Just do it - As one of our founder who worked at MIT Media Labs says “Deploy!”. Write instead of just talk, build, prototype and deploy instead of just write. \r\n* Win as a team \r\n* Extreme ownership \r\n\r\nSkive it® expects employees to be honest, trustworthy, and operate with integrity. Discrimination and all unlawful harassment (including sexual harassment) in employment is not tolerated. We encourage success based on our individual merits and abilities, and all decisions regarding recruitment, hiring, promotion, compensation, employee development decisions such as training, and all other terms and conditions of employment, will be made without regard to race, nationality, national origin, citizenship status, employment status, ethnicity, ethnic origin, color, creed, religion, belief, age, marital status, pregnancy, gender, gender identity, sexual preference, lifestyle, social class, military status, disability, physical features, or any other protected status. We oppose all forms of unlawful or unfair discrimination. Skive it® is an equal opportunity employer.",
      "descriptionHtml": "<p>It takes two to tango. Skive it® is getting humanity back into AI, making machines more humans and hoping to make humans less like machines.  We are an Autonomous AI chip company enabling machines to feel and looking for interface, interaction and HCI designers super stars. </p>\n\n<p>Skive it® is a technology innovator by heart and will prefer candidates that have some engineering exposure but it is not an absolute must as we are seeking to build a world class cross-functional team ranging from designers, creative writers, executives, engineers, sales, marketing and product staff. For example, someone with experience in healthcare, fashion or retail is highly encouraged to apply if they can show passion and/or know-how in Skive it® technology areas. <br>\n As key team member in the fast growing, exciting space of AI, you will have the opportunity to help participate in the early design efforts for new product and services, work with strategic customers and partners who are themselves considered the top innovators in their respective areas, ranging from aerospace, automotive and healthcare. </p>\n\n<p>Ideal candidate will be someone who can go beyond simple 2D web or mobile interfaces to think out-of-the-box and work with on UIX design for 3D objects and machines in the intersection of AI and aerospace, autonomous vehicles and robots. We are building machines that feel and our current focus is UIX for such systems. Some background on AI will also be helpful while ability to think out-of-the-box and more important, out of the world of 2D web pages and mobile apps. The ideal candidate will have some track record of working on such design projects and willingness to think different. </p>\n\n<p>The candidate will assume some/all the responsibilities below based on experience, potential and company’s strategic direction.  </p>\n\n<ul>\n<li>Define creative strategies and design methods for Skive it® current and future products. </li>\n<li>Collaborate closely with the Skive it® leadership team on new ideas with feedback from both internal and external stakeholder. </li>\n<li>Create user flows, architecture diagrams, requirement documents, storyboards, wireframes and other design assets.</li>\n<li>Create digital content related to current/future products and prototypes. For example, videos, images, animations.</li>\n<li>Manage end-to-end product design cycles.</li>\n<li>Help build, guide, and expand Skive it® internal creative team.</li>\n<li>Create, drive and track adoption of design processes to foster innovation and creativity internally. </li>\n<li>Act as creative director for projects, as needed. </li>\n<li>Partner closely with product management and marketing teams to understand the product strategy and fit, define use cases, understand competitive offerings and articulate value propositions.</li>\n</ul>\n\n<p>Minimum Qualifications </p>\n\n<ul>\n<li>Enrolled in bachelors, masters or PhD in design, architecture, HCI or related fields. Recent graduates are welcome to apply. </li>\n<li>Interest in pursuing a career in product design. </li>\n<li>Expertise with design and creativity tools such as Figma, Sketch, Webflow, Adobe Creative Suite, Autodesk Maya and others. </li>\n<li>Academic or professional experience in the areas of user research, critical thinking, HCI, architecture or related fields.</li>\n<li>Able to articulately explain the rationale behind design choices with a balance of passion and objectivity.<br></li>\n<li>Strong verbal and written communications skills in English including strong presentation skills and the ability to articulate complex concepts to cross functional audiences.</li>\n<li>Know more than one language. Skive it® is global with staff in China, US, UK and India. </li>\n<li>Team player. </li>\n<li>Action oriented.<br></li>\n<li>Extrovert or would-be extrovert. </li>\n</ul>\n\n<p>Preferred Qualifications   </p>\n\n<ul>\n<li>Experience in design from prior internships.<br></li>\n<li>Publications/blog/articles in design related field. </li>\n<li>Prior experience building intuitive product interactions and have worked with engineers to implement novel product experiences.</li>\n<li>Extremely strong attention to details - written, verbal and visual. </li>\n<li>Basic knowledge about AI.</li>\n</ul>\n\n<p>Benefits </p>\n\n<ul>\n<li>An early spot at a fast-growing company that is changing the future of AI and autonomous machines. </li>\n<li>Opportunity to work in a product focused environment to create the worlds first machines that can feel. </li>\n<li>A huge level up in your experience. We’ll make sure you see a lot of growth in your skill set that helps you to accelerates your career.<br></li>\n<li>Being part of a small startup team, an opportunity to work across multiple parts of the value chain in an industry starting with Aerospace, autonomous cars and healthcare. </li>\n<li>Opportunity to work with and connect with Skive it® founders, executive team and advisory board that are industry visionaries and though leaders. </li>\n<li>Compensation, benefits, equity, and salary that are above industry average once the current funding round close. Compensation mentioned on this post are future estimates.</li>\n<li>Currently, 100% remote work that will ensure that you can maintain work-life balance even when working long hours (Yes, we do believe in ‘996’ work culture)</li>\n<li>Participate in annual team retreat. Once a year the entire Skive it® team gets together at an inspiring location to meet, work and play hard.</li>\n<li>Unlimited Vacation. </li>\n</ul>\n\n<p>We are focused on building a diverse and inclusive workforce. If you’re excited about this role, but do not meet 100% of the qualifications listed above, we encourage you to apply.</p>\n\n<p>We thank all applicants for their interest. </p>\n\n<p>Culture </p>\n\n<p>Skive it® is getting humanity back into AI, making machines more humans and hoping to make humans less like machines.  We like people who are crazy enough to think differently; the round pegs in the square holes... the ones who see things differently. Who consider themselves as being super cool and don&#39;t mind been seen as the crazy ones.  A passion to create innovative products is an absolute must. </p>\n\n<p>&quot;The only way to do great work is to love what you do&quot; — Steve Jobs </p>\n\n<p>Work culture include: </p>\n\n<ul>\n<li>It is OK to be 25% wrong and take risk. Learn by failing 1 out of 4 times [only]. </li>\n<li>Aim for perfection - All or Nothing</li>\n<li>Chase 10X and not 10%</li>\n<li>Just do it - As one of our founder who worked at MIT Media Labs says “Deploy!”. Write instead of just talk, build, prototype and deploy instead of just write. </li>\n<li>Win as a team </li>\n<li>Extreme ownership </li>\n</ul>\n\n<p>Skive it® expects employees to be honest, trustworthy, and operate with integrity. Discrimination and all unlawful harassment (including sexual harassment) in employment is not tolerated. We encourage success based on our individual merits and abilities, and all decisions regarding recruitment, hiring, promotion, compensation, employee development decisions such as training, and all other terms and conditions of employment, will be made without regard to race, nationality, national origin, citizenship status, employment status, ethnicity, ethnic origin, color, creed, religion, belief, age, marital status, pregnancy, gender, gender identity, sexual preference, lifestyle, social class, military status, disability, physical features, or any other protected status. We oppose all forms of unlawful or unfair discrimination. Skive it® is an equal opportunity employer.</p>\n",
      "position": "internship",
      "experience": 0,
      "visaSponsorship": false,
      "locations": [
        "San Francisco",
        "London",
        "Beijing"
      ],
      "remote": true,
      "remoteLocations": [
        "China",
        "North America",
        "United Kingdom"
      ],
      "skills": [
        "User Experience Design",
        "Interaction Design",
        "Adobe Creative Suite",
        "Industrial Design",
        "Wireframes and prototyping",
        "Maya 3D Animation"
      ],
      "payment": {
        "salary": "$75k – $110k",
        "equity": "0.0% – 0.1%"
      },
      "recruiter": {
        "title": null,
        "role": "Investor",
        "url": "https://angel.co/u/aditya-mohan",
        "name": "Aditya Mohan",
        "avatar": "https://photos.angel.co/users/178357-medium_jpg?1573113168"
      },
      "refs": {
        "angelListId": "809213",
        "angelListUrl": "https://angel.co/company/skive-it/jobs/809213-"
      }
    },
    {
      "role": "Designer",
      "title": "Product Designer",
      "description": "It takes two to tango. Skive it® is getting humanity back into AI, making machines more humans and hoping to make humans less like machines.  We are an Autonomous AI chip company enabling machines to feel and looking for interface, interaction and HCI designers super stars. \r\n\r\nSkive it® is a technology innovator by heart and will prefer candidates that have some engineering exposure but it is not an absolute must as we are seeking to build a world class cross-functional team ranging from designers, creative writers, executives, engineers, sales, marketing and product staff. For example, someone with experience in healthcare, fashion or retail is highly encouraged to apply if they can show passion and/or know-how in Skive it® technology areas. \r\n As key team member in the fast growing, exciting space of AI, you will have the opportunity to help participate in the early design efforts for new product and services, work with strategic customers and partners who are themselves considered the top innovators in their respective areas, ranging from aerospace, automotive and healthcare. \r\n\r\nIdeal candidate will be someone who can go beyond simple 2D web or mobile interfaces to think out-of-the-box and work with on UIX design for 3D objects and machines in the intersection of AI and aerospace, autonomous vehicles and robots. We are building machines that feel and our current focus is UIX for such systems. Some background on AI will also be helpful while ability to think out-of-the-box and more important, out of the world of 2D web pages and mobile apps. The ideal candidate will have some track record of working on such design projects and willingness to think different. \r\n\r\nThe candidate will assume some/all the responsibilities below based on experience, potential and company’s strategic direction.  \r\n \r\n* Define creative strategies and design methods for Skive it® current and future products. \r\n* Collaborate closely with the Skive it® leadership team on new ideas with feedback from both internal and external stakeholder. \r\n* Create user flows, architecture diagrams, requirement documents, storyboards, wireframes and other design assets.\r\n* Create digital content related to current/future products and prototypes. For example, videos, images, animations.\r\n* Manage end-to-end product design cycles.\r\n* Help build, guide, and expand Skive it® internal creative team.\r\n* Create, drive and track adoption of design processes to foster innovation and creativity internally. \r\n* Act as creative director for projects, as needed. \r\n* Partner closely with product management and marketing teams to understand the product strategy and fit, define use cases, understand competitive offerings and articulate value propositions.\r\n\r\nMinimum Qualifications \r\n\r\n* Bachelors, masters or PhD in design, architecture, HCI or related fields. \r\n* Expertise with design and creativity tools such as Figma, Sketch, Webflow, Adobe Creative Suite, Autodesk Maya and others. \r\n* Academic or professional experience in the areas of user research, critical thinking, HCI, architecture or related fields.\r\n* Able to articulately explain the rationale behind design choices with a balance of passion and objectivity.  \r\n* Strong verbal and written communications skills in English including strong presentation skills and the ability to articulate complex concepts to cross functional audiences.\r\n* Know more than one language. Skive it® is global with staff in China, US, UK and India. \r\n* Team player. \r\n* Action oriented.   \r\n* Extrovert or would-be extrovert. \r\n* Experience writing design specifications and converting them to actionable research and interface prototype deliverables.\r\n* Facilitative leadership skills applied to drive user-centered design processes, working collaboratively with customers, cross-functional team members, and business partners, that result in others learning from you and requesting to work with you in the future. \r\n* Extremely strong attention to details - written, verbal and visual. \r\n* Establish a design system for product that is simple yet consistently communicates the brand\r\n* Excellent aesthetic judgment. You have defined brand attributes and guidelines with which others have designed, and/or used guidelines designed by others.\r\n* Prior experience building intuitive product interactions and have worked with engineers to implement novel product experiences.\r\n\r\nPreferred Qualifications\r\n\r\n* Track record of user experience research in the area of human behavior, brain science, HCI and/or neuroscience is desirable.\r\n* Experience in aerospace, healthcare and/or automotive industry.\r\n* 5+ years experience as a product designer or similar in physical products and not just web related applications.\r\n* Strong portfolio showcasing prior work. \r\n \r\nBenefits \r\n\r\n* An early spot at a fast-growing company that is changing the future of AI and autonomous machines. \r\n* Opportunity to work in a product focused environment to create the worlds first machines that can feel. \r\n* A huge level up in your experience. We’ll make sure you see a lot of growth in your skill set that helps you to accelerates your career.  \r\n* Being part of a small startup team, an opportunity to work across multiple parts of the value chain in an industry starting with Aerospace, autonomous cars and healthcare. \r\n* Opportunity to work with and connect with Skive it® founders, executive team and advisory board that are industry visionaries and though leaders. \r\n* Compensation, benefits, equity, and salary that are above industry average once the current funding round close. Compensation mentioned on this post are future estimates.\r\n* Currently, 100% remote work that will ensure that you can maintain work-life balance even when working long hours (Yes, we do believe in ‘996’ work culture)\r\n* Participate in annual team retreat. Once a year the entire Skive it® team gets together at an inspiring location to meet, work and play hard.\r\n* Unlimited Vacation. \r\n\r\nWe are focused on building a diverse and inclusive workforce. If you’re excited about this role, but do not meet 100% of the qualifications listed above, we encourage you to apply.\r\n\r\nWe thank all applicants for their interest. \r\n\r\nCulture \r\n\r\nSkive it® is getting humanity back into AI, making machines more humans and hoping to make humans less like machines.  We like people who are crazy enough to think differently; the round pegs in the square holes... the ones who see things differently. Who consider themselves as being super cool and don't mind been seen as the crazy ones.  A passion to create innovative products is an absolute must. \r\n\r\n\"The only way to do great work is to love what you do\" — Steve Jobs \r\n\r\nWork culture include: \r\n* It is OK to be 25% wrong and take risk. Learn by failing 1 out of 4 times [only]. \r\n* Aim for perfection - All or Nothing\r\n* Chase 10X and not 10%\r\n* Just do it - As one of our founder who worked at MIT Media Labs says “Deploy!”. Write instead of just talk, build, prototype and deploy instead of just write. \r\n* Win as a team \r\n* Extreme ownership \r\n\r\nSkive it® expects employees to be honest, trustworthy, and operate with integrity. Discrimination and all unlawful harassment (including sexual harassment) in employment is not tolerated. We encourage success based on our individual merits and abilities, and all decisions regarding recruitment, hiring, promotion, compensation, employee development decisions such as training, and all other terms and conditions of employment, will be made without regard to race, nationality, national origin, citizenship status, employment status, ethnicity, ethnic origin, color, creed, religion, belief, age, marital status, pregnancy, gender, gender identity, sexual preference, lifestyle, social class, military status, disability, physical features, or any other protected status. We oppose all forms of unlawful or unfair discrimination. Skive it® is an equal opportunity employer.",
      "descriptionHtml": "<p>It takes two to tango. Skive it® is getting humanity back into AI, making machines more humans and hoping to make humans less like machines.  We are an Autonomous AI chip company enabling machines to feel and looking for interface, interaction and HCI designers super stars. </p>\n\n<p>Skive it® is a technology innovator by heart and will prefer candidates that have some engineering exposure but it is not an absolute must as we are seeking to build a world class cross-functional team ranging from designers, creative writers, executives, engineers, sales, marketing and product staff. For example, someone with experience in healthcare, fashion or retail is highly encouraged to apply if they can show passion and/or know-how in Skive it® technology areas. <br>\n As key team member in the fast growing, exciting space of AI, you will have the opportunity to help participate in the early design efforts for new product and services, work with strategic customers and partners who are themselves considered the top innovators in their respective areas, ranging from aerospace, automotive and healthcare. </p>\n\n<p>Ideal candidate will be someone who can go beyond simple 2D web or mobile interfaces to think out-of-the-box and work with on UIX design for 3D objects and machines in the intersection of AI and aerospace, autonomous vehicles and robots. We are building machines that feel and our current focus is UIX for such systems. Some background on AI will also be helpful while ability to think out-of-the-box and more important, out of the world of 2D web pages and mobile apps. The ideal candidate will have some track record of working on such design projects and willingness to think different. </p>\n\n<p>The candidate will assume some/all the responsibilities below based on experience, potential and company’s strategic direction.  </p>\n\n<ul>\n<li>Define creative strategies and design methods for Skive it® current and future products. </li>\n<li>Collaborate closely with the Skive it® leadership team on new ideas with feedback from both internal and external stakeholder. </li>\n<li>Create user flows, architecture diagrams, requirement documents, storyboards, wireframes and other design assets.</li>\n<li>Create digital content related to current/future products and prototypes. For example, videos, images, animations.</li>\n<li>Manage end-to-end product design cycles.</li>\n<li>Help build, guide, and expand Skive it® internal creative team.</li>\n<li>Create, drive and track adoption of design processes to foster innovation and creativity internally. </li>\n<li>Act as creative director for projects, as needed. </li>\n<li>Partner closely with product management and marketing teams to understand the product strategy and fit, define use cases, understand competitive offerings and articulate value propositions.</li>\n</ul>\n\n<p>Minimum Qualifications </p>\n\n<ul>\n<li>Bachelors, masters or PhD in design, architecture, HCI or related fields. </li>\n<li>Expertise with design and creativity tools such as Figma, Sketch, Webflow, Adobe Creative Suite, Autodesk Maya and others. </li>\n<li>Academic or professional experience in the areas of user research, critical thinking, HCI, architecture or related fields.</li>\n<li>Able to articulately explain the rationale behind design choices with a balance of passion and objectivity.<br></li>\n<li>Strong verbal and written communications skills in English including strong presentation skills and the ability to articulate complex concepts to cross functional audiences.</li>\n<li>Know more than one language. Skive it® is global with staff in China, US, UK and India. </li>\n<li>Team player. </li>\n<li>Action oriented.<br></li>\n<li>Extrovert or would-be extrovert. </li>\n<li>Experience writing design specifications and converting them to actionable research and interface prototype deliverables.</li>\n<li>Facilitative leadership skills applied to drive user-centered design processes, working collaboratively with customers, cross-functional team members, and business partners, that result in others learning from you and requesting to work with you in the future. </li>\n<li>Extremely strong attention to details - written, verbal and visual. </li>\n<li>Establish a design system for product that is simple yet consistently communicates the brand</li>\n<li>Excellent aesthetic judgment. You have defined brand attributes and guidelines with which others have designed, and/or used guidelines designed by others.</li>\n<li>Prior experience building intuitive product interactions and have worked with engineers to implement novel product experiences.</li>\n</ul>\n\n<p>Preferred Qualifications</p>\n\n<ul>\n<li>Track record of user experience research in the area of human behavior, brain science, HCI and/or neuroscience is desirable.</li>\n<li>Experience in aerospace, healthcare and/or automotive industry.</li>\n<li>5+ years experience as a product designer or similar in physical products and not just web related applications.</li>\n<li>Strong portfolio showcasing prior work. </li>\n</ul>\n\n<p>Benefits </p>\n\n<ul>\n<li>An early spot at a fast-growing company that is changing the future of AI and autonomous machines. </li>\n<li>Opportunity to work in a product focused environment to create the worlds first machines that can feel. </li>\n<li>A huge level up in your experience. We’ll make sure you see a lot of growth in your skill set that helps you to accelerates your career.<br></li>\n<li>Being part of a small startup team, an opportunity to work across multiple parts of the value chain in an industry starting with Aerospace, autonomous cars and healthcare. </li>\n<li>Opportunity to work with and connect with Skive it® founders, executive team and advisory board that are industry visionaries and though leaders. </li>\n<li>Compensation, benefits, equity, and salary that are above industry average once the current funding round close. Compensation mentioned on this post are future estimates.</li>\n<li>Currently, 100% remote work that will ensure that you can maintain work-life balance even when working long hours (Yes, we do believe in ‘996’ work culture)</li>\n<li>Participate in annual team retreat. Once a year the entire Skive it® team gets together at an inspiring location to meet, work and play hard.</li>\n<li>Unlimited Vacation. </li>\n</ul>\n\n<p>We are focused on building a diverse and inclusive workforce. If you’re excited about this role, but do not meet 100% of the qualifications listed above, we encourage you to apply.</p>\n\n<p>We thank all applicants for their interest. </p>\n\n<p>Culture </p>\n\n<p>Skive it® is getting humanity back into AI, making machines more humans and hoping to make humans less like machines.  We like people who are crazy enough to think differently; the round pegs in the square holes... the ones who see things differently. Who consider themselves as being super cool and don&#39;t mind been seen as the crazy ones.  A passion to create innovative products is an absolute must. </p>\n\n<p>&quot;The only way to do great work is to love what you do&quot; — Steve Jobs </p>\n\n<p>Work culture include: </p>\n\n<ul>\n<li>It is OK to be 25% wrong and take risk. Learn by failing 1 out of 4 times [only]. </li>\n<li>Aim for perfection - All or Nothing</li>\n<li>Chase 10X and not 10%</li>\n<li>Just do it - As one of our founder who worked at MIT Media Labs says “Deploy!”. Write instead of just talk, build, prototype and deploy instead of just write. </li>\n<li>Win as a team </li>\n<li>Extreme ownership </li>\n</ul>\n\n<p>Skive it® expects employees to be honest, trustworthy, and operate with integrity. Discrimination and all unlawful harassment (including sexual harassment) in employment is not tolerated. We encourage success based on our individual merits and abilities, and all decisions regarding recruitment, hiring, promotion, compensation, employee development decisions such as training, and all other terms and conditions of employment, will be made without regard to race, nationality, national origin, citizenship status, employment status, ethnicity, ethnic origin, color, creed, religion, belief, age, marital status, pregnancy, gender, gender identity, sexual preference, lifestyle, social class, military status, disability, physical features, or any other protected status. We oppose all forms of unlawful or unfair discrimination. Skive it® is an equal opportunity employer.</p>\n",
      "position": "full-time",
      "experience": 5,
      "visaSponsorship": false,
      "locations": [
        "San Francisco",
        "London",
        "Beijing"
      ],
      "remote": true,
      "remoteLocations": [
        "China",
        "North America",
        "United Kingdom"
      ],
      "skills": [
        "User Experience Design",
        "Interaction Design",
        "Adobe Creative Suite",
        "Industrial Design",
        "Wireframes and prototyping",
        "Maya 3D Animation"
      ],
      "payment": {
        "salary": "$100k – $170k",
        "equity": "0.0% – 0.1%"
      },
      "recruiter": {
        "title": null,
        "role": "Investor",
        "url": "https://angel.co/u/aditya-mohan",
        "name": "Aditya Mohan",
        "avatar": "https://photos.angel.co/users/178357-medium_jpg?1573113168"
      },
      "refs": {
        "angelListId": "809214",
        "angelListUrl": "https://angel.co/company/skive-it/jobs/809214-"
      }
    },
    {
      "role": "Software Engineer",
      "title": "Software Engineering Intern",
      "description": "U: The crazy enough to think differently; the round pegs in the square holes... the ones who see things differently. Who consider themselves as being super cool and don't mind been seen as the crazy ones? If yes, we want you!\n\nUS: \nSkive it® is a fun, upcoming hot San Francisco, California based startup with additional registered office in UK, founded by two Brown University computer science grads. We are building a specialized evolving chip that will be the heart of the robot as opposed to the brain with the goal to build robots that can feel. We believe the aging world will not need super human(oid)s but robots that are more human and Skive it’s autonomous Deep Learning technology will be the center piece of this. We call this technology Robometrics®. It will form the morality layer for any robotics system that interacts with humans  on top of their AI enabled brain to bring humanity back into AI.\n \nOur team includes experienced executives with computer science Ph.D. and masters from Brown University with professional experience from Oracle, IBM, Intel, MIT Media Labs and HP. We have a culture that believe in working hard but intelligently.",
      "descriptionHtml": "<p>U: The crazy enough to think differently; the round pegs in the square holes... the ones who see things differently. Who consider themselves as being super cool and don&#39;t mind been seen as the crazy ones? If yes, we want you!</p>\n\n<p>US: <br>\nSkive it® is a fun, upcoming hot San Francisco, California based startup with additional registered office in UK, founded by two Brown University computer science grads. We are building a specialized evolving chip that will be the heart of the robot as opposed to the brain with the goal to build robots that can feel. We believe the aging world will not need super human(oid)s but robots that are more human and Skive it’s autonomous Deep Learning technology will be the center piece of this. We call this technology Robometrics®. It will form the morality layer for any robotics system that interacts with humans  on top of their AI enabled brain to bring humanity back into AI.</p>\n\n<p>Our team includes experienced executives with computer science Ph.D. and masters from Brown University with professional experience from Oracle, IBM, Intel, MIT Media Labs and HP. We have a culture that believe in working hard but intelligently.</p>\n",
      "position": "internship",
      "experience": null,
      "visaSponsorship": false,
      "locations": [
        "San Francisco"
      ],
      "remote": true,
      "remoteLocations": [],
      "skills": [
        "Python",
        "Javascript",
        "HTML",
        "HTML5 & CSS3"
      ],
      "payment": {
        "salary": "No salary"
      },
      "recruiter": {
        "title": null,
        "role": "Investor",
        "url": "https://angel.co/u/aditya-mohan",
        "name": "Aditya Mohan",
        "avatar": "https://photos.angel.co/users/178357-medium_jpg?1573113168"
      },
      "refs": {
        "angelListId": "23266",
        "angelListUrl": "https://angel.co/company/skive-it/jobs/23266-"
      }
    }
  ]
}