{
  "name": "Snowplow Analytics",
  "avatar": "https://photos.angel.co/startups/i/6048265-5bb12047a2e90d2c97adad93127abbb4-medium_jpg.jpg?buster=1583880211",
  "slogan": "The enterprise-grade event data collection platform",
  "description": "It’s a hugely exciting time here at Snowplow. Over the last 7 years, we’ve grown to a brilliant 50 person team that is spread out over 14 countries with nearly 150 customers and many, many more open source users, and we’re heading for even bigger and better things, fast. \n\nAt Snowplow, we are on a mission to empower people to differentiate with data. We provide both the technology and services to enable our customers to not only take control of their data, but allow them to do amazing things with that control. \n\nOur commercial product offering, Snowplow Insights, builds on our open-source and is customisable meaning that customers are in charge of the data they want to track & collect (across various channels & platforms) and how they want to visualise that data. ",
  "links": [
    {
      "type": "website",
      "url": "http://snowplowanalytics.com"
    },
    {
      "type": "blog",
      "url": "https://snowplowanalytics.com/blog/"
    },
    {
      "type": "twitter",
      "url": "http://twitter.com/SnowplowData"
    },
    {
      "type": "facebook",
      "url": "https://www.facebook.com/snowplowanalytics/"
    },
    {
      "type": "linkedIn",
      "url": "https://www.linkedin.com/company/snowplow-analytics-ltd"
    },
    {
      "type": "productHunt",
      "url": ""
    }
  ],
  "locations": [
    "London",
    "Remote",
    "Europe",
    "United States",
    "Canada",
    "Italy",
    "France",
    "Greece",
    "Germany",
    "Spain",
    "Portugal",
    "Poland",
    "Russia",
    "United Kingdom"
  ],
  "marketTags": [
    "SaaS",
    "Big Data Analytics",
    "Data",
    "Enterprise Software",
    "Analytics",
    "Big Data",
    "Data Integration",
    "Open Source",
    "Software"
  ],
  "employees": "SIZE_51_200",
  "funding": {
    "totalRaised": 4000000,
    "rounds": [
      {
        "type": "Series A",
        "closedAt": 1573689600,
        "valuation": null
      }
    ]
  },
  "team": [
    {
      "title": null,
      "role": "Employee",
      "url": "https://angel.co/u/denika-campbell",
      "name": "Denika Campbell",
      "avatar": "https://angel.co/images/shared/nopic.png",
      "bioHtml": "HR professional with experience in the following industries: Tech, Fashion, Media and TV."
    },
    {
      "title": "Product Manager",
      "role": "Employee",
      "url": "https://angel.co/u/mike-nemirovsky",
      "name": "Mike Nemirovsky",
      "avatar": "https://photos.angel.co/users/101446-medium_jpg?1563486697",
      "bioHtml": "Data and analytics product leader. My journey has taken me from music to marketing to data and product. I love taking bold moves to challenge my skillset."
    },
    {
      "title": "Graduate Software Engineer",
      "role": "Employee",
      "url": "https://angel.co/u/oguzhanunlu",
      "name": "Oguzhan Unlu",
      "avatar": "https://photos.angel.co/users/972910-medium_jpg?1421890428",
      "bioHtml": "CS Grad from Middle East Technical University"
    }
  ],
  "perks": [
    {
      "category": "equity",
      "title": "Share options "
    },
    {
      "category": "company_events",
      "title": "Quarterly team events around London!"
    },
    {
      "category": "work_from_home",
      "title": "Work from the office, home or another country"
    },
    {
      "category": "generous_vacation",
      "title": "25 days plus bank holidays"
    },
    {
      "category": "retirement",
      "title": "Pension "
    },
    {
      "category": "professional_development",
      "title": "Internal and external personal development "
    },
    {
      "category": "company_events",
      "title": "Two company Away Weeks a year!"
    },
    {
      "category": "miscellaneous",
      "title": "Coffee, snacks and drinks in the office "
    }
  ],
  "refs": {
    "angelListId": "6048265",
    "angelListUrl": "https://angel.co/company/snowplow-analytics-2"
  },
  "jobs": [
    {
      "role": "Other",
      "title": "Data Engineering Internship",
      "description": "Data Engineering internship - Summer 2020\nRemote, Europe (UTC +/- 2)\n\nAt Snowplow, we have a long tradition of offering remote internships. Many of our full time team have interned with us previously. This year we’re pleased to be able to offer two!There are tens of thousands of pipelines using our open source tech worldwide, collecting data emitted from over half a million sites and some very high-profile mobile apps. Running on AWS and GCP’s data stacks, it is ideal for data teams who want to collect high quality behavioral data in real-time and in their own cloud. We also collect, validate, enrich and load around 5 billion events for our customers each day.  \n\nThe Opportunity\n\nWe are looking for two interns to join our team this summer. Ideally you’ll start in June and spend 3 months with us, however we’re open to different dates. We have four different teams within Engineering, all offering different experiences. We'll discuss during the interview process which team we envision you spending the most time with. There is plenty of opportunity to learn more from the wider team about all aspects of providing our service, from code to customers.\n\nWhat you’ll be doing.\n\n- Working on one or more of our pipeline, tracker or management console estate, depending on your skills and interests. \n- Our pipeline tech is predominantly Scala and follows FP principles. Our tracker estate is very diverse, including Java, Objective-C, JavaScript, Python, and many more. - You’ll be very likely to be contributing to one of our many open source projects and building your GitHub profile there. \n- Learning and contributing to our testing and deployment processes so that we can ship features quickly and with confidence. \n- Collaborating with our Product Office and the wider team on building the best solutions for our customers.\n- Being an active part in decision making on what we build and how we deliver it. You’ll bring a different perspective and we’ll want your input!\n\nOur commitment to you:\n\n- We will dedicate time to support your learning through a dedicated mentor, peer support, pair programming, etc.\n- You will have the opportunity to write code that is released to our community and/or into our managed service. \n- You will receive feedback throughout the internship and we’ll provide a short report at the end of your internship with reflections on your time with us.\n\nWhat we’re looking for..\n\n- The idea of working for a growing startup excites you.\n- You have programming experience (not necessarily through work) and can demonstrate this in your application and through interview. \n- Ideally this programming experience would be in Scala (functional) and/or JavaScript, Our data security and integrity are fundamental to what we do. You’ll need a good understanding of security threats and how to overcome them. \n- Previous experience in data is a plus, but most importantly you’re interested in data and how it can empower our customers to make better decisions.\n- You don’t wait to be told what to do. You can accept a mission, drive towards it and recognise when you need support or more direction.\n- Our remote team depends on expert collaborators to work effectively. You’ll be a great communicator and enjoy working closely with the team.\n\nWhat you’ll get in return.\n\n- A three month, five-days-a-week placement, within which you can take leave as agreed. Sorry, you cannot fit this around other work or study commitments.\n- This is a paid internship, but inline with starter salaries. \n- Freedom to work from wherever suits you best, provided that your location’s working day lines up with UTC +/- 2. Sorry, we are not looking for interns to move their working hours to meet ours (i.e. start working in the middle of the night).\n- Professional exposure to a fast-moving, collaborative engineering organisation full of supportive and talented people. \n\nHere is what one our previous Interns had to say about their time with us:\n\n“I undertook two internship at Snowplow and they have been a great experience for me. Interns at Snowplow are regarded like any other team member. I had a chance to work on core products of the company and real life challenges. Of course, in this process I never felt alone or isolated because all the team members were very helpful and they were always very patient against all my newbie questions. Also, making contributions to open source during this process was the cherry on the cake! I had a chance to see the internal dynamics of such a big open source project and I think this was a very valuable experience.” - Enes, working from Turkey, 2019 and 2017.\n\n\n\n\n",
      "descriptionHtml": "<p>Data Engineering internship - Summer 2020<br>\nRemote, Europe (UTC +/- 2)</p>\n\n<p>At Snowplow, we have a long tradition of offering remote internships. Many of our full time team have interned with us previously. This year we’re pleased to be able to offer two!There are tens of thousands of pipelines using our open source tech worldwide, collecting data emitted from over half a million sites and some very high-profile mobile apps. Running on AWS and GCP’s data stacks, it is ideal for data teams who want to collect high quality behavioral data in real-time and in their own cloud. We also collect, validate, enrich and load around 5 billion events for our customers each day.  </p>\n\n<p>The Opportunity</p>\n\n<p>We are looking for two interns to join our team this summer. Ideally you’ll start in June and spend 3 months with us, however we’re open to different dates. We have four different teams within Engineering, all offering different experiences. We&#39;ll discuss during the interview process which team we envision you spending the most time with. There is plenty of opportunity to learn more from the wider team about all aspects of providing our service, from code to customers.</p>\n\n<p>What you’ll be doing.</p>\n\n<ul>\n<li>Working on one or more of our pipeline, tracker or management console estate, depending on your skills and interests. </li>\n<li>Our pipeline tech is predominantly Scala and follows FP principles. Our tracker estate is very diverse, including Java, Objective-C, JavaScript, Python, and many more. - You’ll be very likely to be contributing to one of our many open source projects and building your GitHub profile there. </li>\n<li>Learning and contributing to our testing and deployment processes so that we can ship features quickly and with confidence. </li>\n<li>Collaborating with our Product Office and the wider team on building the best solutions for our customers.</li>\n<li>Being an active part in decision making on what we build and how we deliver it. You’ll bring a different perspective and we’ll want your input!</li>\n</ul>\n\n<p>Our commitment to you:</p>\n\n<ul>\n<li>We will dedicate time to support your learning through a dedicated mentor, peer support, pair programming, etc.</li>\n<li>You will have the opportunity to write code that is released to our community and/or into our managed service. </li>\n<li>You will receive feedback throughout the internship and we’ll provide a short report at the end of your internship with reflections on your time with us.</li>\n</ul>\n\n<p>What we’re looking for..</p>\n\n<ul>\n<li>The idea of working for a growing startup excites you.</li>\n<li>You have programming experience (not necessarily through work) and can demonstrate this in your application and through interview. </li>\n<li>Ideally this programming experience would be in Scala (functional) and/or JavaScript, Our data security and integrity are fundamental to what we do. You’ll need a good understanding of security threats and how to overcome them. </li>\n<li>Previous experience in data is a plus, but most importantly you’re interested in data and how it can empower our customers to make better decisions.</li>\n<li>You don’t wait to be told what to do. You can accept a mission, drive towards it and recognise when you need support or more direction.</li>\n<li>Our remote team depends on expert collaborators to work effectively. You’ll be a great communicator and enjoy working closely with the team.</li>\n</ul>\n\n<p>What you’ll get in return.</p>\n\n<ul>\n<li>A three month, five-days-a-week placement, within which you can take leave as agreed. Sorry, you cannot fit this around other work or study commitments.</li>\n<li>This is a paid internship, but inline with starter salaries. </li>\n<li>Freedom to work from wherever suits you best, provided that your location’s working day lines up with UTC +/- 2. Sorry, we are not looking for interns to move their working hours to meet ours (i.e. start working in the middle of the night).</li>\n<li>Professional exposure to a fast-moving, collaborative engineering organisation full of supportive and talented people. </li>\n</ul>\n\n<p>Here is what one our previous Interns had to say about their time with us:</p>\n\n<p>“I undertook two internship at Snowplow and they have been a great experience for me. Interns at Snowplow are regarded like any other team member. I had a chance to work on core products of the company and real life challenges. Of course, in this process I never felt alone or isolated because all the team members were very helpful and they were always very patient against all my newbie questions. Also, making contributions to open source during this process was the cherry on the cake! I had a chance to see the internal dynamics of such a big open source project and I think this was a very valuable experience.” - Enes, working from Turkey, 2019 and 2017.</p>\n",
      "position": "internship",
      "experience": null,
      "visaSponsorship": true,
      "locations": [
        "Europe"
      ],
      "remote": true,
      "remoteLocations": [
        "Europe"
      ],
      "skills": [],
      "payment": {
        "salary": "No salary"
      },
      "recruiter": {
        "title": null,
        "role": "Employee",
        "url": "https://angel.co/u/denika-campbell",
        "name": "Denika Campbell",
        "avatar": "https://angel.co/images/shared/nopic.png"
      },
      "refs": {
        "angelListId": "771762",
        "angelListUrl": "https://angel.co/company/snowplow-analytics-2/jobs/771762-"
      }
    },
    {
      "role": "Marketing",
      "title": "Marketing Operations Manager",
      "description": "Marketing Operations Manager\nLocated in London or Remote (UTC +/- 2)\n\nIt’s a hugely exciting time here at Snowplow. Over the last 7 years, we’ve grown to a brilliant 50 person team that is spread out over 12 countries with nearly 150 customers and many, many more open source users, and we’re heading for even bigger and better things.\n\nOur technology enables you to track any event data; ask any question of that data and use any tool you want to answer it. Our mission is to empower people and companies to do truly transformative things using data. \n\nTo support us with our ambitious goals, we are now looking for a Marketing Operations Manager to join our Marketing team and build out and lead the operations function.\n\nThe Opportunity \n\nAs the Marketing Operations Manager you’ll work as a part of a growing marketing team that is laser focused on demand generation. You’ll be instrumental in helping the team measure, manage and optimise our go-to-market processes and drive results. You’ll leverage our marketing technology systems to assist marketing and sales in processing inbound leads and will report on and measure the results. You’ll be instrumental in managing our lead flow and reporting processes, helping to optimize our marketing investments and maintain a close partnership with sales.\n\nWe’re an ambitious, enthusiastic team and are looking for someone to join us who can own the growing operations challenge within the marketing team. \n\nWhat you’ll be doing\n\n- Own and build out the marketing operations function and team interfacing closely with our Head of Demand Gen and the sales & SDR organisation\n- Execute and manage key processes in Pardot, including all lead scoring, lead assignment, building, campaigns,  nurturing and engagement flows, and more.\n- Work closely with the rest of the marketing team members to ensure our campaigns and events are effectively driving pipeline\n- Be responsible for the data management inside Pardot and external data suppliers to ensure our systems are clean, compliant with data laws and contain well segmented prospecting data\n- Lead the charge on scaling and optimising the operations processes and the technologies we use\n- Measure, report and analyse key demand generation and sales metrics to enable marketing and sales to execute and optimize effectively on their initiatives\n- Manage marketing’s CRM system (Pardot) and continuously identify data inconsistencies across sales and marketing platforms, discover root causes and implement sound solutions\n- Work cross-functionally with the sales team to help drive success in lead management and to track and improve funnel efficiency including educating and training as required\n- Work with the sales team on managing Salesforce processes, workflows and reporting\n- Create processes for the marketing and sales teams that drive speed and efficiency across systems and teams\n\nWe’d love to hear from you if\n\n- The idea of working for a growing startup excites you\n- You have 3-5 years of experience with managing CRM systems, automation solutions and marketing operations processes (ideally in a B2B SaaS setting)\n- Basic SQL skills is not a must, but it’s a big plus\n- You have deep experience using Salesforce and ideally Pardot (will consider  Eloqua, Marketo or Hubspot)\n- You enjoy building out detailed processes, sticking to and refining them over time\n- You are detail-oriented, accurate and good at problem solvingYou thrive in fast paced environments where you’ll have to think on your feet\n- You’re analytical and use data to derive insights and inform decisions\n- You are adaptable and don’t mind working in an ambiguous, ever-changing environment\n- You have the ability to identify and communicate issues quickly\n- You have a passion for marketing and demand generation\n\nWhat you’ll get in return\n- A competitive package based on experience, including share options \n- 25 days of holiday a year (plus bank holidays)MacBook or Dell XPS 13/15\n- Freedom to work wherever suits you best \n- Two fantastic company Away-Weeks in a different European city each year (last one was in Bratislava in November 2019)\n- Work alongside a supportive and talented team Grow and develop in a fast-moving, collaborative organisation \n- Enjoy fun events in and around London organised by our Cultural Work Committee \n- Learn to code or improve your existing skills with our Software Development Guild \n- Convenient location in central London (Aldgate)\n- Continuous supply of Pact coffee and healthy snacks \n\n\n\n\nSnowplow is dedicated to building and supporting a brilliant, diverse and hugely inclusive team. We don't discriminate against gender, race, religion or belief, disability, age, marital status or sexual orientation. Whatever your background may be, we welcome anyone with talent, drive and emotional intelligence.\n",
      "descriptionHtml": "<p>Marketing Operations Manager<br>\nLocated in London or Remote (UTC +/- 2)</p>\n\n<p>It’s a hugely exciting time here at Snowplow. Over the last 7 years, we’ve grown to a brilliant 50 person team that is spread out over 12 countries with nearly 150 customers and many, many more open source users, and we’re heading for even bigger and better things.</p>\n\n<p>Our technology enables you to track any event data; ask any question of that data and use any tool you want to answer it. Our mission is to empower people and companies to do truly transformative things using data. </p>\n\n<p>To support us with our ambitious goals, we are now looking for a Marketing Operations Manager to join our Marketing team and build out and lead the operations function.</p>\n\n<p>The Opportunity </p>\n\n<p>As the Marketing Operations Manager you’ll work as a part of a growing marketing team that is laser focused on demand generation. You’ll be instrumental in helping the team measure, manage and optimise our go-to-market processes and drive results. You’ll leverage our marketing technology systems to assist marketing and sales in processing inbound leads and will report on and measure the results. You’ll be instrumental in managing our lead flow and reporting processes, helping to optimize our marketing investments and maintain a close partnership with sales.</p>\n\n<p>We’re an ambitious, enthusiastic team and are looking for someone to join us who can own the growing operations challenge within the marketing team. </p>\n\n<p>What you’ll be doing</p>\n\n<ul>\n<li>Own and build out the marketing operations function and team interfacing closely with our Head of Demand Gen and the sales &amp; SDR organisation</li>\n<li>Execute and manage key processes in Pardot, including all lead scoring, lead assignment, building, campaigns,  nurturing and engagement flows, and more.</li>\n<li>Work closely with the rest of the marketing team members to ensure our campaigns and events are effectively driving pipeline</li>\n<li>Be responsible for the data management inside Pardot and external data suppliers to ensure our systems are clean, compliant with data laws and contain well segmented prospecting data</li>\n<li>Lead the charge on scaling and optimising the operations processes and the technologies we use</li>\n<li>Measure, report and analyse key demand generation and sales metrics to enable marketing and sales to execute and optimize effectively on their initiatives</li>\n<li>Manage marketing’s CRM system (Pardot) and continuously identify data inconsistencies across sales and marketing platforms, discover root causes and implement sound solutions</li>\n<li>Work cross-functionally with the sales team to help drive success in lead management and to track and improve funnel efficiency including educating and training as required</li>\n<li>Work with the sales team on managing Salesforce processes, workflows and reporting</li>\n<li>Create processes for the marketing and sales teams that drive speed and efficiency across systems and teams</li>\n</ul>\n\n<p>We’d love to hear from you if</p>\n\n<ul>\n<li>The idea of working for a growing startup excites you</li>\n<li>You have 3-5 years of experience with managing CRM systems, automation solutions and marketing operations processes (ideally in a B2B SaaS setting)</li>\n<li>Basic SQL skills is not a must, but it’s a big plus</li>\n<li>You have deep experience using Salesforce and ideally Pardot (will consider  Eloqua, Marketo or Hubspot)</li>\n<li>You enjoy building out detailed processes, sticking to and refining them over time</li>\n<li>You are detail-oriented, accurate and good at problem solvingYou thrive in fast paced environments where you’ll have to think on your feet</li>\n<li>You’re analytical and use data to derive insights and inform decisions</li>\n<li>You are adaptable and don’t mind working in an ambiguous, ever-changing environment</li>\n<li>You have the ability to identify and communicate issues quickly</li>\n<li>You have a passion for marketing and demand generation</li>\n</ul>\n\n<p>What you’ll get in return</p>\n\n<ul>\n<li>A competitive package based on experience, including share options </li>\n<li>25 days of holiday a year (plus bank holidays)MacBook or Dell XPS 13/15</li>\n<li>Freedom to work wherever suits you best </li>\n<li>Two fantastic company Away-Weeks in a different European city each year (last one was in Bratislava in November 2019)</li>\n<li>Work alongside a supportive and talented team Grow and develop in a fast-moving, collaborative organisation </li>\n<li>Enjoy fun events in and around London organised by our Cultural Work Committee </li>\n<li>Learn to code or improve your existing skills with our Software Development Guild </li>\n<li>Convenient location in central London (Aldgate)</li>\n<li>Continuous supply of Pact coffee and healthy snacks </li>\n</ul>\n\n<p>Snowplow is dedicated to building and supporting a brilliant, diverse and hugely inclusive team. We don&#39;t discriminate against gender, race, religion or belief, disability, age, marital status or sexual orientation. Whatever your background may be, we welcome anyone with talent, drive and emotional intelligence.</p>\n",
      "position": "full-time",
      "experience": null,
      "visaSponsorship": true,
      "locations": [
        "London"
      ],
      "remote": true,
      "remoteLocations": [],
      "skills": [],
      "payment": {
        "salary": ""
      },
      "recruiter": {
        "title": null,
        "role": "Employee",
        "url": "https://angel.co/u/denika-campbell",
        "name": "Denika Campbell",
        "avatar": "https://angel.co/images/shared/nopic.png"
      },
      "refs": {
        "angelListId": "735381",
        "angelListUrl": "https://angel.co/company/snowplow-analytics-2/jobs/735381-"
      }
    },
    {
      "role": "Software Engineer",
      "title": "Site Reliability Engineer",
      "description": "Site Reliability Engineer (AWS)\nRemote, located in the UTC +/- 2 region \n\nSnowplow enables you to track any event data; ask any question of that data and use any tool you want to answer it. We want to empower people and companies to do transformative things using data. \n\nAs a company, we have almost doubled in size over the last 18 months and we’re not looking to slow down. To support our growth, we are now looking for an SRE (Site Reliability Engineer) to join our Tech Ops Team. You’ll be taking the lead on all things AWS including development and improvements of the current stack and rolling out new features - all whilst keeping these environments running smoothly. We would love to hear from you if the idea of programmatically controlling thousands of production environments excites you!.\n\nThe Opportunity: \n\nOur Private SaaS offering has grown significantly over the past year and we now orchestrate and monitor Snowplow event pipelines across more than 150 customer-owned AWS & GCP sub-accounts.  Each account has its own individualised and optimised stack and all are capable of processing many billions of events per month.\n\nWe are looking for another SRE to help us grow to managing 1,000 and then 10,000 AWS, GCP & Azure accounts. You will be pioneering solutions to managing estates of this size through cutting edge monitoring and automation. You’ll work closely with our Tech Ops Lead on all aspects of our proprietary deployment, orchestration and monitoring stacks.\n\nTech Ops has two areas of responsibility: the centralised services we provide customers and their pipeline infrastructure hosted in their own AWS or GCP accounts.  Within both domains we are striving to increase service reliability, fulfil customer requests in a timely fashion, and automate recurring tasks. Task automation is essential as our customer base grows, because our infrastructure estate scales linearly with our customer numbers, unlike most software businesses.\n\nThe challenge of automating the maintenance and deployment of thousands of individualised stacks is an enormously ambitious undertaking and a hugely exciting infrastructure automation challenge!\n\nThe environment you’ll be working in:\n\nOur company values are Transparency, Honesty, Ownership, Inclusivity, Empowerment, Customer-centricity, Growth and Technical Excellence. These aren’t just words we plucked out of thin air, we came up with them together as a company and are continually looking to find new ways to weave these into our day to day operations. From flexible hours and working locations to the way we give feedback, we’re passionate about building a company that supports both company and individual development.\n\nWhat you’ll be doing:\n\n- Maintaining and developing our growing Terraform infrastructure-as-code stacks which we use to deploy infrastructure for all internal and client use cases\n- Maintaining our internal infrastructure stacks which include the HashiCorp suite as well as our Snowplow Insights UI and VPNs\n- Participating in our on-call rotation to help us serve our client base 24/7Taking rotations of L3 Technical Support where you will be responsible for triaging and dealing with infrastructure issues\n- Handling high-severity internal or customer incidents, ensuring we meet all SLAs\n\nWhat you bring to the team:\n\n- Has worked with AWS in a production capacity - experience in GCP and/or Azure is a bonus\n- Has worked with Terraform, CloudFormation or some form of infrastructure-as-code tooling\n- Any experience with the HashiCorp stack (Vault, Consul, Nomad) and understanding their role in infrastructure automation is a bonusHas worked with Docker and is familiar with container-based architectures\n- Knowledgeable about the Linux operating system and how to manage servers in a production capacity\n- Knowledgeable about Cloud networking principles and how to troubleshoot issues in this space\n- Comfortable scripting in one or more of: Bash, Python, Ruby or PerlComfortable programming in one or more of: Java, Scala, Golang or Python\n\nWhat you’ll get in return\n\n- A competitive package based on experience, including share options\n- 25 days of holiday a year (plus bank holidays)\n- MacBook or Dell XPS 13/15\n- Two fantastic company Away Weeks in a different European city each year (the last one was in November 2019 in Bratislava)\n- Work alongside a supportive and talented team with the opportunity to work on cutting edge technology and challenging problems\n- Grow and develop in a fast-moving, collaborative organisation\n- Enjoy fun events in and around London organised by our Cultural Work Committee\n- If based in London, convenient office location in central London (Aldgate) and a continuous supply of Pact coffee and healthy snacks\n\n\n\n\n\nSnowplow is dedicated to building and supporting a brilliant, diverse and hugely inclusive team. We don't discriminate against gender, race, religion or belief, disability, age, marital status or sexual orientation. Whatever your background may be, we welcome anyone with talent, drive and emotional intelligence.\n",
      "descriptionHtml": "<p>Site Reliability Engineer (AWS)<br>\nRemote, located in the UTC +/- 2 region </p>\n\n<p>Snowplow enables you to track any event data; ask any question of that data and use any tool you want to answer it. We want to empower people and companies to do transformative things using data. </p>\n\n<p>As a company, we have almost doubled in size over the last 18 months and we’re not looking to slow down. To support our growth, we are now looking for an SRE (Site Reliability Engineer) to join our Tech Ops Team. You’ll be taking the lead on all things AWS including development and improvements of the current stack and rolling out new features - all whilst keeping these environments running smoothly. We would love to hear from you if the idea of programmatically controlling thousands of production environments excites you!.</p>\n\n<p>The Opportunity: </p>\n\n<p>Our Private SaaS offering has grown significantly over the past year and we now orchestrate and monitor Snowplow event pipelines across more than 150 customer-owned AWS &amp; GCP sub-accounts.  Each account has its own individualised and optimised stack and all are capable of processing many billions of events per month.</p>\n\n<p>We are looking for another SRE to help us grow to managing 1,000 and then 10,000 AWS, GCP &amp; Azure accounts. You will be pioneering solutions to managing estates of this size through cutting edge monitoring and automation. You’ll work closely with our Tech Ops Lead on all aspects of our proprietary deployment, orchestration and monitoring stacks.</p>\n\n<p>Tech Ops has two areas of responsibility: the centralised services we provide customers and their pipeline infrastructure hosted in their own AWS or GCP accounts.  Within both domains we are striving to increase service reliability, fulfil customer requests in a timely fashion, and automate recurring tasks. Task automation is essential as our customer base grows, because our infrastructure estate scales linearly with our customer numbers, unlike most software businesses.</p>\n\n<p>The challenge of automating the maintenance and deployment of thousands of individualised stacks is an enormously ambitious undertaking and a hugely exciting infrastructure automation challenge!</p>\n\n<p>The environment you’ll be working in:</p>\n\n<p>Our company values are Transparency, Honesty, Ownership, Inclusivity, Empowerment, Customer-centricity, Growth and Technical Excellence. These aren’t just words we plucked out of thin air, we came up with them together as a company and are continually looking to find new ways to weave these into our day to day operations. From flexible hours and working locations to the way we give feedback, we’re passionate about building a company that supports both company and individual development.</p>\n\n<p>What you’ll be doing:</p>\n\n<ul>\n<li>Maintaining and developing our growing Terraform infrastructure-as-code stacks which we use to deploy infrastructure for all internal and client use cases</li>\n<li>Maintaining our internal infrastructure stacks which include the HashiCorp suite as well as our Snowplow Insights UI and VPNs</li>\n<li>Participating in our on-call rotation to help us serve our client base 24/7Taking rotations of L3 Technical Support where you will be responsible for triaging and dealing with infrastructure issues</li>\n<li>Handling high-severity internal or customer incidents, ensuring we meet all SLAs</li>\n</ul>\n\n<p>What you bring to the team:</p>\n\n<ul>\n<li>Has worked with AWS in a production capacity - experience in GCP and/or Azure is a bonus</li>\n<li>Has worked with Terraform, CloudFormation or some form of infrastructure-as-code tooling</li>\n<li>Any experience with the HashiCorp stack (Vault, Consul, Nomad) and understanding their role in infrastructure automation is a bonusHas worked with Docker and is familiar with container-based architectures</li>\n<li>Knowledgeable about the Linux operating system and how to manage servers in a production capacity</li>\n<li>Knowledgeable about Cloud networking principles and how to troubleshoot issues in this space</li>\n<li>Comfortable scripting in one or more of: Bash, Python, Ruby or PerlComfortable programming in one or more of: Java, Scala, Golang or Python</li>\n</ul>\n\n<p>What you’ll get in return</p>\n\n<ul>\n<li>A competitive package based on experience, including share options</li>\n<li>25 days of holiday a year (plus bank holidays)</li>\n<li>MacBook or Dell XPS 13/15</li>\n<li>Two fantastic company Away Weeks in a different European city each year (the last one was in November 2019 in Bratislava)</li>\n<li>Work alongside a supportive and talented team with the opportunity to work on cutting edge technology and challenging problems</li>\n<li>Grow and develop in a fast-moving, collaborative organisation</li>\n<li>Enjoy fun events in and around London organised by our Cultural Work Committee</li>\n<li>If based in London, convenient office location in central London (Aldgate) and a continuous supply of Pact coffee and healthy snacks</li>\n</ul>\n\n<p>Snowplow is dedicated to building and supporting a brilliant, diverse and hugely inclusive team. We don&#39;t discriminate against gender, race, religion or belief, disability, age, marital status or sexual orientation. Whatever your background may be, we welcome anyone with talent, drive and emotional intelligence.</p>\n",
      "position": "full-time",
      "experience": null,
      "visaSponsorship": true,
      "locations": [
        "Europe"
      ],
      "remote": true,
      "remoteLocations": [],
      "skills": [],
      "payment": {
        "salary": ""
      },
      "recruiter": {
        "title": null,
        "role": "Employee",
        "url": "https://angel.co/u/denika-campbell",
        "name": "Denika Campbell",
        "avatar": "https://angel.co/images/shared/nopic.png"
      },
      "refs": {
        "angelListId": "733248",
        "angelListUrl": "https://angel.co/company/snowplow-analytics-2/jobs/733248-"
      }
    },
    {
      "role": "Software Engineer",
      "title": "Support Engineer",
      "description": "Support Engineer \nRemote,  UTC +7 to UTC+12\n\nOur Snowplow Insights offering has grown significantly over the last year, and we now orchestrate and monitor the Snowplow event pipeline for nearly 200 customers, many of them processing billions of events per month. The support that we provide to our customers is a core part of the Snowplow Insights offering, and we strive to provide the best technical support of any analytics vendor.\n\nWe have implemented a full “follow the sun” support model at Snowplow, with our six Support Engineers working in six well-distributed time zones (East & West Coast US, Canada, Spain, Portugal, Russia). We are now looking to hire an additional Support Engineer in the UTC +7 to UTC +12 time zone range. \n\nThis is a Support Engineering role - not a Support Agent role. We are looking for candidates who can learn, troubleshoot and explain the many complex technical systems that make up the Snowplow offering. We expect you to have an analytical mind, a high level of customer empathy and an enthusiasm for improving processes and systems. Depending on where your passions lie, there is a path from Support Engineering at Snowplow into Customer Success, Implementation Services, Tech Ops or Engineering.\n\nResponsibilities for our Support Engineer will include\n- Handling customer tickets in Zendesk, resolving if possible or escalating further to our Customer Success, Implementation Services, Tech Ops, Engineering or Product teams.\n- Handling Snowplow pipeline incidents in OpsGenie, communicating the failure to our customers and either resolving if possible, or working with the customer and/or Snowplow teams to resolve.\n- Providing help to the open-source Snowplow community in our Discourse forums.\n- Working with customers on regular support tasks including: upgrading their Snowplow pipelines; sharing security best practices; enabling new Snowplow features for their account.\n- Creating playbooks, documentation and software to reduce your support workload even as we add more customers.\n- Collaborating with Snowplow teams on bug fixes and new features for both our open source projects and our proprietary orchestration and monitoring technology.\n- Constant awareness of open and ongoing issues and actively checking and updating open tickets.\n\nExcellent customer support is at the core of Snowplow’s commercial offering. You will join the support rotation, and take on an agreed number of evening and weekend support hours (compensated both in money and time). While the ongoing Snowplow Insights support commitment is the first priority, our Support Engineers will regularly take full days to work on projects that are strategic for the Support team or wider company.\n\n\nThe environment you’ll be working in\nOur company values are Transparency, Honesty, Ownership, Inclusivity, Empowerment, Customer-centricity, Growth and Technical Excellence. These aren’t just words we plucked out of thin air, we came up with them together as a company and are continually looking to find new ways to weave these into our day to day operations. From flexible hours and working locations to the way we give feedback, we’re passionate about building a company that supports both company and individual development. \n\nWe’d love to get to know you if:\n\nData or programming is your thing! This role would be a great fit for somebody who has completed an analytically rigorous degree or programming bootcamp, or has experience in programming, QA or other automation.\nYou enjoy helping people. You communicate with clarity and empathy.\nNew programming language? You’re on it! You have a broad technical curiosity and proven technical understanding.\nBroader business challenges interest you. Snowplow customers are highly technology- and data-literate, and expect Snowplow Insights support to be responsive, well-informed and always mindful of their business goals.\nI have an idea! You have a passion for problem solving.\nCan we automate? Yes, we can. You will be constantly working with customers and internal Snowplow teams to solve Snowplow Insights problems in as effective, time-efficient and repeatable way as possible - you must love troubleshooting.\nProcess makes perfect. You have a mature attitude to security, documentation and process.\nReliability is key. Snowplow Insights customers trust us with their event pipelines and AWS and GCP accounts - this is a huge responsibility and informs everything we do.\n\nWhat you’ll get in return\nA competitive package, including share options\n25 days of holiday a year (plus bank holidays)\nMacBook or Dell XPS 13/15\nFreedom to work wherever suits you best \nTwo fantastic company Away Weeks in a different European city each year (the last one was in Bratislava in November!)\nWork alongside a supportive and talented team with the opportunity to work on cutting edge technology and challenging problems\nGrow and develop in a fast-moving, collaborative organisation \nConvenient location in central London (Aldgate)\nContinuous supply of Pact coffee and healthy snacks in the office when you’re here!\n\n\n\n\n",
      "descriptionHtml": "<p>Support Engineer <br>\nRemote,  UTC +7 to UTC+12</p>\n\n<p>Our Snowplow Insights offering has grown significantly over the last year, and we now orchestrate and monitor the Snowplow event pipeline for nearly 200 customers, many of them processing billions of events per month. The support that we provide to our customers is a core part of the Snowplow Insights offering, and we strive to provide the best technical support of any analytics vendor.</p>\n\n<p>We have implemented a full “follow the sun” support model at Snowplow, with our six Support Engineers working in six well-distributed time zones (East &amp; West Coast US, Canada, Spain, Portugal, Russia). We are now looking to hire an additional Support Engineer in the UTC +7 to UTC +12 time zone range. </p>\n\n<p>This is a Support Engineering role - not a Support Agent role. We are looking for candidates who can learn, troubleshoot and explain the many complex technical systems that make up the Snowplow offering. We expect you to have an analytical mind, a high level of customer empathy and an enthusiasm for improving processes and systems. Depending on where your passions lie, there is a path from Support Engineering at Snowplow into Customer Success, Implementation Services, Tech Ops or Engineering.</p>\n\n<p>Responsibilities for our Support Engineer will include</p>\n\n<ul>\n<li>Handling customer tickets in Zendesk, resolving if possible or escalating further to our Customer Success, Implementation Services, Tech Ops, Engineering or Product teams.</li>\n<li>Handling Snowplow pipeline incidents in OpsGenie, communicating the failure to our customers and either resolving if possible, or working with the customer and/or Snowplow teams to resolve.</li>\n<li>Providing help to the open-source Snowplow community in our Discourse forums.</li>\n<li>Working with customers on regular support tasks including: upgrading their Snowplow pipelines; sharing security best practices; enabling new Snowplow features for their account.</li>\n<li>Creating playbooks, documentation and software to reduce your support workload even as we add more customers.</li>\n<li>Collaborating with Snowplow teams on bug fixes and new features for both our open source projects and our proprietary orchestration and monitoring technology.</li>\n<li>Constant awareness of open and ongoing issues and actively checking and updating open tickets.</li>\n</ul>\n\n<p>Excellent customer support is at the core of Snowplow’s commercial offering. You will join the support rotation, and take on an agreed number of evening and weekend support hours (compensated both in money and time). While the ongoing Snowplow Insights support commitment is the first priority, our Support Engineers will regularly take full days to work on projects that are strategic for the Support team or wider company.</p>\n\n<p>The environment you’ll be working in<br>\nOur company values are Transparency, Honesty, Ownership, Inclusivity, Empowerment, Customer-centricity, Growth and Technical Excellence. These aren’t just words we plucked out of thin air, we came up with them together as a company and are continually looking to find new ways to weave these into our day to day operations. From flexible hours and working locations to the way we give feedback, we’re passionate about building a company that supports both company and individual development. </p>\n\n<p>We’d love to get to know you if:</p>\n\n<p>Data or programming is your thing! This role would be a great fit for somebody who has completed an analytically rigorous degree or programming bootcamp, or has experience in programming, QA or other automation.<br>\nYou enjoy helping people. You communicate with clarity and empathy.<br>\nNew programming language? You’re on it! You have a broad technical curiosity and proven technical understanding.<br>\nBroader business challenges interest you. Snowplow customers are highly technology- and data-literate, and expect Snowplow Insights support to be responsive, well-informed and always mindful of their business goals.<br>\nI have an idea! You have a passion for problem solving.<br>\nCan we automate? Yes, we can. You will be constantly working with customers and internal Snowplow teams to solve Snowplow Insights problems in as effective, time-efficient and repeatable way as possible - you must love troubleshooting.<br>\nProcess makes perfect. You have a mature attitude to security, documentation and process.<br>\nReliability is key. Snowplow Insights customers trust us with their event pipelines and AWS and GCP accounts - this is a huge responsibility and informs everything we do.</p>\n\n<p>What you’ll get in return<br>\nA competitive package, including share options<br>\n25 days of holiday a year (plus bank holidays)<br>\nMacBook or Dell XPS 13/15<br>\nFreedom to work wherever suits you best <br>\nTwo fantastic company Away Weeks in a different European city each year (the last one was in Bratislava in November!)<br>\nWork alongside a supportive and talented team with the opportunity to work on cutting edge technology and challenging problems<br>\nGrow and develop in a fast-moving, collaborative organisation <br>\nConvenient location in central London (Aldgate)<br>\nContinuous supply of Pact coffee and healthy snacks in the office when you’re here!</p>\n",
      "position": "full-time",
      "experience": null,
      "visaSponsorship": true,
      "locations": [
        "Canada",
        "Europe",
        "Russia",
        "Spain",
        "United States",
        "London",
        "Germany",
        "France",
        "United Kingdom",
        "Poland",
        "Italy",
        "Greece",
        "Portugal",
        "Remote"
      ],
      "remote": true,
      "remoteLocations": [],
      "skills": [],
      "payment": {
        "salary": "$95k – $140k"
      },
      "recruiter": {
        "title": null,
        "role": "Employee",
        "url": "https://angel.co/u/denika-campbell",
        "name": "Denika Campbell",
        "avatar": "https://angel.co/images/shared/nopic.png"
      },
      "refs": {
        "angelListId": "699715",
        "angelListUrl": "https://angel.co/company/snowplow-analytics-2/jobs/699715-"
      }
    },
    {
      "role": "Sales",
      "title": "Technical Customer Success Manager",
      "description": "Technical Customer Success Manager \nIdeally located in London or Amsterdam\n\nIt’s a hugely exciting time here at Snowplow. Over the last 7 years, we’ve grown to a brilliant 50 person team that is spread out over 14 countries with nearly 150 customers and many, many more open source users. Snowplow is growing fast, having recently closed its Series A fundraising with MMC Ventures. \n\nAt Snowplow, we want to empower people to do transformative things using data. We work with companies from around the world to help them better understand their customers and products, and develop a truly data-driven culture. \n\nTo support our growth, we’re in the process of building out our Customer Success function with a mission to retain, activate, upsell and delight our customers. This is one of the most exciting, strategic and quickly evolving teams at Snowplow.\n\nWe’re looking for our first European Technical Customer Success recruit to join our Customer Success team and own a  portfolio of high-profile customer relationships from day one. This role could be a great fit if you have experience in Technical Account Management, Solutions Engineering or Technical Customer Success for a complex software product. We are still interested to hear from you if you have a different background that you think would make you a great fit.\n\nThe Opportunity:\n\nAt Snowplow we see Customer Success as a key growth function of the business. We don’t see Customer Success merely as a retention function but as a key to exceeding our ambitious Net Revenue Retention targets, driving Snowplow adoption across our customers’ organisations. \n\nOn a day to day basis, you will completely own a portfolio of large strategic accounts; these accounts will be across multiple verticals and located across Europe, mainly in London, Berlin and Amsterdam. You will own the customer relationship from both a commercial and technical perspective, from onboarding through to continued renewal and activation. From initial activation, you will help our customers unpick complex business needs and translate those into solution designs on top of the Snowplow product, working alongside our own Solutions Architects. You will work collaboratively with stakeholders at your accounts to map and realize the value they want to derive from our platform, driving wider institutional adoption of Snowplow as you go. You will serve as the internal voice of your customers at Snowplow.\n\nCustomer Success at Snowplow isn’t about by-the-numbers ‘check-ins’ with customers - our regular customer conversations are informed by a deep empathy with our customers’ business needs, and a data-driven understanding of their current product usage. At Snowplow, you will get the customer and product exposure to continue to develop into a subject matter expert in the fast-growing data and analytics space. As a Technical Customer Success Manager at Snowplow, you will work with our largest European customers, like Auto Trader, Omio, WeTransfer and some of Europe’s biggest and best known media companies. \n\nThe environment you’ll be working in:\nOur company values are Transparency, Honesty, Ownership, Inclusivity, Empowerment, Customer-centricity, Growth and Technical Excellence. These aren’t just words we plucked out of thin air, we came up with them together as a company and are continually looking to find new ways to weave these into our day to day operations. From flexible hours and working locations to the way we give feedback, we’re passionate about building a company that supports both company and individual development.\n\nWhat you’ll be doing:\n- Actively serving a portfolio of assigned European accounts including major consumer, prosumer and B2B brands.\n- Working on new customer onboarding to map their business needs and design Snowplow centred solutions tailored to their use cases and business logic.\n- Collaborate with customers in a highly strategic manner to develop their success roadmap for the first 12 months of Snowplow adoption and beyond.\n- Work with customers to quantify business value and ROI, solidifying the value of Snowplow to the organisation.\n- Develop collaboratively with our Solution Architects the technical artefacts that support organisational success of Snowplow (data models, data product design specs, tracking strategies etc).\n- Proactively identifying and closing opportunities for upsell, uplift and account expansion and ensuring where this requires wider implementation of our product that this is technically and commercially sound.\n- Develop domain expertise in our key verticals through deep customer collaborations, general research and attending industry events/conferences.\n- Identify product feedback from customers, spotting trends and surfacing to help shape product roadmap\n\nWhat you bring to the team:\n\n- You’re not a newbie to customer success. Minimum 2 years experience as a Technical Customer Success Manager, Solutions Engineer or Technical Account Manager (ideally accounts with ACV $200k+)\n- Data is your thing. A solid understanding of the data space - cloud infrastructure, database technologies, visualisation tools and other enabling technologies\n- You understand people. Deeply emotionally intelligent, you can quickly read a room of stakeholders and adopt your delivery style and content quickly\n- It’s the circle of.. a customer. Firm understanding of Software-as-a-Service commercial dynamics and customer lifecycle, including renewals, churn, upsell and uplift \n- Confidence is key. Previous experience with a complex software product, ideally designing solutions and gathering requirements, you are comfortable communicating with senior technical stakeholders (CTO, VP Eng, Tech Leads)\n- Business challenge? Let me help. A passion for working at the intersection of technology and business problems - this role is always about delivering business impact for our customers through data\n- You CAN see the needle in the haystack. Highly developed commercial acumen - as a trusted advisor to our clients you will be pivotal in spotting new opportunities where Snowplow could add even more value to our customers - you have worked in a business function with upsell/NRR targets\n- Jet setter? This one’s for you. Willingness to travel 40% of the time - primarily Europe - but also willingness to travel internationally, we love to see our customers face to face\n\nWhat you’ll get in return \n- A competitive package including share options\n- 23 days of holiday a year (plus bank holidays)401(k) and health insurance \n- MacBook or Dell XPS 13/15\n- Two fantastic company Away Weeks in a different European city each year (the last one was in Bratislava in November 2019)\n- Work alongside a supportive and talented team with the opportunity to work on cutting edge technology and challenging problems\n- Grow and develop in a fast-moving, collaborative organisation\n\n\n\n\n\n\nSnowplow is dedicated to building and supporting a brilliant, diverse and hugely inclusive team. We don't discriminate against gender, race, religion or belief, disability, age, marital status or sexual orientation. Whatever your background may be, we welcome anyone with talent, drive and emotional intelligence.\n\n",
      "descriptionHtml": "<p>Technical Customer Success Manager <br>\nIdeally located in London or Amsterdam</p>\n\n<p>It’s a hugely exciting time here at Snowplow. Over the last 7 years, we’ve grown to a brilliant 50 person team that is spread out over 14 countries with nearly 150 customers and many, many more open source users. Snowplow is growing fast, having recently closed its Series A fundraising with MMC Ventures. </p>\n\n<p>At Snowplow, we want to empower people to do transformative things using data. We work with companies from around the world to help them better understand their customers and products, and develop a truly data-driven culture. </p>\n\n<p>To support our growth, we’re in the process of building out our Customer Success function with a mission to retain, activate, upsell and delight our customers. This is one of the most exciting, strategic and quickly evolving teams at Snowplow.</p>\n\n<p>We’re looking for our first European Technical Customer Success recruit to join our Customer Success team and own a  portfolio of high-profile customer relationships from day one. This role could be a great fit if you have experience in Technical Account Management, Solutions Engineering or Technical Customer Success for a complex software product. We are still interested to hear from you if you have a different background that you think would make you a great fit.</p>\n\n<p>The Opportunity:</p>\n\n<p>At Snowplow we see Customer Success as a key growth function of the business. We don’t see Customer Success merely as a retention function but as a key to exceeding our ambitious Net Revenue Retention targets, driving Snowplow adoption across our customers’ organisations. </p>\n\n<p>On a day to day basis, you will completely own a portfolio of large strategic accounts; these accounts will be across multiple verticals and located across Europe, mainly in London, Berlin and Amsterdam. You will own the customer relationship from both a commercial and technical perspective, from onboarding through to continued renewal and activation. From initial activation, you will help our customers unpick complex business needs and translate those into solution designs on top of the Snowplow product, working alongside our own Solutions Architects. You will work collaboratively with stakeholders at your accounts to map and realize the value they want to derive from our platform, driving wider institutional adoption of Snowplow as you go. You will serve as the internal voice of your customers at Snowplow.</p>\n\n<p>Customer Success at Snowplow isn’t about by-the-numbers ‘check-ins’ with customers - our regular customer conversations are informed by a deep empathy with our customers’ business needs, and a data-driven understanding of their current product usage. At Snowplow, you will get the customer and product exposure to continue to develop into a subject matter expert in the fast-growing data and analytics space. As a Technical Customer Success Manager at Snowplow, you will work with our largest European customers, like Auto Trader, Omio, WeTransfer and some of Europe’s biggest and best known media companies. </p>\n\n<p>The environment you’ll be working in:<br>\nOur company values are Transparency, Honesty, Ownership, Inclusivity, Empowerment, Customer-centricity, Growth and Technical Excellence. These aren’t just words we plucked out of thin air, we came up with them together as a company and are continually looking to find new ways to weave these into our day to day operations. From flexible hours and working locations to the way we give feedback, we’re passionate about building a company that supports both company and individual development.</p>\n\n<p>What you’ll be doing:</p>\n\n<ul>\n<li>Actively serving a portfolio of assigned European accounts including major consumer, prosumer and B2B brands.</li>\n<li>Working on new customer onboarding to map their business needs and design Snowplow centred solutions tailored to their use cases and business logic.</li>\n<li>Collaborate with customers in a highly strategic manner to develop their success roadmap for the first 12 months of Snowplow adoption and beyond.</li>\n<li>Work with customers to quantify business value and ROI, solidifying the value of Snowplow to the organisation.</li>\n<li>Develop collaboratively with our Solution Architects the technical artefacts that support organisational success of Snowplow (data models, data product design specs, tracking strategies etc).</li>\n<li>Proactively identifying and closing opportunities for upsell, uplift and account expansion and ensuring where this requires wider implementation of our product that this is technically and commercially sound.</li>\n<li>Develop domain expertise in our key verticals through deep customer collaborations, general research and attending industry events/conferences.</li>\n<li>Identify product feedback from customers, spotting trends and surfacing to help shape product roadmap</li>\n</ul>\n\n<p>What you bring to the team:</p>\n\n<ul>\n<li>You’re not a newbie to customer success. Minimum 2 years experience as a Technical Customer Success Manager, Solutions Engineer or Technical Account Manager (ideally accounts with ACV $200k+)</li>\n<li>Data is your thing. A solid understanding of the data space - cloud infrastructure, database technologies, visualisation tools and other enabling technologies</li>\n<li>You understand people. Deeply emotionally intelligent, you can quickly read a room of stakeholders and adopt your delivery style and content quickly</li>\n<li>It’s the circle of.. a customer. Firm understanding of Software-as-a-Service commercial dynamics and customer lifecycle, including renewals, churn, upsell and uplift </li>\n<li>Confidence is key. Previous experience with a complex software product, ideally designing solutions and gathering requirements, you are comfortable communicating with senior technical stakeholders (CTO, VP Eng, Tech Leads)</li>\n<li>Business challenge? Let me help. A passion for working at the intersection of technology and business problems - this role is always about delivering business impact for our customers through data</li>\n<li>You CAN see the needle in the haystack. Highly developed commercial acumen - as a trusted advisor to our clients you will be pivotal in spotting new opportunities where Snowplow could add even more value to our customers - you have worked in a business function with upsell/NRR targets</li>\n<li>Jet setter? This one’s for you. Willingness to travel 40% of the time - primarily Europe - but also willingness to travel internationally, we love to see our customers face to face</li>\n</ul>\n\n<p>What you’ll get in return </p>\n\n<ul>\n<li>A competitive package including share options</li>\n<li>23 days of holiday a year (plus bank holidays)401(k) and health insurance </li>\n<li>MacBook or Dell XPS 13/15</li>\n<li>Two fantastic company Away Weeks in a different European city each year (the last one was in Bratislava in November 2019)</li>\n<li>Work alongside a supportive and talented team with the opportunity to work on cutting edge technology and challenging problems</li>\n<li>Grow and develop in a fast-moving, collaborative organisation</li>\n</ul>\n\n<p>Snowplow is dedicated to building and supporting a brilliant, diverse and hugely inclusive team. We don&#39;t discriminate against gender, race, religion or belief, disability, age, marital status or sexual orientation. Whatever your background may be, we welcome anyone with talent, drive and emotional intelligence.</p>\n",
      "position": "full-time",
      "experience": null,
      "visaSponsorship": false,
      "locations": [
        "London",
        "Amsterdam"
      ],
      "remote": false,
      "remoteLocations": [],
      "skills": [],
      "payment": {
        "salary": ""
      },
      "recruiter": {
        "title": null,
        "role": "Employee",
        "url": "https://angel.co/u/denika-campbell",
        "name": "Denika Campbell",
        "avatar": "https://angel.co/images/shared/nopic.png"
      },
      "refs": {
        "angelListId": "697951",
        "angelListUrl": "https://angel.co/company/snowplow-analytics-2/jobs/697951-"
      }
    },
    {
      "role": "Sales",
      "title": "VP, Sales",
      "description": "VP Sales\nLocated in London.\n\nWhy join us?\nThe companies that win today are those that put an understanding of their customers and prospects at the heart of their organisation; the investment in a central data team is an essential part of this journey. COVID-19 and the global switch-off of the in-person economy is accelerating these trends: interacting with and understanding your customers online is key to surviving and thriving in the new environment.\n\nAt Snowplow we are focused on powering the data journey that these central data teams are embarking on. To win in the new world, it’s essential that the data team can focus on the journey to value and mastery, and not get derailed by costly data delivery issues or burdensome organizational complexity. Snowplow helps data teams to do this, offering a data delivery platform that collects and operationalizes behavioral data, at scale.\n\nIt’s an exciting time here at Snowplow. We are actively selling in 14 countries with over 150 customers; Snowplow is well placed to weather the coming economic storm, having recently closed its Series A fundraising with MMC Ventures.\n\nThe opportunity\nTo support us with our ambitious goals, we are now looking for a motivated and talented VP Sales who can help to establish and drive our GTM strategy. Reporting directly to Alex, our CEO, the VP Sales will play a crucial role in growing and developing the commercial team and collaborating with Marketing and Product to futureproof the business and scale internationally. \n\nThe right candidate has successfully made it through two key transitions.\n\nFirstly, they have personally transitioned from a charismatic quota-bearing rep to a servant-leader who understands that their path to results is by growing and mentoring a strong bench of individual salespeople. They have grown into somebody who is data-driven, pioneers effective new processes and believes strongly in cross-functional alignment.\n\nSecondly, they have personally transitioned at least one software startup from the early stage $1-5m ARR level, where success is still stubbornly ‘improbable’, to the $10-15m ARR mark, where success is, to quote Jason Lemkin, ‘inevitable’.\n\nWho we are\nOur values are Transparency, Honesty, Empowerment, Ownership, Inclusivity, Customer-centricity, Growth and Technical Excellence. These aren’t just words we plucked out of thin air, we came up with them together as a company and are continually looking to find new ways to weave these into our day to day operations. From flexible hours and working locations to the way we give feedback, we’re passionate about building a company that supports both company and individual development.\n\nYour key responsibilities will include:\n- Cracking the puzzle of building predictable and meaningful sales growth in a COVID-19 world.\n- Developing, executing and refining the sales process, owning all aspects of new business in order to deliver on significant growth targets.\n- Integrating our sales efforts into a broader ‘sandwich strategy’, underpinned by significant bottom-up product- and community-led growth efforts targeted at the core contributors in the data team.\n- Supporting and driving our go-to-market pivot from a horizontal playbook to one focused on the few verticals and business models expected to do better in a COVID-19 world.\n- Providing highly detailed and accurate sales forecasting, putting in place systems and infrastructure to support the success of the sales function and giving essential sales visibility to the CEO and Board.\n- Experimenting with and then systematizing our push into larger enterprise-scale customers.\n- Preparing the Sales team for significant scaling across all functions.\n- Working closely with our VP Marketing, Chrissie Jamieson, and growing Marketing team.\n- Working closely with our CPO and Co-founder, Yali Sassoon, plus our Pricing Committee, on the key aspects of pricing and packaging.\n- Working closely with our substantial Customer Office, including a VP Customer joining later this year who will own the Net Revenue Retention goal.\n\nIdeal Profile:\n- 3-5 years’ experience at a global VP Sales or CRO level at a software vendor; sorry, EMEA-scoped Sales or GM roles don’t count towards this.\n- Experience with selling SaaS to mid-sized as well as enterprise customers.\n- Directly responsible for scaling at least one software startup from $1-3m ARR to $10m ARR (or higher).Ability to work as part of a senior leadership team to develop and implement commercial strategy in line with the overall strategic goals of the organisation.\n- Data-driven and process-orientated, including a bias towards Sales Process Engineering approaches.\n- Extremely strong at managing software sales teams (including recruiting, developing and retaining top-class, consultative sales personnel), and fostering a culture of experimentation and learning.\n- Deep knowledge of different sales methodologies, confident command of pricing, packaging and negotiating multi-year deals to break into new customer market segments.\n- Experience collaborating and working closely with Marketing, Product and Customer to ensure strategic alignment and success.\n- Comfortable with highly technical, horizontal platforms, and selling into technical leaders such as CTO, Chief Data Officer, Head of Data.\n\nWhat you’ll get in return\n- A competitive package based on experience, including share options\n- 25 days of holiday a year (plus bank holidays)\n- MacBook or Dell XPS 13/15\n- COVID-19 permitting, two fantastic company Away Weeks in a different European city each year (the last one was in Bratislava in November 2019)\n- Work alongside a supportive and talented team with the opportunity to work on cutting edge technology and challenging problems\n- Grow and develop in a fast-moving, collaborative organisation\n- Enjoy fun events in and around London organised by our Cultural Work Committee\n- Convenient location in central London (Aldgate)\n- Continuous supply of Pact coffee and healthy snacks\n\n\n\n\nSnowplow is dedicated to building and supporting a brilliant, diverse and hugely inclusive team. We don't discriminate against gender, race, religion or belief, disability, age, marital status or sexual orientation. Whatever your background may be, we welcome anyone with talent, drive and emotional intelligence.\n",
      "descriptionHtml": "<p>VP Sales<br>\nLocated in London.</p>\n\n<p>Why join us?<br>\nThe companies that win today are those that put an understanding of their customers and prospects at the heart of their organisation; the investment in a central data team is an essential part of this journey. COVID-19 and the global switch-off of the in-person economy is accelerating these trends: interacting with and understanding your customers online is key to surviving and thriving in the new environment.</p>\n\n<p>At Snowplow we are focused on powering the data journey that these central data teams are embarking on. To win in the new world, it’s essential that the data team can focus on the journey to value and mastery, and not get derailed by costly data delivery issues or burdensome organizational complexity. Snowplow helps data teams to do this, offering a data delivery platform that collects and operationalizes behavioral data, at scale.</p>\n\n<p>It’s an exciting time here at Snowplow. We are actively selling in 14 countries with over 150 customers; Snowplow is well placed to weather the coming economic storm, having recently closed its Series A fundraising with MMC Ventures.</p>\n\n<p>The opportunity<br>\nTo support us with our ambitious goals, we are now looking for a motivated and talented VP Sales who can help to establish and drive our GTM strategy. Reporting directly to Alex, our CEO, the VP Sales will play a crucial role in growing and developing the commercial team and collaborating with Marketing and Product to futureproof the business and scale internationally. </p>\n\n<p>The right candidate has successfully made it through two key transitions.</p>\n\n<p>Firstly, they have personally transitioned from a charismatic quota-bearing rep to a servant-leader who understands that their path to results is by growing and mentoring a strong bench of individual salespeople. They have grown into somebody who is data-driven, pioneers effective new processes and believes strongly in cross-functional alignment.</p>\n\n<p>Secondly, they have personally transitioned at least one software startup from the early stage $1-5m ARR level, where success is still stubbornly ‘improbable’, to the $10-15m ARR mark, where success is, to quote Jason Lemkin, ‘inevitable’.</p>\n\n<p>Who we are<br>\nOur values are Transparency, Honesty, Empowerment, Ownership, Inclusivity, Customer-centricity, Growth and Technical Excellence. These aren’t just words we plucked out of thin air, we came up with them together as a company and are continually looking to find new ways to weave these into our day to day operations. From flexible hours and working locations to the way we give feedback, we’re passionate about building a company that supports both company and individual development.</p>\n\n<p>Your key responsibilities will include:</p>\n\n<ul>\n<li>Cracking the puzzle of building predictable and meaningful sales growth in a COVID-19 world.</li>\n<li>Developing, executing and refining the sales process, owning all aspects of new business in order to deliver on significant growth targets.</li>\n<li>Integrating our sales efforts into a broader ‘sandwich strategy’, underpinned by significant bottom-up product- and community-led growth efforts targeted at the core contributors in the data team.</li>\n<li>Supporting and driving our go-to-market pivot from a horizontal playbook to one focused on the few verticals and business models expected to do better in a COVID-19 world.</li>\n<li>Providing highly detailed and accurate sales forecasting, putting in place systems and infrastructure to support the success of the sales function and giving essential sales visibility to the CEO and Board.</li>\n<li>Experimenting with and then systematizing our push into larger enterprise-scale customers.</li>\n<li>Preparing the Sales team for significant scaling across all functions.</li>\n<li>Working closely with our VP Marketing, Chrissie Jamieson, and growing Marketing team.</li>\n<li>Working closely with our CPO and Co-founder, Yali Sassoon, plus our Pricing Committee, on the key aspects of pricing and packaging.</li>\n<li>Working closely with our substantial Customer Office, including a VP Customer joining later this year who will own the Net Revenue Retention goal.</li>\n</ul>\n\n<p>Ideal Profile:</p>\n\n<ul>\n<li>3-5 years’ experience at a global VP Sales or CRO level at a software vendor; sorry, EMEA-scoped Sales or GM roles don’t count towards this.</li>\n<li>Experience with selling SaaS to mid-sized as well as enterprise customers.</li>\n<li>Directly responsible for scaling at least one software startup from $1-3m ARR to $10m ARR (or higher).Ability to work as part of a senior leadership team to develop and implement commercial strategy in line with the overall strategic goals of the organisation.</li>\n<li>Data-driven and process-orientated, including a bias towards Sales Process Engineering approaches.</li>\n<li>Extremely strong at managing software sales teams (including recruiting, developing and retaining top-class, consultative sales personnel), and fostering a culture of experimentation and learning.</li>\n<li>Deep knowledge of different sales methodologies, confident command of pricing, packaging and negotiating multi-year deals to break into new customer market segments.</li>\n<li>Experience collaborating and working closely with Marketing, Product and Customer to ensure strategic alignment and success.</li>\n<li>Comfortable with highly technical, horizontal platforms, and selling into technical leaders such as CTO, Chief Data Officer, Head of Data.</li>\n</ul>\n\n<p>What you’ll get in return</p>\n\n<ul>\n<li>A competitive package based on experience, including share options</li>\n<li>25 days of holiday a year (plus bank holidays)</li>\n<li>MacBook or Dell XPS 13/15</li>\n<li>COVID-19 permitting, two fantastic company Away Weeks in a different European city each year (the last one was in Bratislava in November 2019)</li>\n<li>Work alongside a supportive and talented team with the opportunity to work on cutting edge technology and challenging problems</li>\n<li>Grow and develop in a fast-moving, collaborative organisation</li>\n<li>Enjoy fun events in and around London organised by our Cultural Work Committee</li>\n<li>Convenient location in central London (Aldgate)</li>\n<li>Continuous supply of Pact coffee and healthy snacks</li>\n</ul>\n\n<p>Snowplow is dedicated to building and supporting a brilliant, diverse and hugely inclusive team. We don&#39;t discriminate against gender, race, religion or belief, disability, age, marital status or sexual orientation. Whatever your background may be, we welcome anyone with talent, drive and emotional intelligence.</p>\n",
      "position": "full-time",
      "experience": null,
      "visaSponsorship": false,
      "locations": [
        "London"
      ],
      "remote": false,
      "remoteLocations": [],
      "skills": [],
      "payment": {
        "salary": ""
      },
      "recruiter": {
        "title": null,
        "role": "Employee",
        "url": "https://angel.co/u/denika-campbell",
        "name": "Denika Campbell",
        "avatar": "https://angel.co/images/shared/nopic.png"
      },
      "refs": {
        "angelListId": "790258",
        "angelListUrl": "https://angel.co/company/snowplow-analytics-2/jobs/790258-"
      }
    }
  ]
}