{
  "name": "Zero Gravity",
  "avatar": "https://photos.angel.co/startups/i/7397649-6066f0a54aee3f93f6e98b59cbe3b6e1-medium_jpg.jpg?buster=1578313211",
  "slogan": "Putting a rocket into social mobility with digital technology",
  "description": "Where we start off in life often pins us down - almost like gravity. At Zero Gravity we will do whatever is digitally possible to reach and direct the UK’s brightest young talent to succeed, no matter their backgrounds.\n\nIt’s already started with our digital mentoring platform: current university undergraduates mentor the next generation of top talent via our web app. In our award-winning pilot, over 100 mentees achieved places at Oxford and Cambridge, leading to widespread media coverage, including BBC News, The Times, Daily Telegraph, and others. Now we are ready to connect more mentees with more mentors into more universities. \n\nThe connectivity continues so our undergraduate members can access the best graduate employment programmes. Ultimately, Zero Gravity will be the go-to personal development app in the pocket of every talented school student. And the essential place top universities and employers want to access, who now recognise the competitive advantage of recruiting from a diverse talent pool.",
  "links": [
    {
      "type": "website",
      "url": "https://zerogravity.co.uk"
    },
    {
      "type": "blog",
      "url": ""
    },
    {
      "type": "twitter",
      "url": ""
    },
    {
      "type": "facebook",
      "url": ""
    },
    {
      "type": "linkedIn",
      "url": ""
    },
    {
      "type": "productHunt",
      "url": ""
    }
  ],
  "locations": [
    "London"
  ],
  "marketTags": [
    "Mobile",
    "Education",
    "Social Media Platforms",
    "Recruiting",
    "Education Technology"
  ],
  "employees": "SIZE_1_10",
  "funding": {
    "totalRaised": 0,
    "rounds": []
  },
  "team": [
    {
      "title": null,
      "role": "Employee",
      "url": "https://angel.co/u/bill-westwater",
      "name": "Bill Westwater",
      "avatar": "https://photos.angel.co/users/10466680-medium_jpg?1578593386",
      "bioHtml": ""
    },
    {
      "title": "Founder & CEO",
      "role": "Employee",
      "url": "https://angel.co/u/joe-seddon-2",
      "name": "Joe Seddon",
      "avatar": "https://photos.angel.co/users/10451187-medium_jpg?1578312987",
      "bioHtml": "Founder &amp; CEO of Zero Gravity. Building a community of the UK&#39;s most exciting young talent, and transforming the odds in the social mobility sector."
    }
  ],
  "perks": [],
  "refs": {
    "angelListId": "7397649",
    "angelListUrl": "https://angel.co/company/zero-gravity-uk"
  },
  "jobs": []
}